{
    "Northrop Grumman": [
        {
            "company": "Northrop Grumman",
            "role_name": "Corporate Software Engineering Director 1",
            "score": 82.0,
            "fit_reason": "The candidate has high-level technical leadership, experience revising DevOps standards, implementing CI/CD, and overseeing serverless architecture using modern tools (Python, Docker, Terraform), which aligns well with shaping enterprise software strategy and modernization.",
            "missing_skills": [
                "10+ years in software engineering management roles",
                "Experience leading enterprise-wide Councils/CoEs",
                "Experience spanning multiple business units/driving enterprise-wide transformation"
            ],
            "link": "https://www.clearancejobs.com/jobs/8694472/corporate-software-engineering-director-1",
            "location": "El Segundo, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "RELOCATION ASSISTANCE: No relocation assistance available\nCLEARANCE TYPE: Secret\nTRAVEL: Yes, 10% of the Time\nDescription\nAt Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people's lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation's history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work - and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history.\nNorthrop Grumman Corporate is seeking a full-time\nCorporate Software Engineering Director 1\nto lead the enterprise-wide Software Engineering Council/Center of Excellence (CoE) and represent the Software Engineering function at the corporate level. Reporting to the Corporate Enterprise Engineering Senior Director, the Director will shape the vision, strategy, and execution of software engineering across the company, partnering with sector and CIDO leaders to strengthen discipline performance, develop talent, and keep the organization at the forefront of modern software practices and technologies.\nThe qualified candidate must be located within the continental United States near an existing Northrop Grumman facility. This is not a remote position.\nJob Scope and Responsibilities:\nEstablish a centralized Software Engineering function aligned with the overall enterprise engineering vision.\nChair the Software Engineering Leadership Group (SWLG).\nLead the Software Engineering Council/CoE, defining strategy, priorities, and working-group structures in collaboration with sector leadership.\nPartner with HR, Communications, and sector teams to design and execute a comprehensive change-management plan.\nDefine a unified talent-development framework that includes training, tools, career pathways, and certification programs.\nWork with CIDO to adopt converged processes and tools that support modern software development.\nDevelop and enforce enterprise-wide software processes and governance that meet both corporate and sector needs.\nIdentify and drive continuous-process improvements, communicating updates on behalf of the Council/CoE.\nEstablish metrics and data sources to measure software-engineering execution effectiveness across the enterprise.\nBenchmark our processes against government, industry, and best-practice standards.\nOwn the Enterprise Software Principles and Operating Procedures (PrOP).\nHelp the company effectively integrate artificial intelligence into software engineering processes and engineering products/platforms, ensuring AI adoption enhances productivity, quality, and innovation.\nEscalate critical issues and strategic discussions to the Executive Leadership Team, Enterprise Engineering Leadership Team, and Corporate Technology Council as required.\nBuild strong partnerships with sector leaders and other functional groups, determining objectives, interpreting policies, and ensuring alignment with long-range planning.\nFacilitate internal and external engagement at events such as Engineer's Week and SW all-hands.\nProvide enterprise-wide expertise on existing capabilities, technologies, and platform interconnections.\nBrief and influence senior customer executives.\nBasic Qualifications:\nBachelor's degree in a STEM field with at least 12 years of software engineering experience OR Master's degree in a STEM field with at least 10 years of software engineering experience.\nMinimum of 10 years in software engineering management roles (e.g., program IPT lead or functional leadership).\nMinimum 7 years of systems engineering experience.\nCandidates must have a current DOD\nSecret\nlevelsecurity clearance (or higher) in order to be considered and must have the ability to obtain, and maintain, access to\nSAP/SAR\nas a condition of continued employment.\nProven record of leading change-management initiatives.\nExperience on large-scale, cross-sector development programs with integrated workforce operations.\nDemonstrated ability to lead direct reports and manage teams.\nTravel is occasional for meetings, events, and customer engagements.\nPreferred Qualifications:\nMaster's degree in STEM, MBA, or higher.\nCurrent Top Secret/SCI clearance.\nFamiliarity with the Northrop Grumman portfolio.\nExperience identifying, developing, and integrating strategic technologies and design solutions.\nSkilled in stakeholder communications, ensuring program information is defined, collected, shared, stored, and retrieved effectively.\nDemonstrated collaboration across multiple disciplinary areas.\nLeadership of digital-transformation or multi-year initiatives that improve software-engineering effectiveness.\nIn-depth knowledge of DoD and Intelligence Community processes.\nExperience spanning multiple Northrop Grumman business units, driving change through initiatives, AOP, and LRSP.\nPrimary Level Salary Range: $193,800.00 - $336,500.00\nThe above salary range represents a general guideline; however, Northrop Grumman considers a number of factors when determining base salary offers such as the scope and responsibilities of the position and the candidate's experience, education, skills and current market conditions.\nDepending on the position, employees may be eligible for overtime, shift differential, and a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business.\nThe application period for the job is estimated to be 20 days from the job posting date. However, this timeline may be shortened or extended depending on business needs and the availability of qualified candidates.\nNorthrop Grumman is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO and pay transparency statement, please visit http://www.northropgrumman.com/EEO. U.S. Citizenship is required for all positions with a government clearance and certain other restricted positions."
        }
    ],
    "Lockheed Martin": [],
    "Anduril Industries": [
        {
            "company": "Anduril Industries",
            "role_name": "Air Dominance & Strike - Mission Software Engineering, Software",
            "score": 92.0,
            "fit_reason": "The candidate has direct experience leading software architecture, engineering CI/CD pipelines, using Python/Java/JS, implementing security protocols (OTP), and working in Agile environments to deliver high-throughput capabilities, aligning perfectly with V&V for mission software.",
            "missing_skills": [
                "Experience with DO-178 and MIL-HDBK-516C verification objectives (preferred)",
                "Experience standing up automated HIL testing (preferred)"
            ],
            "link": "https://www.clearancejobs.com/jobs/8695354/air-dominance-strike-mission-software-engineering-software",
            "location": "Costa Mesa, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Anduril Industries is a defense technology company with a mission to transform U.S. and allied military capabilities with advanced technology. By bringing the expertise, technology, and business model of the 21st century's most innovative companies to the defense industry, Anduril is changing how military systems are designed, built and sold. Anduril's family of systems is powered by Lattice OS, an AI-powered operating system that turns thousands of data streams into a realtime, 3D command and control center. As the world enters an era of strategic competition, Anduril is committed to bringing cutting-edge autonomy, AI, computer vision, sensor fusion, and networking technology to the military in months, not years.\nJOB DESCRIPTION\nAnduril's Air Dominance and Strike Division is seeking a Software Verification and Validation Engineer. Our software engineering teams in AD&S are integral to development of flight system solutions in all domains for our warfighters. As a critical member of our team, this role is pivotal in contributing to the evolution of the company's verification and validation processes and methodologies.\nWHAT YOU'LL DO\nLead the definition, design, and execution of product verification and validation activities throughout the product development life cycle\nImplement and automate software verification tests by defining and delivering test cases written against software requirements\nAnalyze and simulate requirements per customer specifications or developed internal product requirements\nReview use cases, requirements, and specifications for products to ensure that requirements and specifications can be verified and validated\nThe review also includes risk mitigations, usability, and regulatory requirements\nExecute complex testing, perform in-depth statistical analysis, and interpret results independently\nEnsure that testing and results are traced to requirements; activities are completed with objective evidence\nSummarize results in reports with conclusions or recommendations\nAs a hands-on subject matter expert, lead ad hoc testing and potential failure mode analysis to characterize product designs and performance\nConduct V&V Design Reviews as specified in project plans, and in accordance with company procedure\nMaintain knowledge of current regulatory requirements and standards as they pertain to the development and testing of products\nProvide technical leadership to a growing team\nGain a working understanding of Anduril's business lines and collaborate with leaders to build cohesive, end-to-end experiences for our users\nBe an advocate for excellent engineering culture across the team\nREQUIRED QUALIFICATIONS\nBachelor's degree in Computer Science, Computer Engineering, Robotics, Electrical Engineering, or related field, or equivalent experience\n4+ years of experience in Software testing or related technical experience\nExperience with requirements based verification and implementation of verification strategies with a strong emphasis on automated tests\nHave extensive knowledge of software development, processes, and verification tools, such as C/C++, Python\nTrack record of architecting software test plans in the Aerospace and Defense space\nIn-depth knowledge of requirements management, risk based testing approaches, defect tracking, and configuration control\nStrong Knowledge of Software Testing Principles And Methodologies\nExperience in Software Development Life Cycle And Software Verification Techniques\nKnowledge of Software Quality Assurance Tools And Techniques\nEligible to obtain and maintain an active U.S. Top Secret SCI security clearance\nPREFERRED QUALIFICATIONS\nExperience standing up automated hardware-in-the-loop testing infrastructure\nFunctional knowledge of software development, verification, and validation requirements for DO-178 and MIL-HDBK-516C\nExperience developing testable requirements and understanding of DO-178 and MIL-HDBK-516C verification objectives\nCurrent eligibility at the Top Secret level preferred\nUS Salary Range\n$166,000 - $220,000 USD\nThe salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including:\nHealthcare Benefits\nUS Roles:  Comprehensive medical, dental, and vision plans at little to no cost to you.\nUK & AUS Roles:  We cover full cost of medical insurance premiums for you and your dependents.\nIE Roles:  We offer an annual contribution toward your private health insurance for you and your dependents.\nAdditional Benefits\nIncome Protection  : Anduril covers life and disability insurance for all employees.\nGenerous time off  : Highly competitive PTO plans with a holiday hiatus in December. Caregiver & Wellness Leave is available to care for family members, bond with a new baby, or address your own medical needs.\nFamily Planning & Parenting Support:  Coverage for fertility treatments (e.g., IVF, preservation), adoption, and gestational carriers, along with resources to support you and your partner from planning to parenting.\nMental Health Resources:  Access free mental health resources 24/7, including therapy and life coaching. Additional work-life services, such as legal and financial support, are also available.\nProfessional Development:  Annual reimbursement for professional development\nCommuter Benefits:  Company-funded commuter benefits based on your region.\nRelocation Assistance:  Available depending on role eligibility.\nRetirement Savings Plan\nUS Roles:  Traditional 401(k), Roth, and after-tax (mega backdoor Roth) options.\nUK & IE Roles:  Pension plan with employer match.\nAUS Roles:  Superannuation plan.\nThe recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.\nTo view Anduril's candidate data privacy policy, please visit https://anduril.com/applicant-privacy-notice/ .\nCreate a Job Alert\nInterested in building your career at Anduril Industries? Get future opportunities sent straight to your email.\nCreate alert"
        },
        {
            "company": "Anduril Industries",
            "role_name": "Chief Engineer, Edge Data Mesh (Clearance Required)",
            "score": 90.0,
            "fit_reason": "The candidate has strong experience leading technical architecture (AWS, Terraform), engineering high-throughput data pipelines, working with Java/Python, and designing robust data/security solutions (OTP, Cross Domain transfer), making them highly suitable for leading an edge data mesh architecture.",
            "missing_skills": [
                "Experience building distributed systems in disconnected scenarios (implied by Cross Domain work, but not explicit)",
                "Data Model design and implementation (preferred)"
            ],
            "link": "https://www.clearancejobs.com/jobs/8695376/chief-engineer-edge-data-mesh-clearance-required",
            "location": "Costa Mesa, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Anduril Industries is a defense technology company with a mission to transform U.S. and allied military capabilities with advanced technology. By bringing the expertise, technology, and business model of the 21st century's most innovative companies to the defense industry, Anduril is changing how military systems are designed, built and sold. Anduril's family of systems is powered by Lattice OS, an AI-powered operating system that turns thousands of data streams into a realtime, 3D command and control center. As the world enters an era of strategic competition, Anduril is committed to bringing cutting-edge autonomy, AI, computer vision, sensor fusion, and networking technology to the military in months, not years.\nABOUT THE TEAM\nThe Connected Warfare Division builds mission-critical systems that enable global command and control for time-sensitive, multi-domain operations. By fusing robotics, sensor networks, and advanced software, we create connected mesh ecosystems that empower our military partners with a comprehensive source of truth for rapid decision-making. Our Mission Command group is at the forefront of delivering software solutions that integrate seamlessly with hundreds of thousands of endpoints worldwide, ensuring operational superiority on a global scale.\nABOUT THE JOB\nAnduril's Connected Warfare team is seeking a Chief Engineer to join our team supporting Mission Command. The Mission Command area focuses on how Anduril's Lattice software runs across the far edge to interconnect both Anduril and other systems to provide the ability to share data and task assets across the globe.\nAs a Chief Engineer, you will be responsible for delivering mission outcomes within Anduril programs by driving the design, definition and delivery of the edge data mesh using Lattice. Working through complicated disconnected and distributed edge computing scenarios that require solving complicated integration and edge. This role also includes working directly with customers to design solutions that enable them to meet critical mission needs with the Lattice Mesh.\nWHAT YOU'LL DO\nDrive technical strategy for Lattice mesh across contracts and and deployments to create a common fabric\nLead complicated customer exercises that will demonstrate capabilities in real world scenarios\nLead technical deep dives and definition of problems to enable solutions\nLead operations of platform deployed across the globe\nDrive architecture and design of solutions that and create buy-in with customers\nWrite code that creates capabilities for the Lattice Mesh and integrates with customer solutions\nCORE REQUIREMENTS\nCurrently possesses and is able to maintain an active U.S. Top Secret Clearance\nStrong engineering background from industry or school, ideally in areas/fields such as Computer Science, Software Engineering, Mathematics, or Physics\n10+ years working with a variety of programming languages such as Java, Python, C++, Rust, Go, JavaScript, etc.\nExperience building software solutions involving significant amounts of data processing and analysis\nAbility to quickly understand and navigate complex systems and established code bases\nPREFERRED QUALIFICATIONS\nExperience building distributed systems that operate in disconnected scenarios\nExperience leading teams of engineers to deliver for critical customer outcomes\nData Model design experience and implementation\nAbility to demonstrate capabilities and communicate across a wide range of technical levels and drive understanding\nUS Salary Range\n$191,000 - $336,000 USD\nThe salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including:\nHealthcare Benefits\nUS Roles:  Comprehensive medical, dental, and vision plans at little to no cost to you.\nUK & AUS Roles:  We cover full cost of medical insurance premiums for you and your dependents.\nIE Roles:  We offer an annual contribution toward your private health insurance for you and your dependents.\nAdditional Benefits\nIncome Protection  : Anduril covers life and disability insurance for all employees.\nGenerous time off  : Highly competitive PTO plans with a holiday hiatus in December. Caregiver & Wellness Leave is available to care for family members, bond with a new baby, or address your own medical needs.\nFamily Planning & Parenting Support:  Coverage for fertility treatments (e.g., IVF, preservation), adoption, and gestational carriers, along with resources to support you and your partner from planning to parenting.\nMental Health Resources:  Access free mental health resources 24/7, including therapy and life coaching. Additional work-life services, such as legal and financial support, are also available.\nProfessional Development:  Annual reimbursement for professional development\nCommuter Benefits:  Company-funded commuter benefits based on your region.\nRelocation Assistance:  Available depending on role eligibility.\nRetirement Savings Plan\nUS Roles:  Traditional 401(k), Roth, and after-tax (mega backdoor Roth) options.\nUK & IE Roles:  Pension plan with employer match.\nAUS Roles:  Superannuation plan.\nThe recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.\nTo view Anduril's candidate data privacy policy, please visit https://anduril.com/applicant-privacy-notice/ .\nCreate a Job Alert\nInterested in building your career at Anduril Industries? Get future opportunities sent straight to your email.\nCreate alert"
        },
        {
            "company": "Anduril Industries",
            "role_name": "Senior Software Engineer, Payloads, Surface Maritime",
            "score": 88.0,
            "fit_reason": "The candidate is an experienced Lead Developer proficient in Python, Java, and system architecture, capable of designing and implementing complex software sub-systems, real-time components (implied by high-throughput work), and optimizing logic.",
            "missing_skills": [
                "Extensive experience writing C (preferred)",
                "Experience with RTOS or specific communication buses (CAN, MIL-STD-1553)",
                "Experience with DO-178 or IEC 61508 certifications"
            ],
            "link": "https://www.clearancejobs.com/jobs/8692404/senior-software-engineer-payloads-surface-maritime",
            "location": "Costa Mesa, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Anduril Industries is a defense technology company with a mission to transform U.S. and allied military capabilities with advanced technology. By bringing the expertise, technology, and business model of the 21st century's most innovative companies to the defense industry, Anduril is changing how military systems are designed, built and sold. Anduril's family of systems is powered by Lattice OS, an AI-powered operating system that turns thousands of data streams into a realtime, 3D command and control center. As the world enters an era of strategic competition, Anduril is committed to bringing cutting-edge autonomy, AI, computer vision, sensor fusion, and networking technology to the military in months, not years.\nABOUT THE TEAM\nThe Maritime Software Engineering team builds, deploys, integrates, extends, and scales Anduril's software on Maritime platforms to deliver mission-critical capabilities to our customers. As the software engineers closest to Anduril customers and end-users, Mission Software Engineers solve technical challenges of operational scenarios while owning the end-to-end delivery of winning capabilities.\nABOUT THE JOB\nAs a Senior Software Engineer, Payloads you will solve a wide variety of problems involving networking, autonomy, systems integration, robotics, and more, while making pragmatic engineering tradeoffs along the way. You will be the leading edge of the Maritime Software team - working in a tight feedback loop with vehicle platform software engineers and ensuring that Anduril products seamlessly work together to achieve a variety of critical outcomes. Above all, Mission Software Engineers are driven by a \"Whatever It Takes\" mindset-executing in an expedient , scalable , and pragmatic way while keeping the mission top-of-mind and making sound engineering decisions to deliver successful outcomes correctly, on-time, and with high quality.\nWHAT YOU'LL DO\nDesign and implement trusted, safety critical Payload Management Systems that balance constraints, restrictions and requirements in a multi-stakeholder environment\nDesign and implement scalable payload sub-systems including sensor processing, state estimation, contingency management, actuation, payload interfaces, and mission systems interfaces\nDevelop real-time embedded software using an RTOS\nDevelop device drivers and interfaces to a variety of sensors and actuators\nCreate test and simulation fixtures that operate with both software-and hardware-in-the-loop\nSupport payload manufacturing and deployment\nREQUIRED QUALIFICATIONS\nBachelor's degree in Robotics, Mechatronics, Computer Science, Engineering, a relevant field, or equivalent experience\nProfessional experience working as a Software Engineer with one or more domains and/or technologies of competence\nSystems programming skills including algorithms, data structures, concurrency and optimization\nCapacity learn and grow individually, while mentoring junior team members effectively, contributing to team cohesion and capacity\nCapacity to learn and grow individually, while mentoring junior team members effectively, contributing to team cohesion and capacity\nExperience troubleshooting and analyzing remotely deployed software systems\nTravel up to 30% of time to build, test, and deploy capabilities in the real world\nEligible to obtain and maintain an active U.S. Top Secret security clearance\nPREFERRED QUALIFICATIONS\nExperience in design and development of embedded applications in autonomous vehicle software systems\nExperienced and proficient at writing C\nFamiliarity with communications busses and protocols (e.g. CAN, CANFD, UART/RS232/RS422/RS485, SPI, QSPI, I2C, Ethernet, ARINC-825, ARINC-429, MIL-STD-1553, etc)\nExperience with an RTOS\nExperience with development of high assurance safety critical software applications\nExperience in developing interfaces to sensors and actuators\nExperience troubleshooting and analyzing remotely deployed software systems\nExperience working with and testing electrical and mechanical systems\nExperience with DO-178, IEC 61508, or similar certifications\nFamiliarity with navigation and communications systems\nDesire to grow in to a Tech-Lead-Manager role, with responsibility for line management of engineers, in addition to delivery\nExperience working with RF systems\nUS Salary Range\n$191,000 - $253,000 USD\nThe salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including:\nHealthcare Benefits\nUS Roles:  Comprehensive medical, dental, and vision plans at little to no cost to you.\nUK & AUS Roles:  We cover full cost of medical insurance premiums for you and your dependents.\nIE Roles:  We offer an annual contribution toward your private health insurance for you and your dependents.\nAdditional Benefits\nIncome Protection  : Anduril covers life and disability insurance for all employees.\nGenerous time off  : Highly competitive PTO plans with a holiday hiatus in December. Caregiver & Wellness Leave is available to care for family members, bond with a new baby, or address your own medical needs.\nFamily Planning & Parenting Support:  Coverage for fertility treatments (e.g., IVF, preservation), adoption, and gestational carriers, along with resources to support you and your partner from planning to parenting.\nMental Health Resources:  Access free mental health resources 24/7, including therapy and life coaching. Additional work-life services, such as legal and financial support, are also available.\nProfessional Development:  Annual reimbursement for professional development\nCommuter Benefits:  Company-funded commuter benefits based on your region.\nRelocation Assistance:  Available depending on role eligibility.\nRetirement Savings Plan\nUS Roles:  Traditional 401(k), Roth, and after-tax (mega backdoor Roth) options.\nUK & IE Roles:  Pension plan with employer match.\nAUS Roles:  Superannuation plan.\nThe recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.\nTo view Anduril's candidate data privacy policy, please visit https://anduril.com/applicant-privacy-notice/ .\nCreate a Job Alert\nInterested in building your career at Anduril Industries? Get future opportunities sent straight to your email.\nCreate alert"
        },
        {
            "company": "Anduril Industries",
            "role_name": "Director Software Engineering, Developer Platform and Infrastruc",
            "score": 85.0,
            "fit_reason": "The candidate has extensive experience in leading software development, cloud architecture (AWS), DevOps, CI/CD, and various relevant technologies (Python, Docker, Terraform), aligning well with the platform and infrastructure leadership required.",
            "missing_skills": [
                "Rust or Go experience (preferred)",
                "Experience with embedded systems/firmware deployment (preferred)",
                "Experience building/deploying SDKs (preferred)"
            ],
            "link": "https://www.clearancejobs.com/jobs/8695431/director-software-engineering-developer-platform-and-infrastruc",
            "location": "Costa Mesa, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Anduril Industries is a defense technology company with a mission to transform U.S. and allied military capabilities with advanced technology. By bringing the expertise, technology, and business model of the 21st century's most innovative companies to the defense industry, Anduril is changing how military systems are designed, built and sold. Anduril's family of systems is powered by Lattice OS, an AI-powered operating system that turns thousands of data streams into a realtime, 3D command and control center. As the world enters an era of strategic competition, Anduril is committed to bringing cutting-edge autonomy, AI, computer vision, sensor fusion, and networking technology to the military in months, not years.\nABOUT THE TEAM\nThe Developer Platform and Infrastructure organization is responsible for the core developer platform that enables our internal business lines to build on a software platform to deliver innovative defense products. The organization is responsible for creating internal tools and platform abstractions that significantly enhance productivity, reliability, and scalability across the company. As the Head of Developer Platform and Infrastructure, you will lead strategic initiatives, set architectural direction and manage a cross-functional team of engineers dedicated to internal platform innovation.\nThis role will be based out of our HQ in Costa Mesa, Ca.\nWHAT YOU'LL DO\nLead and manage a diverse team of software engineers and technical leaders.\nOwn, drive, and execute strategic vision and technical roadmap for Developer Platform.\nOwn building the heartbeat & rhythm of releases of the Developer Platform to most efficiently enable Anduril to leverage & move fast to deliver products. Enable key stakeholders with a best in class Developer Platform.\nDrive architectural alignment and ensure robust, scalable platform abstractions and internal tooling.\nFoster strong collaboration with cross-functional stakeholders, including product managers, infrastructure teams, and engineering leadership.\nCoordinate across all of Software Platform to create optimized flow of many software products into a scalable release methodology.\nOversee technical excellence, reliability, and scalability of internal software platforms and services.\nChampion best practices in software development, DevOps, security, and continuous improvement.\nREQUIRED QUALIFICATIONS\n10+ years of software engineering experience with at least 5 years in senior management or leadership roles.\nProven track record leading software platform teams, developing internal tooling, and platform-level abstractions.\nStrong technical background in distributed systems, microservices architecture, and platform design.\nDeep proficiency in software engineering principles & architecture especially API's, microservices and service-oriented architecture (SOA). Experience with programming languages (Rust, Go, Python, C++, React, or similar)\nDeep proficiency in Data architectures & experience with Data platforms. DB experience with SQL/NoSQL.\nDemonstrated success managing teams across multiple complex projects and initiatives.\nExceptional strategic thinking, problem-solving, and decision-making abilities.\nStrong leadership, mentoring, and communication skills with cross-functional teams.\nFostering a culture of accountability, continuous learning, and innovation within the team.\nAbility to quickly understand and navigate complex systems and detailed requirements.\nAbility to align Developer Platform, Release, & Automation initiatives with business goals and drive measurable results\nProficiency in cloud platforms (AWS, Azure, GCP), containerization technologies (Docker, Kubernetes), infrastructure-as-code (Terraform, etc.), and modern DevOps practices.\nProficiency in DevOps tools, practices, and principles (CI/CD, automation, Testing, QA, etc.)\nExperience with risk management and security best practices.\nDeveloping and implementing robust rollback plans to quickly recover from issues and minimize the impact of problematic releases\nImplementing monitoring and observability solutions to track application performance, infrastructure health, & key metrics.\nAnalyzing data and identifying areas for process improvement and optimization to enhance software delivery speed and reliability.\nAdvocating for cost efficiency throughout the software development lifecycle, optimizing cloud resource utilization, and enforcing governance policies.\nMust be authorized to work in the United States\nPREFERRED QUALIFICATIONS\nExperience scaling and managing large-scale developer infrastructure and enterprise-grade platforms.\nFamiliarity with authentication, authorization systems, fine-grained permissions, and security practices.\nBackground in automated testing methodologies, AI-driven testing, and advanced CI/CD tooling.\nExperience driving platform innovation and adoption across large organizations.\nExperience with embedded systems & building software that can be deployed on physical products. Experience with NixOs, pushing firmware updates, drivers, boot sequences, etc.\nExperience with building & deploying SDK's\nUS Salary Range\n$228,000 - $342,000 USD\nThe salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including:\nHealthcare Benefits\nUS Roles:  Comprehensive medical, dental, and vision plans at little to no cost to you.\nUK & AUS Roles:  We cover full cost of medical insurance premiums for you and your dependents.\nIE Roles:  We offer an annual contribution toward your private health insurance for you and your dependents.\nAdditional Benefits\nIncome Protection  : Anduril covers life and disability insurance for all employees.\nGenerous time off  : Highly competitive PTO plans with a holiday hiatus in December. Caregiver & Wellness Leave is available to care for family members, bond with a new baby, or address your own medical needs.\nFamily Planning & Parenting Support:  Coverage for fertility treatments (e.g., IVF, preservation), adoption, and gestational carriers, along with resources to support you and your partner from planning to parenting.\nMental Health Resources:  Access free mental health resources 24/7, including therapy and life coaching. Additional work-life services, such as legal and financial support, are also available.\nProfessional Development:  Annual reimbursement for professional development\nCommuter Benefits:  Company-funded commuter benefits based on your region.\nRelocation Assistance:  Available depending on role eligibility.\nRetirement Savings Plan\nUS Roles:  Traditional 401(k), Roth, and after-tax (mega backdoor Roth) options.\nUK & IE Roles:  Pension plan with employer match.\nAUS Roles:  Superannuation plan.\nThe recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.\nTo view Anduril's candidate data privacy policy, please visit https://anduril.com/applicant-privacy-notice/ .\nCreate a Job Alert\nInterested in building your career at Anduril Industries? Get future opportunities sent straight to your email.\nCreate alert"
        },
        {
            "company": "Anduril Industries",
            "role_name": "Configuration Manager",
            "score": 80.0,
            "fit_reason": "The candidate's current role involves revising DevOps standards, CI/CD, and architecture design, suggesting strong system process knowledge. The concept of secure data architecture and RBAC is relevant to configuration control, though specific CM standards (Teamcenter/EBOMs) are not explicitly listed.",
            "missing_skills": [
                "5+ years of proven direct product configuration management experience",
                "Experience with Teamcenter",
                "Experience with formal CM standards (EIA649/C, MIL-HDBK-61B)"
            ],
            "link": "https://www.clearancejobs.com/jobs/8695393/configuration-manager",
            "location": "Costa Mesa, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Anduril Industries is a defense technology company with a mission to transform U.S. and allied military capabilities with advanced technology. By bringing the expertise, technology, and business model of the 21st century's most innovative companies to the defense industry, Anduril is changing how military systems are designed, built and sold. Anduril's family of systems is powered by Lattice OS, an AI-powered operating system that turns thousands of data streams into a realtime, 3D command and control center. As the world enters an era of strategic competition, Anduril is committed to bringing cutting-edge autonomy, AI, computer vision, sensor fusion, and networking technology to the military in months, not years.\nABOUT THE TEAM\nAnduril Intelligence Systems (AIS) is focused on positioning Anduril as a lead provider of specialized engineering and products for Intelligence Community (IC) customers. This role will be an integral partner to Anduril's Product and Program Teams. We work within the IC to understand their requirements, shape their concepts of operation, and deliver exquisite capability across their problem set. We aim to develop and deploy critically needed capabilities that address our customers' most pressing national security requirements.\nABOUT THE JOB\nAnduril is seeking an experienced Configuration Manager to lead Anduril's configuration management and change control activities across multiple programs in its Costa Mesa location. The role includes the opportunity to define and commission a digital engineering infrastructure from scratch that will enable best-in-class capabilities in model-based engineering, digital factory design, digital manufacturing and pioneer building and deploying configuration management AI tools. As a Configuration Manager, you will work closely with the leaders of critical Anduril programs to manage a highly dynamic and fast-paced design, engineering, and manufacturing environment. The Configuration Manager will be the focal point for capturing and defining the baseline for a program's requirements, design, testing, manufacturing, and sustainment data structures (requirements baseline, EBOM, MBOM, SOM, BOP etc.).\nWHAT YOU'LL DO\nBe an integral partner to Anduril's Product and Program Teams by:\nDefining the configuration management plans for key programs.\nEnsuring that supported programs have robust and comprehensive configuration identification processes and documentation.\nManaging the end-to-end configuration control process including engineering release, facilitating critical configuration control forums such as CCB and CRB.\nWorking with Configuration Management Analysts to build and maintain configuration status accounting dashboards ensure that that critical data is captured, recorded and distributed (decisions recorded, ECRs and ECNs populated, implementation checklists written etc.)\nCoordinating and leading configuration audits (functional configuration audits, physical configuration audits etc.)\nOwn end-to-end change management for key programs:\nEnsuring that all engineering change requests are appropriately documented, reviewed, approved, and communicated in a timely manner.\nSetting agendas for configuration management meetings (Technical Review Board, Change Control Board etc.) ahead of time.\nGenerating, populating, and submitting change requests including manage compilation and synthesis of impact analyses.\nBe the leader for critical configuration management activities and forums by:\nOrganizing and managing critical configuration control forums (the Change Review Board, the Change Control Board) including scheduling, owning the agenda, and vetting facilitation of materials (business cases, inventory disposition recommendations, effectivity analyses etc.).\nLeading the Change Control Board meeting and driving discussions to decisions.\nCommunicating and distributing conclusions and decisions made in configuration management forums (CCB, TRB etc.).\nBe responsible for product configuration by:\nAnalyzing product baselines (EBOM, MBOMs etc.) in Teamcenter for compliance to industry and organization standards.\nSupporting configuration management reviews and audits, including FCA/PCA and provide direction before, during and after the events to prevent or resolve issues.\nPerforming periodic audits of as-built records as product definition data in Teamcenter (EBOM, MBOM etc.)\nBe the expert resource for the Product for Engineering Release and Change Management standards by:\nModeling the use of Teamcenter software to manage Engineering changes, including part revisions, EBOM/MBOM/SBOM updates, documentation modifications, and associated workflows.\nProviding guidance and support to Engineering teams in configuring the Engineering, Manufacturing and Service Bills of Materials (EBOM, MBOM, SBOM).\nREQUIRED QUALIFICATIONS\n5+ years of proven direct product configuration management experience (Product structure, parts, drawings and requirements management).\n5+ years of demonstrated experience working in high complexity and high-rate production environments (aerospace, automotive, security systems, medical devices, nuclear).\nCurrently possesses and is able to maintain an active U.S. Secret security clearance.\nFamiliar with configuration management principles and practices (EIA649/C, MIL-HDBK-61B).\nExperience with product lifecycle management (PLM) and/or data management toolsets for configuration management of complex products\nPossess high attention to detail and strong organizational skills.\nExcellent written and verbal communication skills - you must have an ability to synthesize complex quantitative data into clear decision statements.\nBA/BS in an engineering discipline (Mechanical, Electrical, Aerospace, Nuclear, Manufacturing)\nAbility to earn trust, maintain positive and professional relationships, and contribute to our inclusive culture.\nPREFERRED QUALIFICATIONS\nProven experience in aerospace industry\nProficient in technical writing of processes and procedures\nExperience with Teamcenter, Teamcenter Requirements, Teamcenter Quality, Confluence & JIRA.\nDatabase skills with SQL queries, etc.\nCertification in CM2 or equivalent configuration management certification.\nUS Salary Range\n$166,000 - $220,000 USD\nThe salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including:\nHealthcare Benefits\nUS Roles:  Comprehensive medical, dental, and vision plans at little to no cost to you.\nUK & AUS Roles:  We cover full cost of medical insurance premiums for you and your dependents.\nIE Roles:  We offer an annual contribution toward your private health insurance for you and your dependents.\nAdditional Benefits\nIncome Protection  : Anduril covers life and disability insurance for all employees.\nGenerous time off  : Highly competitive PTO plans with a holiday hiatus in December. Caregiver & Wellness Leave is available to care for family members, bond with a new baby, or address your own medical needs.\nFamily Planning & Parenting Support:  Coverage for fertility treatments (e.g., IVF, preservation), adoption, and gestational carriers, along with resources to support you and your partner from planning to parenting.\nMental Health Resources:  Access free mental health resources 24/7, including therapy and life coaching. Additional work-life services, such as legal and financial support, are also available.\nProfessional Development:  Annual reimbursement for professional development\nCommuter Benefits:  Company-funded commuter benefits based on your region.\nRelocation Assistance:  Available depending on role eligibility.\nRetirement Savings Plan\nUS Roles:  Traditional 401(k), Roth, and after-tax (mega backdoor Roth) options.\nUK & IE Roles:  Pension plan with employer match.\nAUS Roles:  Superannuation plan.\nThe recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.\nTo view Anduril's candidate data privacy policy, please visit https://anduril.com/applicant-privacy-notice/ .\nCreate a Job Alert\nInterested in building your career at Anduril Industries? Get future opportunities sent straight to your email.\nCreate alert"
        }
    ],
    "Epsilon Systems Solutions, Inc.": [],
    "Viasat, Inc.": [],
    "Boeing": [],
    "AV, Inc.": [],
    "Aerospace Corporation": [],
    "Cydecor": [
        {
            "company": "Cydecor",
            "role_name": "Information Systems Security Specialists (Mid to Senior Level) -",
            "score": 88.0,
            "fit_reason": "The candidate has direct experience conducting security risk/vulnerability assessments, aligning with RMF principles, and experience with NIST/frameworks, making for a high match in the security policy/IA domain.",
            "missing_skills": [
                "Hands-on RMF artifact development (SSP, SAR, POA&M) in eMASS",
                "Experience with ACAS, STIGs, SCAP",
                "DoD 8570 IAT Level II Certification (or equivalent)"
            ],
            "link": "https://www.clearancejobs.com/jobs/8719491/information-systems-security-specialists-mid-to-senior-level",
            "location": "San Diego, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Cydecor is a premier Federal Government solutions provider, delivering differentiated innovations in mission systems and business platforms.  We leverage leading-edge secure systems and software development, backed by industry-leading subject matter expertise, and business intelligence to enable decision-support and remain ahead of ever-evolving national security challenges.  Our success rests squarely on three bedrock principles: People, our center of gravity; Mission, what inspires us; and an unyielding commitment to Excellence, what separates us.\nJob Description:\nCydecor is seeking Information Systems Security Specialists (Mid to Senior Level) to provide cybersecurity engineering, RMF compliance, and information assurance support for Navy tactical networks and associated information systems in support of PMW 160 programs. This role supports the security lifecycle of complex DoD systems, ensuring compliance with DoD, Navy, and RMF requirements across development, integration, testing, and sustainment phases.\nResponsibilities include but are not limited to:\nSupport Risk Management Framework (RMF) activities across the full system lifecycle, including system categorization, control selection, implementation, assessment, authorization, and continuous monitoring\nDevelop, maintain, and update RMF artifacts (SSP, SAP, SAR, POA&M, ATO packages) in eMASS\nConduct security control implementation and validation in accordance with NIST 800-53, DoDI 8510.01, and Navy cybersecurity policies\nPerform vulnerability analysis and remediation using ACAS, STIGs, SCAP, and HBSS/HBSS-related tools\nCoordinate with Authorizing Officials (AO), ISSMs, ISSOs, engineers, and program stakeholders to support ATOs, renewals, and system changes\nSupport system hardening, configuration management, and security testing activities for tactical networks\nAssess and document security impacts of system changes, patches, and upgrades\nSupport incident response activities, cybersecurity reporting, and compliance audits\nProvide cybersecurity guidance to engineering and operations teams to ensure secure system design and sustainment\nParticipate in technical reviews, security working groups, and program reviews as required\nHere's what you need:\nInformation Systems Security Specialist - Mid Level\n5+ years of experience supporting DoD or Navy cybersecurity / RMF efforts\nHands-on experience developing and maintaining RMF documentation and ATO packages\nWorking knowledge of NIST 800-53, RMF, STIGs, ACAS, and DoD cybersecurity policies\nExperience supporting classified systems and tactical or operational networks\nAbility to work independently with limited supervision and collaborate across technical teams\nInformation Systems Security Specialist - Senior Level\n8+ years of experience supporting DoD or Navy cybersecurity / RMF efforts\nDemonstrated experience leading RMF efforts for complex systems and portfolios\nProven ability to interface directly with AOs, senior government stakeholders, and program leadership\nAdvanced knowledge of Navy tactical networks, enclave architectures, and cybersecurity compliance\nExperience mentoring junior cybersecurity personnel and providing technical leadership\nDesired:\nExperience supporting PMW 160, NAVWAR, or similar Navy tactical network programs\nFamiliarity with CANES, ADNS, ISNS, SubLAN, SCI-LAN, or coalition networks\nExperience with DevSecOps, virtualization, or containerized environments\nRelevant certifications such as CISSP, CISM, CAP, Security+, or CASP+\nSecurity Clearance:\nActive Secret clearance required\nTS/SCI preferred for higher-classification environments\nEducation:\nBachelor's degree in Cybersecurity, Information Systems, Computer Science, Engineering, or a related field (or equivalent experience)\nMaster's degree preferred for senior roles\nEquivalent military cybersecurity or technical experience may be considered in lieu of degree\nWork Schedule:\nFull-time, Monday-Friday.\nPrimary place of performance is San Diego, CA\nCompensation and Benefits:\nThe projected compensation range for this position is $125,000 - 165,000. There are numerous factors that can impact a final salary/hourly rate including, but not limited to, relevant work experience, skills and competencies that align to the role, work location, education/certifications, and a contract's Labor Categories.\nCydecor offers a comprehensive compensation package including Health and Dental Insurance, Vision and Life Insurance, Short-Term & Long-Term Disability, 401(K) + company match, Paid Time Off (PTO), Paid Company Holidays, Tuition and Professional Development Assistance and more.\nWhat We Believe\nWe have an unwavering commitment to diversity with the aim that every one of our people has a full sense of belonging within our organization. As a business imperative, every person at Cydecor has the responsibility to create and sustain an inclusive environment.\nEqual Employment Opportunity Statement\nCydecor is an Equal Employment Opportunity/Affirmative Action Employer (EEO/AA). All employment and hiring decisions are based on qualifications, merit, and business needs without regard to race, religion, color, sexual orientation, nationality, gender, ethnic origin, disability, age, sex, gender identity & expression, veteran status, marital status, or any other characteristic protected by applicable law.\nIf you are a qualified individual with a disability and/or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to access job openings or apply for a job on this site because of your disability. You can request assistance by contacting HR@cydecor.com or calling 703-884-2105."
        }
    ],
    "Leidos": [
        {
            "company": "Leidos",
            "role_name": "Combat Coder - Senior Full Stack Developer",
            "score": 95.0,
            "fit_reason": "This is an excellent match: the candidate is a Lead Full Stack Developer who used Agile, reduced deployment times (differential deployment matches the spirit of optimizing in constrained environments), uses Python, and has experience with secure pipelines and system integration, directly matching the need for a developer skilled in disconnected/austere environments.",
            "missing_skills": [
                "Explicit experience with Apache NiFi",
                "TS/SCI Clearance (current role implies existing clearance, but specific level is unknown)"
            ],
            "link": "https://www.clearancejobs.com/jobs/8694883/combat-coder-senior-full-stack-developer",
            "location": "Marysville, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "R-00173025\nDescription\nLeidos, a global technology leader, is seeking a\nCombat Coder\nfor our Sentinel program, supporting the United States Air Force in geographically distributed intelligence operations.\nCombat Coders\ndirectly support mission objectives by integrating data sources and interfaces quickly while being embedded with the user base.\nAs a\nCombat Coder\nyou will engage directly with our customers to build and modify all aspects of full-stack applications. Your contributions will move directly to production systems and get immediate feedback. You will be working with a small elite team of developers that focus on getting things done to support the mission.\nJoin Leidos in our mission to enhance global security and efficiency through technology and innovation. Be part of a team that champions Integrity, Inclusion, Innovation, Agility, Collaboration, and Commitment. If you're ready to drive critical software deliveries, apply now to join Leidos as a\nCombat Coder\nfor the Sentinel program!\nAbout the Role:\nWe’re seeking a\nCombat Coder\n— a highly skilled, adaptable full stack developer who thrives in challenging, disconnected, and resource constrained environments. You’ll be building and integrating mission critical systems using Python, Apache NiFi, and other modern tools, often without the luxury of constant connectivity. This is not a “sit behind a desk and push commits” role — it’s for someone who loves solving hard problems in the field, under pressure, and with creativity.\nWhy You’ll Love This Role:\nYou’ll work on high impact projects where your code directly supports critical missions.\nYou’ll be part of a tight knit, elite engineering team that values skill, creativity, and adaptability.\nYou’ll face real technical challenges that push your abilities far beyond the ordinary\nPrimary Responsibilities:\nIntegrate systems and data flows using Python, NiFi, and other integration frameworks.\nEngineer resilient solutions that can operate in austere, bandwidth limited, or air gapped conditions.\nCollaborate with cross functional teams to rapidly prototype and deliver mission critical capabilities.\nTroubleshoot and optimize code and workflows in real time, often with incomplete information.\nDocument and harden solutions for long term maintainability in the field.\nBasic Qualifications:\nBachelors Degree with 8+ years of experience or a Masters Degree with 6+ years of experience. Additional experience maybe considered in lieu of a degree.\nUS Citizen with at least an active TS/SCI clearance and the ability to maintain your clearance during your employment with Leidos.\nProven full stack development experience.\nStrong Python skills and experience with Apache NiFi or similar dataflow/integration tools.\nComfort working in disconnected or degraded network environments — you know how to make things work without cloud dependencies.\nSolid understanding of APIs, data pipelines, and system integration patterns.\nCreative problem solver who thrives on tackling complex, ambiguous challenges.\nSelf starter who can operate independently and deliver under tight deadlines.\nStrong interpersonal and communication skills.\nUnderstanding of source control such as Gitlab and others\nPreferred Qualifications:\nExperience using JEMA and ARC GIS\nExperience with DevOps in air gapped environments.\nBackground in secure coding practices and cyber resilient architectures.\nPrior work in mission critical, defense, or field operations.\nAt Leidos, we don’t want someone who \"fits the mold\"—we want someone who melts it down and builds something better. This is a role for the restless, the over-caffeinated, the ones who ask, “what’s next?” before the dust settles on “what’s now.”\nIf you’re already scheming step 20 while everyone else is still debating step 2… good. You’ll fit right in.\nOriginal Posting:\nJanuary 6, 2026\nFor U.S. Positions: While subject to change based on business needs, Leidos reasonably anticipates that this job requisition will remain open for at least 3 days with an anticipated close date of no earlier than 3 days after the original posting date as listed above.\nPay Range:\nPay Range $107,900.00 - $195,050.00\nThe Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.\nAbout Leidos\nLeidos is an industry and technology leader serving government and commercial customers with smarter, more efficient digital and mission innovations. Headquartered in Reston, Virginia, with 47,000 global employees, Leidos reported annual revenues of approximately $16.7 billion for the fiscal year ended January 3, 2025. For more information, visit www.Leidos.com .\nPay and Benefits\nPay and benefits are fundamental to any career decision. That's why we craft compensation packages that reflect the importance of the work we do for our customers. Employment benefits include competitive compensation, Health and Wellness programs, Income Protection, Paid Leave and Retirement. More details are available at www.leidos.com/careers/pay-benefits .\nSecuring Your Data\nBeware of fake employment opportunities using Leidos’ name. Leidos will never ask you to provide payment-related information during any part of the employment application process (i.e., ask you for money), nor will Leidos ever advance money as part of the hiring process (i.e., send you a check or money order before doing any work). Further, Leidos will only communicate with you through emails that are generated by the Leidos.com automated system – never from free commercial services (e.g., Gmail, Yahoo, Hotmail) or via WhatsApp, Telegram, etc. If you received an email purporting to be from Leidos that asks for payment-related information or any other personal information (e.g., about you or your previous employer), and you are concerned about its legitimacy, please make us aware immediately by emailing us at LeidosCareersFraud@leidos.com .\nIf you believe you are the victim of a scam, contact your local law enforcement and report the incident to the U.S. Federal Trade Commission .\nCommitment to Non-Discrimination\nAll qualified applicants will receive consideration for employment without regard to sex, race, ethnicity, age, national origin, citizenship, religion, physical or mental disability, medical condition, genetic information, pregnancy, family structure, marital status, ancestry, domestic partner status, sexual orientation, gender identity or expression, veteran or military status, or any other basis prohibited by law. Leidos will also consider for employment qualified applicants with criminal histories consistent with relevant laws.\n#Featuredjob"
        }
    ],
    "SAIC": [],
    "MITRE Corporation": [],
    "Honu Services": [],
    "ASEC": [],
    "Toyon Research Corporation": [],
    "Northern Technologies Group, Inc.": [],
    "Brandes Associates Inc.": [],
    "Scientific Research Corporation": [
        {
            "company": "Scientific Research Corporation",
            "role_name": "Cyber Security Engineer III",
            "score": 80.0,
            "fit_reason": "The candidate has a strong background in cybersecurity policy (NIST/SANS alignment), secure system architecture (OTP, cross-domain transfer), and is actively involved in modernizing engineering/DevOps standards, making the transition to IA-SME roles highly feasible.",
            "missing_skills": [
                "10 years of experience in Cybersecurity/A&A",
                "Specific experience with COMSEC/CMS for ATDL systems",
                "TS/SCI clearance with CI Poly (Current clearance level not stated)"
            ],
            "link": "https://www.clearancejobs.com/jobs/8692731/cyber-security-engineer-iii",
            "location": "San Diego, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Salary Statement\nEstimated Starting Salary Range: USD $111,100.00/Yr. - USD $185,100.00/Yr. Salary to be determined by the education, experience, knowledge, skills, and abilities of the applicant, internal equity, and alignment with market data.\nDescription\nProviding IA-SME evaluations involving COMSEC and CMS for ATDL systems\nSupporting NIWC Pacific Tactical Data Link (TDL) project\nFILLING THIS POSITION IS CONTINGENT UPON AWARD\n#LI-AM1\nRequirements\nTen years of experience in Cybersecurity, Engineering, Test & Evaluation or Assessment & Authorization (A&A) in the last 15 years\nAssisting or developing system security policy and ensuring compliance of change management and configuration control processes\nPlanning and coordinating IT security programs and policies supporting the command leadership and mission goals\nExperience in all phases of Information Assurance (IA) evaluations involving Communications Security (COMSEC) and Cryptologic Material Systems (CMS) for ATDL systems and training for COMSEC ATDL military systems\nSecuring data unit design, integration, and testing\nModernizing cryptographic policy administration and implementation; Cryptographic keying materials and keys\nPerforming security verification testing and platform Cybersecurity and TEMPEST testing\nDesired Skills\nTen (10) years of experience in the management and issuance of keymat to operational, test, and allied communities; acting as the alternate ATDL Keymat Controlling Authority (CONAUTH)\nExperience in US Naval Fleet technical data calls, working groups, and action items related to the initial implementation of ATDL cryptographic components\nClearance Information\nSRC IS A CONTRACTOR FOR THE U.S. GOVERNMENT, THIS POSITION WILL REQUIRE U.S. CITIZENSHIP AS WELL AS, A U.S. GOVERNMENT SECURITY CLEARANCE AT THE TOP SECRET / SCI LEVEL\nTravel Requirements\nNo travel required\nAbout Us\nScientific Research Corporation is an advanced information technology and engineering company that provides innovative products and services to government and private industry, as well as independent institutions. At the core of our capabilities is a seasoned team of highly skilled engineers and scientists with multidisciplinary backgrounds. This team is challenged daily to provide cutting edge technology solutions to our clients.\nSRC offers a generous benefit package, including medical, dental, and vision plans, 401(k) with a company match, life insurance, vacation and sick paid time off accruals starting at 10 days of vacation and 5 days of sick leave annually, 11 paid holidays, tuition reimbursement, and a work environment that encourages excellence and more. For positions requiring a security clearance, selected applicants will be subject to a government security investigation and must meet eligibility requirements for access to classified information.\nEEO\nScientific Research Corporation is an equal opportunity employer that does not discriminate in employment.\nAll qualified applicants will receive consideration for employment without regard to their race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other protected characteristic under federal, state or local law.\nScientific Research Corporation endeavors to make www.scires.com accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact jobs@scires.com for assistance. This contact information is for accommodation requests only and cannot be used to inquire about the status of applications."
        }
    ],
    "Booz Allen Hamilton": [
        {
            "company": "Booz Allen Hamilton",
            "role_name": "Data Scientist",
            "score": 90.0,
            "fit_reason": "The candidate has direct experience engineering high-throughput data pipelines, optimizing processing time, building machine learning algorithms, and working in Agile environments, aligning perfectly with this Data Scientist role.",
            "missing_skills": [
                "Specific experience with Spark, Scala, Airflow, Databricks, or NiFi",
                "Experience with enterprise DataOps/MLOps",
                "TS/SCI Clearance requirement (only TS/SCI eligibility is mentioned in resume)"
            ],
            "link": "https://www.clearancejobs.com/jobs/8705856/data-scientist",
            "location": "Macdill Afb, FL",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Job Number: R0226861\nData Scientist\nThe Opportunity:\nAs a data scientist, you're excited at the prospect of unlocking the secrets held by a data set, and you're fascinated by the possibilities presented by IoT, machine learning, and artifi cia l intelligence. In an increasingly connected world, massive amounts of structured and unstructured data open new opportunities. As a data scientist at Booz Allen, you can help turn these complex data sets into useful information to solve global challenges. Across private and public sectors from fraud detection to cancer research, to national intelligence, we need you to help find the answers in the data.\nOn our team, you'll use your leadership skills and data science expertise to create real-world impact. You'll work closely with clients to understand their questions and needs, and then dig into their data-rich environments to find the pieces of their information puzzle. You'll guide teammates and lead the development of algorithms and systems. You'll use the right combination of tools and frameworks to turn sets of disparate data points into objective answers to advise your clients as they make informed decisions. Ultimately, you'll provide a deep understanding of the data, what it all means, and how it can be used.\nWork with us as we use data science for good.\nJoin us. The world can't wait.\nYou Have:\n5+ years of experience with programming languages, including Python, C++, Java, or R\nExperience working with structured, unstructured, or semi-structured data and c ond ucting analysis\nExperience with data wrangling techniques to cleanse data for data science applications\nExperience building statistical models and developing machine learning algorithms, including supervised, unsupervised, or reinforcement\nExperience designing and executing machine learning models and applications\nKnowledge of the sof tware development life cycle, testing, and version control\nTS / SCI clearance\nBachelor's degree\nNice If You Have:\nExperience with distributed programming languages, including Spark or Scala\nExperience with data orchestration tools, including Airflow\nExperience with data engineering and data science tools, including Databricks, ElasticSearch, Apache NiFi, or StreamSets\nExperience with business intelligence tools, including Tableau or Qlik\nExperience with data lakes, data warehouses, or data lake houses\nExperience with cloud services such as AWS, Azure, or Google Cloud\nExperience with enterprise DataOps, DevSecOps, and MLOps processes to operationalize and monitor data science models\nExperience with Agile development\nExperience with CI / CD, including Git, Jenkins, and Docker\nAbility to quickly learn new skill sets to solve challenging problems\nClearance:\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information ; TS/SCI clearance is required.\nCompensation\nAt Booz Allen, we celebrate your contributions, provide you with opportunities and choices, and support your total well-being. Our offerings include health, life, disability, financial, and retirement benefits, as well as paid leave, professional development, tuition assistance, work-life programs, and dependent care. Our recognition awards program acknowledges employees for exceptional performance and superior demonstration of our values. Full-time and part-time employees working at least 20 hours a week on a regular basis are eligible to participate in Booz Allen's benefit programs. Individuals that do not meet the threshold are only eligible for select offerings, not inclusive of health benefits. We encourage you to learn more about our total benefits by visiting the Resource page on our Careers site and reviewing Our Employee Benefits page.\nSalary at Booz Allen is determined by various factors, including but not limited to location, the individual's particular combination of education, knowledge, skills, competencies, and experience, as well as contract-specific affordability and organizational requirements. The projected compensation range for this position is $99,000.00 to $225,000.00 (annualized USD). The estimate displayed represents the typical salary range for this position and is just one component of Booz Allen's total compensation package for employees. This posting will close within 90 days from the Posting Date.\nIdentity Statement\nAs part of the application process, you are expected to be on camera during interviews and assessments. We reserve the right to take your picture to verify your identity and prevent fraud.\nWork Model\nOur people-first culture prioritizes the benefits of flexibility and collaboration, whether that happens in person or remotely.\nIf this position is listed as remote or hybrid, you'll periodically work from a Booz Allen or client site facility.\nIf this position is listed as onsite, you'll work with colleagues and clients in person, as needed for the specific role.\nCommitment to Non-Discrimination\nAll qualified applicants will receive consideration for employment without regard to disability, status as a protected veteran or any other status protected by applicable federal, state, local, or international law."
        }
    ],
    "Zachary Piper Solutions, LLC": [],
    "L3Harris Technologies": [
        {
            "company": "L3Harris Technologies",
            "role_name": "Scientist, Software Engineering",
            "score": 88.0,
            "fit_reason": "The candidate has recent experience in full-stack development, Python, security design (OTP, RBAC), Agile/DevOps, and reducing deployment times, which strongly supports the need to refactor C/C++ codebases with modern, secure practices.",
            "missing_skills": [
                "8+ years in C/C++ embedded systems development (preferred)",
                "Experience with specific DoD/NSA security standards adherence",
                "Experience with JTAG/embedded target debugging"
            ],
            "link": "https://www.clearancejobs.com/jobs/8694605/scientist-software-engineering",
            "location": "Carlsbad, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "L3Harris is dedicated to recruiting and developing high-performing talent who are passionate about what they do. Our employees are unified in a shared dedication to our customers' mission and quest for professional growth. L3Harris provides an inclusive, engaging environment designed to empower employees and promote work-life success. Fundamental to our culture is an unwavering focus on values, dedication to our communities, and commitment to excellence in everything we do.\nL3Harris Technologies is the Trusted Disruptor in the defense industry. With customers' mission-critical needs always in mind, our employees deliver end-to-end technology solutions connecting the space, air, land, sea and cyber domains in the interest of national security.\nJob Title: Scientist, Software Engineering\nJob Code: 32476\nJob Location: Carlsbad, CA\nJob Schedule: 9/80- employees work 9 out of 14 days, totaling 80 hours worked- with every other Friday off\nPosition Overview:\nWe are seeking a Software Engineer Scientist to modernize a legacy real-time embedded C/C++ codebase, incorporating memory-safe concepts and ensuring compliance with the latest NSA security requirements. This leader will be vital in shaping technical strategies, mentoring the engineering team, and ensuring the successful adoption of modern secure coding practices within a high-assurance cryptographic system.\nAlongside leading immediate modernization efforts, this role involves developing strategies and long-term technical visions to extend the design for future products and systems. The position requires onsite work in a secure facility and an active DoD Secret clearance.\nEssential Functions:\nLead the technical effort to refactor and modernize the embedded C/C++ software baseline with memory-safe principles.\nTranslate NSA security and robustness requirements into actionable engineering tasks.\nEstablish coding standards, design patterns, and automated analysis/testing pipelines that enforce memory safety.\nGuide the adoption of modern programming practices, tools, and frameworks to mitigate memory safety vulnerabilities such as buffer overflows, use-after-free, and race conditions.\nCollaborate with cross-functional teams (systems engineering, cybersecurity, testing, and integration) to ensure requirements traceability and compliance.\nProvide technical leadership and mentorship to the software engineering team, fostering a culture of secure, modern, and maintainable code.\nActively participate in technical conversations across the BCS to help develop/recommend strategies and articulate a forward-looking vision to extend the design for future information assurance products and systems.\nServe as the primary technical interface with stakeholders, government customers, and leadership on compliance progress and risk mitigation.\nSupport Cost Account Management (CAM) responsibilities, including tasks related to proposal development, resource management, and schedule planning and status updates.\nQualifications:\nBachelor's Degree (Computer Engineering, Computer Science, or related field) and a minimum of 12 years of prior relevant experience. Graduate Degree and a minimum of 10 years of prior related experience. In lieu of a degree, minimum of 16 years of prior related experience.\nActive DoD Secret clearance (minimum) and the ability to work onsite in a secure facility.\nPreferred Additional Skills:\nMinimum of 12 years of professional experience in software engineering, including at least 8 years in C/C++ embedded systems development.\nProven leadership experience managing small-to-mid-sized software teams.\nFamiliarity with DoD/National Security Agency software standards\nStrong communication skills with the ability to brief executives and government stakeholders on technical topics.\nDemonstrated expertise in identifying and mitigating memory safety vulnerabilities in legacy codebases.\nHands-on experience with modern tools for static/dynamic code analysis, fuzz testing, sanitizers, and secure coding frameworks.\nComfortable using both Linux and Windows operating systems (including command line) for daily software development tasks.\nSolid understanding of software development methodolgies (i.e. Waterfall, Agile/SCRUM, etc.)\nFamilarity with software configuration management tools (i.e. Git, Perforce, Clearcase, etc.)\nBackground in high-assurance or safety-critical systems (e.g., avionics, defense)\nProficiency with Makefiles and embedded build tools (e.g., cross-compilers, linkers, debuggers).\nExperience in integrating and debugging software on embedded targets, including the use of JTAG and hardware/software debug tools.\nExperience developing low-level device drivers and interfaces that interact with FPGAs using memory-mapped registers, interrupts, and related techniques.\nContinuous Integration & Development (CI/CD) experience.\nIn compliance with pay transparency requirements, the salary range for this role in California, Massachusetts, New Jersey, Washington, and the Greater D.C, Denver, or NYC areas is $161,500-$300,500. This is not a guarantee of compensation or salary, as final offer amount may vary based on factors including but not limited to experience and geographic location. L3Harris also offers a variety of benefits, including health and disability insurance, 401(k) match, flexible spending accounts, EAP, education assistance, parental leave, paid time off, and company-paid holidays. The specific programs and options available to an employee may vary depending on date of hire, schedule type, and the applicability of collective bargaining agreements.\n#LI-CS3\nL3Harris Technologies is proud to be an Equal Opportunity Employer. L3Harris is committed to treating all employees and applicants for employment with respect and dignity and maintaining a workplace that is free from unlawful discrimination. All applicants will be considered for employment without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender (including pregnancy, childbirth, breastfeeding or other related medical conditions), gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, characteristic or membership in any other group protected by federal, state or local laws. L3Harris maintains a drug-free workplace and performs pre-employment substance abuse testing and background checks, where permitted by law.\nPlease be aware many of our positions require the ability to obtain a security clearance. Security clearances may only be granted to U.S. citizens. In addition, applicants who accept a conditional offer of employment may be subject to government security investigation(s) and must meet eligibility requirements for access to classified information.\nBy submitting your resume for this position, you understand and agree that L3Harris Technologies may share your resume, as well as any other related personal information or documentation you provide, with its subsidiaries and affiliated companies for the purpose of considering you for other available positions.\nL3Harris Technologies is an E-Verify Employer. Please click here for the E-Verify Poster in\nEnglish\nor\nSpanish\n. For information regarding your Right To Work, please click here for\nEnglish\nor\nSpanish\n."
        }
    ],
    "G2 Ops, Inc": [],
    "MCS of Tampa, Inc": [],
    "Nooks": [],
    "ICF": [],
    "Johns Hopkins University Applied Physics Laboratory": [],
    "Halcyon Days Consulting, LLC": [],
    "Smartronix, LLC": [],
    "BTAS, Inc.": [],
    "Arete": [
        {
            "company": "Arete",
            "role_name": "Senior Software Systems Engineer",
            "score": 80.0,
            "fit_reason": "Excellent fit due to strong leadership, system integration, requirements management, and experience with software lifecycle, including DevOps practices (Git/CI/CD mentioned in the context of other roles).",
            "missing_skills": [
                "Active TS/SCI clearance (candidate status unknown)",
                "Experience in the IC environment (specific domain knowledge)",
                "MBSE tools (CAMEO)"
            ],
            "link": "https://www.clearancejobs.com/jobs/8713802/senior-software-systems-engineer",
            "location": "Northridge, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "At Areté, we are on the forefront of utilizing innovative solutions, with great minds from all backgrounds, to help solve the nation's most complex security challenges. We strive for an inclusive, collaborative team environment that approaches differences as opportunities for innovation and excellence. As an employee-owned company, we foster an atmosphere that propels diverse career opportunities and professional growth.\nDiscover your future with us.\nWe are seeking a highly skilled and innovative Senior Software Systems Engineer to join our team and lead critical aspects of system design, integration, and validation. This role requires a strong technical foundation, exceptional problem-solving skills, and the ability to manage complex requirements while interfacing with customers and stakeholders. The ideal candidate will be a proactive leader who thrives in dynamic environments and demonstrates flexibility, curiosity, and technical depth. This position can be based at our Falls Church, VA or Northridge, CA office and is a supervisory, exempt, full-time position.\nWe have an impressive range of benefits, programs, and perks that we offer:\nHealth & Wellness:\nMedical, Dental & Vision Insurance\nLife and Long-Term Disability (LTD)\nVision Reimbursement\nFitness Reimbursement\nFinancial:\nCompany-funded 5% contribution to your 401(k) retirement plan\nCompany-funded 5% contribution to your Employee Stock Ownership Plan\nContinuing Education Assistance\nWork-Life Balance:\nFlexible Scheduling\nPaid Time Off (PTO)\nPaid Parental and Bereavement Leave\nWhat We Value:\nCreativity and innovation in solving challenges\nIntegrity and responsibility in all actions\nCollaboration across teams and specialties\nResponsiveness in fast-paced environments\nPassion for national security and excellence\nExperiences and Background We Look For (Required Skills):\nHolds Top Secret clearance. SCI eligible.\nValidation & Verification Expertise: Experience in software and algorithm testing, including formal requirements validation, informal capability assessment, usability testing, algorithmic evaluation, and defect identification.\nDocumentation & Logistics: Skilled in creating and managing technical documentation such as user guides, O&M manuals, and operational procedures.\nSystems Integration & Troubleshooting: Proactive problem solver with a strong grasp of internal and external system interfaces; capable of maintaining full domain knowledge across subsystems.\nCustomer & User Engagement: Strong communication skills for interfacing with customers and end- users to gather feedback and ensure system usability.\nRequirements Management: Ability to understand formal and informal requirements, write detailed product specifications, manage the RFC process, and negotiate requirements with stakeholders.\nTechnical Leadership: Ability to act as a technical manager, guiding engineering teams and ensuring alignment with program objectives.\nInformation Management: Proficient in code and data management, including tracking metrics and maintaining configuration control.\nAdvanced Technical Aptitude: Solid foundation in software development, mathematics, and physics; demonstrates curiosity, self-motivation, and flexibility to adapt to evolving program needs.\nPreferred degree background: Systems. Computer Engineering, or related field.\n9+ yrs. experience with BS/BA\n7+ yrs. experience with MS/MA\n4+ yrs. experience with PhD\nNice to Have (Preferred Skills):\nExperience with classified systems or secure environments.\nFamiliarity with Agile development and DevSecOps practices.\nKnowledge of model-based systems engineering (MBSE) tools and methodologies.\nFamiliarity with Squish/Jenkins/GIT (or a willingness to learn)\nBasic knowledge and experience with C++/Python\nInvolvement with systems integration, test, and performance verification within the IC\nThe annual salary range for this role is $140,000 to $170,000; however, Arete considers several factors when extending an offer of employment, including but not limited to: the position and associated responsibilities, a candidate's work experience, education/training, and key skills.\nOther Considerations\nAreté is committed to the principles of equal employment opportunity and nondiscrimination, and we believe every person has the right to be treated with fairness, dignity, and equal consideration. Areté is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, marital status, national origin, age, veteran status, disability, or any other characteristic protected by applicable federal, state, or local law.\nU.S. citizenship is required to meet position eligibility.\nSuccessful passage of a criminal background screen is required to meet position eligibility.\nSelected applicants will be subject to a government security investigation and must meet eligibility requirements for access to classified information.\nAreté will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring.\nSuccessful passage of a Department of Transportation (DOT) drug test is required to meet position eligibility.\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our website because of your disability. To request an accommodation, please contact Areté Human Resources at 818-885-2200 for assistance."
        }
    ],
    "ENSCO, Inc.": [
        {
            "company": "ENSCO, Inc.",
            "role_name": "Principal Software Engineer",
            "score": 80.0,
            "fit_reason": "The candidate is a Lead Developer with strong experience in Python, Java, JavaScript frameworks, Docker, AWS, CI/CD pipeline revision, and microservices/full-stack architecture, directly matching the core technical stack and lifecycle management required.",
            "missing_skills": [
                "Go programming language",
                "MILSATCOM/SATCOM experience",
                "Kubernetes"
            ],
            "link": "https://www.clearancejobs.com/jobs/8711869/principal-software-engineer",
            "location": "El Segundo, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "For more than 50 years, ENSCO has been providing leading-edge engineering, science and advanced technology solutions to governments and private industries worldwide.\nENSCO prides itself in creating and applying advanced technologies for mission success. We provide systems engineering, integration, and advanced technology services to transform the future safety, security, and resiliency of critical missions on the ground, in the air, in space, and in the information systems that connect these domains.\nLearn more about ENSCO.\nPosition Description\nENSCO, Inc is a diverse engineering and technology company that provides engineering, science and advanced technology solutions that guarantee mission success, safety, and security to governments and private industries worldwide.\nENSCO is seeking a Principal Software Engineer to join a systems engineering team defining the next generation of space communication systems supporting US Space Force (USSF) satellite communications. You will support Systems Engineering & Integration (SE&I) activities in a multidisciplinary and collaborative environment. You will interface and collaborate with SE&I team members, contractors, government civilians and members of the USSF. You will lead and support several working groups responsible for leading technical discussion, resolve and identify risk, requirement gaps, developing briefings, writing, and tracking action items, and authoring meeting minutes.\nThe MILSATCOM Systems Engineering, Integration, and Test (MSEIT) effort provides leading edge Systems Engineering & Integration (SE&I) for the US Space Force's Space Systems Center (SSC). We support the Space Force's acquisition of state of the art satellite communications systems, providing global secure, survivable, and protected communications for our nation's warfighters. We seek technical individuals who will thrive in a highly collaborative work environment of small teams, using the most modern tools and methodologies to tackle the challenges of integrating complex space and ground communications systems. This position is on-site in El Segundo, CA. Some of the job responsibilities include but are not limited to:\nDesign, engineer, analyze, and develop software prototypes and/or applications as part of a multi-disciplinary team.\nEngage with stakeholders to better define the problem space and vision to determine capabilities and priorities.\nParticipate in the complete software development lifecycle: user story creation, design, development, automated testing, and operational support.\nCreate intuitive user interfaces that enable efficient data management and system oversight.\nDesign and develop new visualization features to meet evolving end-user requirements.\nWork with complex algorithms to deliver optimized solutions for the end user.\nDetermine software maintainability and overall adherence to user requirements on department standards.\nDrive continuous improvement through process and tooling recommendations.\nMentor team members by sharing innovative ideas and industry best practices.\nQualifications Required:\nBachelor's degree in Computer Science or Information Systems; other degrees will be considered with relevant work experience\n7 years of software development, including architecture, object-oriented design, coding, and testing\nStrong experience in one or more of the following: Python, Java, or Go\nExperience working with Javascript fameworks such as Angular or React\nHands-on experience developing web applications with microservices architecture\nHands-on experience with database technologies such as PostgreSQL, MySQL, and others\nExperience with Docker, AWS and/or Azure, and Kubernetes for containerization, cloud services, and orchestration\nProficient in using GitLab or other Tools for version control, CI/CD pipelines, and collaboration\nExcellent problem-solving skills\nStrong passion for conducting research, tackling complex problems, and continuously learning and adopting new technologies\nOrganization capability with ability to handle competing priorities\nStrong interpersonal skills, communication (oral and written), and presentation skills\nABILITY TO OBTAIN AND MAINTAIN A DOD SECRET SECURITY CLEARANCE IS REQUIRED FOR THIS POSITION FOR WHICH, YOU MUST BE A U.S. CITIZEN\nQualifications Desired:\n10+ years of software development, including architecture, object-oriented design, coding, and testing\nKnowledge and experience in Jira and Confluence\nExperience in implementing Agile Software Development methodologies for efficient and iterative project management\nExperience with MILSATCOM, such as AEHF, EPS, WGS, and Tactical SATCOM or COMSATCOM\nExperience with space and ground systems, such as satellite communication, ground terminals and DoD networks\nRequired Certifications: None\nU.S. Citizenship Required: Yes\nSecurity Clearance Required: Ability to Obtain\nEmployment Type: Regular Full-time\nBackground Check Type: 7 Year Pre-Employment\nDrug Screen Required: None\nPosition Contingent Upon Contract Award: No\nSalary Range\n$127,000 - $159,000 USD\nREAL ID Requirement\nThis position may require the ability to access to U.S. federal facilities. In accordance with the Department of Homeland Security's enforcement of the REAL ID Act, as of May 7, 2025, individuals must present a REAL ID-compliant form of identification or an acceptable alternative to gain entry. For a list of acceptable forms of identification, please click here .\nBenefits\nAt ENSCO, a positive working environment and a competitive salary are only part of the reason for choosing a career here. We offer a comprehensive benefits package that creates a stimulating and supportive environment where you can thrive - visit ensco.com/careers/benefits to learn more.\nExport Control and Licensing\nThis position may involve access to technology or technical data that is controlled under U.S. export control laws and regulations and the release of which to a non US person may require an export license from the U.S. Government.\nPrivacy\nYour data privacy is important to ENSCO. Please click here to view our privacy policy . California residents can click here to view your California privacy rights .\nEEO Statement\nENSCO, Inc. and its wholly owned U.S. subsidiaries are Equal Opportunity Employers- veterans, disability\nCreate a Job Alert\nInterested in building your career at ENSCO, Inc.? Get future opportunities sent straight to your email.\nCreate alert"
        }
    ],
    "Tactical Engineering & Analysis Inc.": [
        {
            "company": "Tactical Engineering & Analysis Inc.",
            "role_name": "DevOps Systems Engineer",
            "score": 88.0,
            "fit_reason": "The candidate's current role centers on revising DevOps standards, CI/CD, Agile methodologies, infrastructure management (AWS/Terraform/Docker), and using Python, which is a near-perfect match for the required skill set for this engineering role.",
            "missing_skills": [
                "Explicit experience with Ansible, Puppet, or specific distributed systems like Hadoop/Spark/Kafka",
                "IAT Level 1 and IT Operating System Certification (though technical knowledge is demonstrated)"
            ],
            "link": "https://www.clearancejobs.com/jobs/8694005/devops-systems-engineer",
            "location": "San Diego, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "The DevOps Systems Engineer plays a critical role in supporting Do D contracts and Joint Mission Integration and Experimentation (JMIE) initiatives by providing expert leadership in the design, development, and lifecycle management of mission critical hardware and software solutions; partnering directly with customers and stakeholders, the engineer defines requirements, creates system architectures, and produces comprehensive engineering artifacts (drawings, specifications, test plans) while implementing solutions that meet Do D security, IA, and best in class DevSecOps standards, overseeing automated testing, container orchestration, distributed databases, and infrastructure as code tools such as Ansible, Terraform, Puppet, and Python, and ensuring rigorous documentation, configuration management, and continuous monitoring to maintain robust, compliant, high performance systems that enable successful JMIE experiments and sustain long term operational effectiveness.\nCORE FUNCTIONS / JOB DUITES\nAbility to perform the following independently, under minimum supervision:\nLead the design and development of systems, create all engineering artifacts.\nImplement and promote systems engineering principles to ensure program success\nContribute technical content and tutorials to product documentation\nPrepare detailed reports and presentations on findings and share insights with stakeholders.\nProvide Software Sustainment guidance and leadership, specifically leveraging Software Configuration Management controls and processes.\nParticipate in designing and implementing scalable, reliable, and secure infrastructure on project-specific cloud platforms under senior team guidance.\nSet up and maintain software and network infrastructure environments that deploy physical and virtual machines.\nSupport evaluation and implementation of hardware and network infrastructure changes, including deployment, integration, configuration, upgrades, and patching on physical and virtual systems.\nAutomate deployment processes for specific projects using Continuous Integration/Continuous Delivery (CI/CD) tools with supervision.\nHelp automate manual processes related to the software development life cycle.\nAssist in building and maintaining software build and test pipelines to support development and distribution of software artifacts.\nParticipate in implementing cloud development environments to support software development tools and continuous integration/continuous deployment pipelines.\nManage configuration technologies for assigned projects with guidance.\nMonitor system performance and resource utilization on virtual machines and report findings.\nLearn and implement security guidelines such as Defense Information Systems Agency (DISA) Security Technical Implementation Guides (STIGs) in cloud and HWIL systems with support from senior engineers.\nResearch virtual hosting service options to support the software development program's needs.\nMaintain build and test pipelines to support software development artifact distribution.\nCollaborate with development teams to improve software delivery and deployment processes, taking direction from senior staff.\nSupport in testing, deploying, and implementation changes to existing software with stakeholders.\nAssist in defining tools needed for cloud-based data repositories and configuration management.\nStay current with industry trends, and advancements in automated testing, distributed databases, software defined networking, container orchestration, and DevSecOps.\nSKILLS & ABILITIES\nMore than three (3) years of experience and possess a deep understanding of:\nDevOps Methodologies\nAgile Software Development\nVersion Control Tools\nCI/CD Tools\nCloud Computing Concepts and Services\nInfrastructure as code\nContainer Technologies\nMonitoring and logging stacks\nDistributed systems (e.g. Hadoop, HBase/Accumulo, Spark and Kafka)\nA variety of development tools (Puppet, Ansible, Terraform, Bash, Powershell, Python, Docker, Kubernetes)\nSoftware code development to automate run-time environment tools\nMaintaining, configuring, operating and troubleshooting complex electronic computer interface systems and network equipment\nSecurity concepts, best practices and how to apply them, such as Secure Shell, public key encryption, access credentials, certificates, TLS, and data encryption to include Department of Defense and Intelligence Community security policies/processes\nLeadership Skills - Highly motivated, excellent interpersonal skills, ability to dynamically prioritize tasks, organized with attention to detail and accuracy, and ability to represent successful completion of work in Agile Management systems (e.g. Jira, Confluence, GitLab)\nOperates standard computer-based business tools (including but not limited to Microsoft Word and Excel) effectively with a high degree of competency\nGenerating engineering artifacts using Visio, CAD, or similar\nFive (5) or more years' experience with implementation and understanding of Systems Engineer principles and fielded system lifecycles, in a professional environment\nEDUCATION & CERTIFICATIONS\nBS STEM Degree Required\nIAT Level 1 Required\nIT Operating System Certification Required\nTYPICAL WORKING CONDITIONS\nGeneral office environment\nComputer/Equipment lab\n100% On-Site\nPHYSICAL REQUIREMENTS\nMay be expected to lift up to 25 lbs\nFrequent use of keyboard and typing\nFrequent sitting and standing\nWORK SCHEDULE\n9/80\nThe ability to work non-standard work hours and schedules in support of project requirements.\nPAY RANGE\n$120,000.00 to $150,000.00 annually, DOE\nU.S. Citizenship is Required\nSECURITY CLEARANCE\nCandidates must have an active TS/SCI clearance and CI Polygraph within last 5yr, or ability to pass CI polygraph within 6mo of hire. Additional eligibility requirements for access to various levels of classified information may also be required. Candidates will be subject to a US security background investigation (i.e. favorable background investigation / credit score). Additional eligibility requirements for access to various levels of classified information may also be required. An active security clearance is highly desirable.\nTactical Engineering & Analysis, Inc. is an Equal Employment Opportunity/Minority/Female/Disability/Protected Veteran Employer"
        }
    ],
    "Zscaler": [],
    "OST, Inc.": [],
    "Amentum": [],
    "Constellis": [],
    "Aurex": [],
    "Alutiiq, LLC": []
}