{
    "Anduril Industries": [],
    "Viasat, Inc.": [
        {
            "company": "Viasat, Inc.",
            "role_name": "Full-Stack Software Engineer",
            "score": 90.0,
            "fit_reason": "The candidate's Lead Full Stack Developer experience directly aligns with the required skills in full-stack architecture, Agile, CI/CD, AWS, Python, Java, and JavaScript.",
            "missing_skills": [
                "Kotlin experience",
                "Spring and/or Spring boot experience"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8715592/full-stack-software-engineer",
            "location": "Carlsbad, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "About us\nOne team. Global challenges. Infinite opportunities. At Viasat, we're on a mission to deliver connections with the capacity to change the world. For more than 35 years, Viasat has helped shape how consumers, businesses, governments and militaries around the globe communicate. We're looking for people who think big, act fearlessly, and create an inclusive environment that drives positive impact to join our team.\nWhat you'll do\nJoin Viasat Government - Secure Network Systems (SNS) as a full-stack software engineer in the developing networking and cyber security products for diverse customer based.\nYou will join a dynamic, multi-functional team that not only develop application but also designs, tests and supports their services. You will develop software to support seamless management of networking and cybersecurity products and emerging cryptographic solutions. This role will enable you to gain comprehensive experience in all aspects of the Software Development lifecycle, from initial design through to successful implementation and ongoing support. You will collaborate closely with product management, product support, and UX design teams as new capabilities are developed, ensuring flawless delivery of services that meet our high standards.\nThe day-to-day\nDevelop and maintain web applications using modern backend and frontend technologies.\nEngage with multi-functional teams in designing, building, testing and deploying new features.\nWrite secure, maintainable, and efficient code.\nEngage in team reviews and actively contribute to the team's development.\nStay up to date with the latest industry trends and technologies.\nMaintain API and front-end libraries.\nLinux OS use, for development environment\nAbility to plan, track and report on progress\nAgile Scrum and CI/CD software development\nWhat you'll need\nBachelor's degree or higher in Computer Science or similar field\nA minimum 2 years of Kotlin or Java experience writing production code for web applications\nA minimum 2 years of professional experience with Spring and/or Spring boot\nExperience with reactive programming concepts\nExperience with using database technology as PostgreSQL\nExperience with automated unit and integration testing\nExperience with performance testing\nUS citizenship and active SECRET or TOP SECRET security clearance is required.\nAbility to travel up to 10%\nWhat will help you on the job\nExperience with REST APIs, RESTConf and web services.\nContainerization with Docker or equivalent\nExperience with networking protocols (TCP/IP, HTTP)\nExperience with Python\nGood oral and written communications skills\nSalary range\n$111,500.00 - $176,500.00 / annually.For specific work locations within San Jose, the San Francisco Bay area and New York City metropolitan area, the base pay range for this role is $139,000.00- $208,000.00/ annually\nAt Viasat, we consider many factors when it comes to compensation, including the scope of the position as well as your background and experience. Base pay may vary depending on job-related knowledge, skills, and experience. Additional cash or stock incentives may be provided as part of the compensation package, in addition to a range of medical, financial, and/or other benefits, dependent on the position offered. Learn more about Viasat's comprehensive benefit offerings that are focused on your holistic health and wellness at https://careers.viasat.com/benefits.\nEEO Statement\nViasat is proud to be an equal opportunity employer, seeking to create a welcoming and diverse environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, ancestry, physical or mental disability, medical condition, marital status, genetics, age, or veteran status or any other applicable legally protected status or characteristic. If you would like to request an accommodation on the basis of disability for completing this on-line application, please click here."
        },
        {
            "company": "Viasat, Inc.",
            "role_name": "Data Engineer - Viasat Government",
            "score": 85.0,
            "fit_reason": "The candidate has strong experience engineering high-throughput data pipelines and using Python, which aligns well with the requirements for this Data Engineer role.",
            "missing_skills": [
                "DBT, Spark, and Flink experience",
                "Experience with Looker, Tableau, or Palantir",
                "Experience with GCP or Azure (AWS mentioned in resume)"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8715590/data-engineer-viasat-government",
            "location": "Carlsbad, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "About us\nOne team. Global challenges. Infinite opportunities. At Viasat, we're on a mission to deliver connections with the capacity to change the world. For more than 35 years, Viasat has helped shape how consumers, businesses, governments and militaries around the globe communicate. We're looking for people who think big, act fearlessly, and create an inclusive environment that drives positive impact to join our team.\nWhat you'll do\nIn this Data Engineering role, you will be accountable for building datasets and dashboarding capabilities based on real time streaming data and large data sets. You will be responsible for creating streaming and batch ETLs in a cloud environment. You will architect datasets that enable the use of AI and support ML initiatives. The data sets you create will provide business intelligence and informative insights to our business leaders and deliver game changing value to our customers.\nThe day-to-day\nAs a senior member of our Data Engineering team, you'll help set direction, mentor junior team members, and build datasets and visualizations that power business intelligence and empower data driven decision making.\nWe look for:\nThe ability to communicate clearly and work well with both technical and non-technical teams.\nThe ability to take on projects with vague requirements, distill them into data engineering tasks, and complete them with the help of junior engineers.\nProven ability to develop data architectures that scale well and provide meaningful insights.\nThe ability to construct well-organized schemas and data interfaces for consumption by data reporting teams, data scientists, or AI systems\nWhat you'll need\n5+ years proven data engineering experience using common data engineering languages (Java or Python) and common data engineering framework and tools like DBT, Spark, and Flink.\nFamiliarity with RDBMS technologies (PostgreSQL, MySQL, Oracle, etc.)\nExperience in Linux based systems, docker, and code versioning tooling (Git/CI/CD).\nFamiliarity with at least one cloud provider such as AWS, GCP, or Azure.\nExperience with at least one of Looker, Tableau, or Palantir\nExperience in design and implementation of robust and highly scalable Data services\nProven team player with the ability to manage multiple projects simultaneously in a fast-paced dynamic agile work environment.\nBachelor's degree in computer science, computer engineering, or electrical engineering or equivalent technical background and experience.\nAbility to travel up to 10%.\nMust be a US Citizen and eligible to obtain a US Security Clearance\nWhat will help you on the job\nUnderstanding of distributed and parallel computing architectures.\nExperience with Big Data and Streaming technologies like Kafka, Flink, Spark, DBT, Airflow, Big Query, and Trino.\nKnowledge/Understanding of Satellite systems and technologies.\nPrevious work in business or customer analytics.\nSalary range\n$135,500.00 - $214,000.00 / annually.For specific work locations within San Jose, the San Francisco Bay area and New York City metropolitan area, the base pay range for this role is $168,500.00- $252,500.00/ annually\nAt Viasat, we consider many factors when it comes to compensation, including the scope of the position as well as your background and experience. Base pay may vary depending on job-related knowledge, skills, and experience. Additional cash or stock incentives may be provided as part of the compensation package, in addition to a range of medical, financial, and/or other benefits, dependent on the position offered. Learn more about Viasat's comprehensive benefit offerings that are focused on your holistic health and wellness at https://careers.viasat.com/benefits.\nEEO Statement\nViasat is proud to be an equal opportunity employer, seeking to create a welcoming and diverse environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, ancestry, physical or mental disability, medical condition, marital status, genetics, age, or veteran status or any other applicable legally protected status or characteristic. If you would like to request an accommodation on the basis of disability for completing this on-line application, please click here."
        }
    ],
    "Delta Solutions and Strategies, LLC": [],
    "Precise Systems": [
        {
            "company": "Precise Systems",
            "role_name": "Data Engineer",
            "score": 80.0,
            "fit_reason": "The candidate's experience building high-throughput pipelines, optimizing data transfer (reducing times from hours/days to minutes), handling JSON, and working within secure government environments is highly relevant to this tactical data engineering role.",
            "missing_skills": [
                "MIL-STD-6016 (Link-16) and MIL-STD-3011 (JREAP)",
                "Cursor-on-Target (CoT) data conversion",
                "Airflow/AWS Step Functions orchestration"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8723139/data-engineer",
            "location": "San Diego, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "As a solutions-based company, Precise Systems is focused on innovation in support of the warfighters and aligning our expertise to deliver the highest quality of service. Powered by our highly skilled workforces, we provide expert consultation on network and weapons systems acquisition programs, maintenance/modernization programs, and sustainment programs with solutions in Digital Transformation, Advanced Engineering, Physical Sciences Research, Platform Lifecycle Support, and Technical Services. Since our establishment, we have demonstrated and perfected our ability to manage the customer's needs, no matter how complex - offering exceptional service and the Precise solution.\nPrecise Systems is seeking an experienced Data Engineer to support a transformational, Navy-led network-centric initiative that converges existing systems, automating the correlation of multiple ISR data streams, dramatically reducing the \"sensor-to-shooter\" timeline.\nDuties:\nBuild and optimize robust data pipelines: ingestion, transformation, storage, and governance.\nConvert between tactical data formats, e.g., XML, JSON, GEOJSON, Cursor-on-Target (CoT), JREAP-C, Link-16.\nImplement automation using CHRON/CRON jobs and data orchestration frameworks (Apache Airflow, Kafka, AWS Step Functions).\nArchitect and maintain scalable data stores (e.g., Apache Iceberg, Elasticsearch) with schema evolution and deduplication.\nEnable real-time data indexing and fast query performance.\nImplement MIL-STD-6016 (Link-16) and MIL-STD-3011 (JREAP) message handling.\nSupport integration or development of Cross-Domain Solutions (CDS) for secure, policy-based data transfers.\nPresent complex data flows and technical insights effectively to leadership and stakeholders using clear data models and visual aids.\nRequired Experience:\n5 - 10 years' experience working as a business analyst, data analyst, data scientist, data engineer, database administrator, geospatial analyst, geospatial engineer, machine learning engineer, or software engineer\nHands on Keyboard- Developer Skillsets\nFluency in Python, can code without Modern libraries.\nExperience in format conversions with some of the following: XML, JREAP-C, COT (cursor-on-target), JSON, GEO JSON, UMF/UHR, text link-16, Tapil-J, and other Tactical Data Links.\nExperience in natural language parsing (NLP) and using regular expressions, RegEx\nExperience implementing CHRON/CRON jobs\nExperience in data pipeline orchestration, ETL, orchestration tools (e.g., Kafka, Apache Airflow, AWS Step Functions)\nFocused experience implementing and monitoring data stores i.e. (Apache Iceberg, elastic search, data lake management)\nExperience with schema evolution, dataflow and governance\nExperience with real-time search and analytics engines for indexing and querying semi-structured data\nFocused experience optimizing data store queries for speed and deduplication\nDirect experience implementing MIL-STD-6016 and MIL-STD-3011\nCan translate data between source and destination schemas\nData modeling and PowerPoint presentations for leadership and stakeholder presentations\nExperience working with or developing Cross Domain Solutions (CDS) systems.\nRequired Education:\nBachelor's degree in Data Science, Computer Science, Engineering, or related STEM field.\nDesired Qualifications:\nFamiliarity with DoD data architecture principles (e.g. DoDAF, CADM).\nExperience with DataOps or similar mission-critical pipeline automation (e.g., deduplication, schema normalization).\nAny experience leveraging universal data distribution architectures within DOD operations.\nClearance Requirements:\nActive TS/SCI security clearance\nMust have current/active Top Secret security clearance. Due to the sensitivity of customer related requirements, U.S. Citizenship is required.\nPrecise Systems values employee contributions, promotes diverse opportunities for professional growth, and prioritizes overall well-being. Our comprehensive professional services benefits package includes health insurance, life and accidental death and dismemberment coverage, disability insurance, retirement plans, holiday pay, employee-managed leave, and professional growth opportunities.\nWe recognize exceptional performance and alignment with our core values through our STAR Award recognition program.\nCompensation at Precise Systems is determined by various factors, including education, experience, skills, competencies, and contract-specific requirements. The salary range for this position is $175,000.00-$225,000.00 (annualized USD). This range represents the standard pay for this role and is just one component of Precise Systems' total compensation package.\nPrecise Systems is committed to fair and equitable pay practices in alignment with applicable pay transparency laws and equal employment opportunity standards.\nPrecise Systems is dedicated to a shared vision and core values of Integrity, Respect, and Responsibility, which foster innovation and drive our continued success in the global marketplace. Precise Systems and its subsidiaries are Equal Opportunity /Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, protected veteran status, status as an individual with a disability, or any legally protected status under federal, state, or local law. Visit www.GoPrecise.com for a listing of current openings and our comprehensive, employee friendly benefits summary. Precise Systems participates in E-Verify."
        }
    ],
    "GovCIO": [],
    "MITRE Corporation": [],
    "Department of Defense": [],
    "Northrop Grumman": [],
    "Boeing": [],
    "Voyager Technologies": [],
    "Lockheed Martin": [],
    "True Anomaly. Inc.": [],
    "Toyon Research Corporation": [],
    "Northern Technologies Group, Inc.": [],
    "Brandes Associates Inc.": [],
    "Aerospace Corporation": [],
    "Leidos": [],
    "Scientific Research Corporation": [],
    "Zachary Piper Solutions, LLC": [],
    "Honu Services": [],
    "Federal Bureau of Investigation (FBI)": [
        {
            "company": "Federal Bureau of Investigation (FBI)",
            "role_name": "Special Agent: Cybersecurity/Technology Expertise",
            "score": 85.0,
            "fit_reason": "The candidate has strong technical expertise in cybersecurity, data analysis, and system architecture, combined with a desire to tackle national security challenges, making them a strong fit for this Special Agent technical track.",
            "missing_skills": [
                "Ability to meet age requirement (not reached 37th birthday on appointment)",
                "Willingness to carry a firearm/meet physical requirements",
                "Eligibility for Top-Secret SCI Clearance",
                "FBI Special Agent application requirements (e.g., passing PFT)"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8696192/special-agent-cybersecuritytechnology-expertise",
            "location": "Miami, FL",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "POSITION OVERVIEW\nThe position advertised has been exempted from the federal civilian hiring freeze.\nJob Title SPECIAL AGENT, GL-10\nFull Performance Level GS-13\nLocation U.S. Locations\nWorking Hours Minimum of 50 hours per week\nJob Type Full Time/Permanent\nWho May Apply Open to ALL U.S. Citizens\nQuestions Email\nSalary $100,456 - $129,609 per year (calculation is base + locality + availability pay)\nPlease note: Applicants must be U.S. citizens and consent to a complete background investigation, urinalysis, and polygraph. You must be suitable for federal employment as determined by a background investigation.\nSalary information: In addition to base salary, Agent Trainees receive locality pay for the Washington, D.C. area plus availability pay, which is 25% of the base and locality pay (the calculation is 25% x (base + locality). Upon graduation from training, your salary will be adjusted according to the locality of your office assignment and .\nJOB SUMMARY\nAs an FBI Special Agent, you will have the opportunity to channel your expertise to protect our nation from cyberattacks, terrorism, fraud, and evolving threats. From conducting high-stakes investigations to leveraging your in-depth knowledge to uncover crucial information, your skills are essential to investigating crimes that threaten public safety. Your transition from a specialized career to a special agent role will be transformative, utilizing your expertise to tackle national security challenges in innovative ways.\nKEY REQUIREMENTS\nYou must meet the following requirements at the time of application:\nBe a U.S. Citizen\nHave a bachelor's degree or higher from a U.S. accredited college or university.\nPossess full-time professional work experience.\nBe eligible for a Top-Secret SCI Clearance.\nBe able to legally possess / carry a firearm.\nBe at least 23 years old and not have reached your 37th birthday on appointment; exceptions may apply.\nMeet the requirements.\nMust pass the Physical Fitness Test .\nMeet the medical requirements of the position.\nPossess a valid driver's license with at least six months driving experience.\nBe available for assignment to any of the FBI's 56 Field Offices.\nTravel may be required.\nMAJOR DUTIES\nPlan and conduct investigations of potential violations of federal laws.\nExercise judgement, resourcefulness, and versatility in meeting investigative demands.\nCreate and maintain effective liaison relationships with federal, state, local, tribal, territorial and international law enforcement agencies.\nCoordinate and/or participate in searches, seizures, and arrests.\nCarry a firearm and be willing to use force, to include deadly force, if necessary.\nMaintain a level of physical fitness to ensure readiness required to perform law enforcement duties.\nAll applicants will be rated on the following Competencies:\nCollaboration\nCommunication\nFlexibility/Adaptability\nInitiative\nInterpersonal Ability\nLeadership\nOrganizing and Planning\nProblem Solving and Judgment\nQUALIFICATIONS AND EVALUATIONS\nAll applicants must have two years of full-time work experience and a bachelor's degree or one year of full-time work experience if you have an advanced degree (master's or doctorate degree)\nAll applicants should demonstrate Specialized Experience (SE).\nSE is defined as:\nGathering and analyzing information and data to make proper conclusions or decisions.\nEstablishing solutions to problems, assessing vulnerabilities, considering risks, and choosing the best outcome.\nOrganizing, planning, and prioritizing various and competing work assignments.\nConsistently navigating complex and/or evolving environments.\nCommunicating orally and in writing to prepare and present reports, briefings, and/or exchange information.\nREQUIRED DOCUMENTATION\nPlease review the list of required documents below and submit them with your application. Your resume and supporting documentation will be used to determine whether you meet the qualifications outlined in the job announcement and to validate your responses to the online assessment questionnaire. If applying online is a hardship, please email before the closing date for assistance. If you do not submit all required documents, your application will not be processed and will be discontinued.\nUtilizing the Resume Builder, outline your relevant work experience and associated start and end dates. Uploaded resumes will not be reviewed or used for qualification purposes.\nOfficial or unofficial college transcript(s) that list your degree and the date conferred from a U.S. accredited college or university.\nNotification of Personnel Action SF-50 (current or former federal employees)\nMemorandum for Record: (if applicable) Work performed outside assigned duties (that would not normally be documented on an SF-50, i.e., back-up duties), has to be documented in detail by an immediate supervisor in order to receive full credit for amount of time worked in that position. If no documentation is furnished, no credit will be given for time worked in that position. The following notations must be specified in the documentation (Memorandum for Record):\nPercent of time worked in the position (cannot conflict with main duties)\nThe month/year work began and ended\nFrequency worked (i.e., daily, monthly, etc.)\nSpecific duties performed\nAttach the Memorandum for Record to your application as type \"Other\" in the My Career Tools section on the Careers Home page.\nCurrent or Former Members of the Armed Forces\nDD-214, Member 4 copy or Service 2 copy\nStatement of Service (if not yet separated)\nVA letter dated within one year (to include Disabled Veterans)\nSF-15, Veterans' Preference form (optional)\nPlease Note:\nDO NOT attach a cover letter.\nPlease make sure that all pages are readable when scanning and uploading your documents(s).\nDO NOT upload any picture files (JPEG, TIFF, PNG, BMP).\nSPECIAL AGENT APPLICATION PROCESS\nThe application process includes the following steps, each of which must be successfully completed. Applicants who meet the initial screening criteria will receive an email invitation to take the Phase I exam.\nStep 1: Application and Screening\nStep 2: Phase I Test\nStep 3: Meet and Greet Information Session\nStep 4: Official Physical Fitness Test (PFT)\nStep 5: Phase II Test\nStep 6: Conditional Appointment Offer\nStep 7: Background Investigation\nStep 8: Fit for Duty Medical Review\nStep 9: Pre-Quantico Physical Fitness Test (PFT) (if applicable)\nStep 10: Basic Field Training Course\nFinish: Career Placement\nADDITIONAL INFORMATION\nYou are strongly encouraged to review the guide before beginning the application process. This guide provides helpful information about the application and selection for the Special Agent position.\nProbationary employees are typically precluded from being considered for all job opportunities until 12-months of their 24-month probationary period has concluded. Veterans' preference may be subject to a one-year probationary period.\nUpon successful completion of the two- year probationary period, Special Agents will transition from the GL to the General Schedule (GS) pay scale.\nAll FBI positions are in the excepted service.\nPositions with fitness-for-duty requirements or those requiring international travel may require proof of certain vaccinations.\nFailure to provide the required and relevant information as outlined in this vacancy announcement may disqualify you from consideration. Additional information will not be requested if your application is incomplete and will be evaluated solely on the information you provide.\nThe identification of promotion potential in this announcement is not a guarantee of promotion. Advancement will depend on administrative approval, operational needs, and performance of higher-level duties.\nVeterans' Preference\nIf you are entitled to veterans' preference, you should indicate the type of veterans' preference you are claiming on your resume and application. Your veterans' preference entitlement will be verified by the employing agency.\nNepotism\nNepotism is the act of favoring relatives in the hiring process and is prohibited by law. Public officials are prohibited from hiring or promoting relatives or relatives of officials in their chain of command, as well as actively or indirectly endorsing a relative's appointment or promotion. During the hiring process, all selected candidates and FBI hiring managers will be required to certify they are not related to anyone involved in the hiring process.\nReasonable Accommodation Request\nThe FBI provides reasonable accommodations to qualified applicants with disabilities. If you require a reasonable accommodation during the application and/or hiring process, please contact the Office of Equal Employment Opportunity Affairs (OEEOA) Reasonable Accommodation (RA) Program by email at , phone at 202-324-2158, or fax at 202-324-3976. This email address is for reasonable accommodation requests only. Do not send applications or unrelated inquiries to this address, as they will not be considered.\nEqual Employment Opportunity\nThe FBI is an Equal Opportunity Employer, and all qualified applicants will receive consideration for this vacancy. Unless explicitly authorized by law, selection will be made without regard to, and there will be no discrimination because of, color, race, religion, national origin, marital status, parental status, physical or mental disability, genetic information, age (40 or over), sex, pregnancy and related conditions, or on the basis of personal favoritism, or any other non-merit factors.\nBenefits\nThe Bureau matches your dedication with a commitment to professional growth, a supportive work environment, and a robust benefits package that prioritizes you. As a member of our team, you'll enjoy comprehensive health and life insurance benefits, paid vacation, sick leave, and federal holidays. For more details about benefits available to all federal employees, visit the Office of Personnel Management's ."
        }
    ],
    "Alutiiq, LLC": [],
    "ASEC": [],
    "L3Harris Technologies": [],
    "Tactical Engineering & Analysis Inc.": [],
    "Modern Technology Solutions, Inc.": [],
    "VALKYRIE ENTERPRISES, INC.": [],
    "AV, Inc.": [],
    "Epsilon Systems Solutions, Inc.": [],
    "MCS of Tampa, Inc": [],
    "Nooks": [],
    "ICF": [],
    "Johns Hopkins University Applied Physics Laboratory": [],
    "Smartronix, LLC": [],
    "BTAS, Inc.": [],
    "American Systems Corporation": [],
    "G2 Ops, Inc": [],
    "ENSCO, Inc.": [],
    "LaunchCode": [],
    "Zscaler": [],
    "OST, Inc.": [],
    "Amentum": [],
    "Aurex": [],
    "Constellis": [],
    "PeopleTec": [],
    "Deloitte": []
}