{
    "Nooks": [],
    "Johns Hopkins University Applied Physics Laboratory": [],
    "Halcyon Days Consulting, LLC": [
        {
            "company": "Halcyon Days Consulting, LLC",
            "role_name": "Cloud Platfrom Engineer",
            "score": 85.0,
            "fit_reason": "The resume shows extensive experience designing and overseeing serverless web applications using AWS Cloud, Python, and DevOps standards, directly mapping to cloud platform engineering skills.",
            "missing_skills": [
                "Specific expertise with Microsoft Cloud technologies (Azure AD Premium, Office 365)",
                "Azure Solutions Architect Expert certification"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8716703/cloud-platfrom-engineer",
            "location": "Tampa, FL",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "DESCRIPTION:\nHalcyon Days Consulting, LLC (HDC) is a veteran owned small business that specializes in the design and engineering of Tactical Mission Networks (TMN). This is a unique opportunity to join a small and high-performing team committed to delivering cloud platforms for exciting missions.\nHDC is seeking a Cloud Platform Engineer who will be responsible for designing and implementing advanced functions of Microsoft Office 365 and/or Azure AD premium, including security, governance and compliance.\nRESPONSIBILITIES & DUTIES:\nDesign and implement complex computer and information networks (LANs, WANs, intranets, extranets).\nPerform network modeling, capacity planning, and infrastructure analysis.\nDesign and implement network and computer security measures.\nResearch and recommend network and data communications hardware and software.\nPlan and lead high-impact technology projects and assignments.\nEvaluate system performance and recommend significant changes.\nAct as technical expert across multiple concurrent projects.\nMay supervise and mentor junior team members.\nREQUIREMENTS & QUALIFICATIONS:\nMinimum of 9 years of relevant experience in cloud platform engineering or related IT fields. A Master's degree may count for up to 2 years of experience, and a PhD may count for up to 4 years. Up to 1 additional year of credit may be applied for relevant technical certifications.\nStrong understanding of Microsoft Cloud technologies, including Azure AD Premium and office 365. Hands-on experience with Azure services such as Key Vault, Redic Cache, Service Bus, NSGs, Application insights, SQL DB and OMS.\nMust be capable of designing and supporting ADFS identity solutions and managing Azure cloud environments.\nExperience with hybrid cloud deployments and migrations to Azure and familiarity with CI/CD practices using tools like Jenkins, TFS, and PowerShell.\nAbility to provide second-level support for compute, network, and storage issues in Azure and AWS environments.\nPREFERRED QUALIFICATIONS:\nAzure Solutions Architect Expert certification highly desired.\nProven experience designing scalable, secure cloud architects in Microsoft Azure.\nDemonstrated ability to solve complex issues in hybrid cloud environments.\nStrong background in cloud security, and compliance planning.\nSALARY RANGE:\n$160,000 - $190,000\nThis salary range is an hourly exempt (exempt from overtime) position. Benefits are provided in addition to the salary range.\nBENEFITS:\nHDC believes GREAT teams need GREAT tools!\nHealth Care- Employer paid medical , dental, vision for the employee and their dependents\n401K- Employer contributed 3% Safe Harbor (this benefit is contributed on your behalf even if you choose not to contribute to 401k or elect any investments), also up to 5% employer match, and 100% vested on hire date.\nPTO/Holiday- 160 hours PTO/Sick leave per year, 11 paid holidays per year\nTuition Assistance- Up to $5250 per year\nHalcyon Days Consulting, LLC provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, pregnancy, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training."
        }
    ],
    "Northrop Grumman": [],
    "L3Harris Technologies": [],
    "AV, Inc.": [],
    "Viasat, Inc.": [
        {
            "company": "Viasat, Inc.",
            "role_name": "Full-Stack Software Engineer",
            "score": 95.0,
            "fit_reason": "This role perfectly matches the candidate's current Lead Full Stack Developer position, citing experience with AWS, Agile, CI/CD, Python, JSON, and modern development practices.",
            "missing_skills": [
                "Kotlin or Java experience (candidate lists Python/Java/JS)",
                "Spring/Spring Boot experience"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8715592/full-stack-software-engineer",
            "location": "Carlsbad, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "About us\nOne team. Global challenges. Infinite opportunities. At Viasat, we're on a mission to deliver connections with the capacity to change the world. For more than 35 years, Viasat has helped shape how consumers, businesses, governments and militaries around the globe communicate. We're looking for people who think big, act fearlessly, and create an inclusive environment that drives positive impact to join our team.\nWhat you'll do\nJoin Viasat Government - Secure Network Systems (SNS) as a full-stack software engineer in the developing networking and cyber security products for diverse customer based.\nYou will join a dynamic, multi-functional team that not only develop application but also designs, tests and supports their services. You will develop software to support seamless management of networking and cybersecurity products and emerging cryptographic solutions. This role will enable you to gain comprehensive experience in all aspects of the Software Development lifecycle, from initial design through to successful implementation and ongoing support. You will collaborate closely with product management, product support, and UX design teams as new capabilities are developed, ensuring flawless delivery of services that meet our high standards.\nThe day-to-day\nDevelop and maintain web applications using modern backend and frontend technologies.\nEngage with multi-functional teams in designing, building, testing and deploying new features.\nWrite secure, maintainable, and efficient code.\nEngage in team reviews and actively contribute to the team's development.\nStay up to date with the latest industry trends and technologies.\nMaintain API and front-end libraries.\nLinux OS use, for development environment\nAbility to plan, track and report on progress\nAgile Scrum and CI/CD software development\nWhat you'll need\nBachelor's degree or higher in Computer Science or similar field\nA minimum 2 years of Kotlin or Java experience writing production code for web applications\nA minimum 2 years of professional experience with Spring and/or Spring boot\nExperience with reactive programming concepts\nExperience with using database technology as PostgreSQL\nExperience with automated unit and integration testing\nExperience with performance testing\nUS citizenship and active SECRET or TOP SECRET security clearance is required.\nAbility to travel up to 10%\nWhat will help you on the job\nExperience with REST APIs, RESTConf and web services.\nContainerization with Docker or equivalent\nExperience with networking protocols (TCP/IP, HTTP)\nExperience with Python\nGood oral and written communications skills\nSalary range\n$111,500.00 - $176,500.00 / annually.For specific work locations within San Jose, the San Francisco Bay area and New York City metropolitan area, the base pay range for this role is $139,000.00- $208,000.00/ annually\nAt Viasat, we consider many factors when it comes to compensation, including the scope of the position as well as your background and experience. Base pay may vary depending on job-related knowledge, skills, and experience. Additional cash or stock incentives may be provided as part of the compensation package, in addition to a range of medical, financial, and/or other benefits, dependent on the position offered. Learn more about Viasat's comprehensive benefit offerings that are focused on your holistic health and wellness at https://careers.viasat.com/benefits.\nEEO Statement\nViasat is proud to be an equal opportunity employer, seeking to create a welcoming and diverse environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, ancestry, physical or mental disability, medical condition, marital status, genetics, age, or veteran status or any other applicable legally protected status or characteristic. If you would like to request an accommodation on the basis of disability for completing this on-line application, please click here."
        }
    ],
    "Anduril Industries": [
        {
            "company": "Anduril Industries",
            "role_name": "Senior Software Engineer, Data Science & Machine Learning",
            "score": 85.0,
            "fit_reason": "The candidate's background as a Data Science Engineer (real-time streaming, risk framework, sentiment analysis) strongly overlaps with the machine learning, complex data analysis, and Python/framework requirements of this role.",
            "missing_skills": [
                "PyTorch, TensorFlow, Scikit-Learn",
                "Tableau, Power BI",
                "24/7 on-call work with customers"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8674733/senior-software-engineer-data-science-machine-learning",
            "location": "Costa Mesa, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Anduril Industries is a defense technology company with a mission to transform U.S. and allied military capabilities with advanced technology. By bringing the expertise, technology, and business model of the 21st century's most innovative companies to the defense industry, Anduril is changing how military systems are designed, built and sold. Anduril's family of systems is powered by Lattice OS, an AI-powered operating system that turns thousands of data streams into a realtime, 3D command and control center. As the world enters an era of strategic competition, Anduril is committed to bringing cutting-edge autonomy, AI, computer vision, sensor fusion, and networking technology to the military in months, not years.\nABOUT THE TEAM\nAnduril's Tactical Recon & Strike (TRS) is a division with two missions: 1) build highly capable autonomous drones, and 2) build solid rocket motors at scale. We transform products like Ghost, Anvil, Bolt, and Altius from early concepts into fully operational capabilities by partnering closely with specialist engineering, operations, and production teams. Through our Anduril Rocket Motor Systems (RMS) team, we design and manufacture solid rocket motors using advanced materials, proprietary formulations, and high-volume production methods-delivering safe, reliable propulsion systems that support a wide range of mission requirements. TRS hires software engineers & hardware engineers, who are excited to build across a diverse and powerful portfolio-from autonomous aerial systems to high-performance solid rocket motors. Our teams contribute to highly capable autonomous robotics systems and propulsion products that operate reliably in the most demanding mission environment.\nABOUT THE JOB\nAs a Data Scientist at Anduril, you will dive into unique, complex challenges that come with the territory of high-stakes, advanced technology in the defense sector. Your expertise will drive innovation in autonomous systems, shaping the future of defense and intelligence with solutions that are deployed at unparalleled speed. If you're eager to leverage your data science skills in an environment that encourages bold ideas and offers the resources to turn them into reality, Anduril provides the perfect platform to propel your career and make a tangible difference in a world entering a new era of strategic competition. Join us and be part of the transformation that's setting new standards for military capabilities and security. This position will be located at our headquarters in Costa Mesa, CA (relocation benefits provided).\nWHAT YOU'LL DO\nConduct in-depth data analysis using Python, MATLAB, and relevant tools to address complex problems, define key performance indicators for autonomous vehicle systems, and effectively communicate analytical insights to stakeholders.\nCollaborate cross-functionally with engineering, product management, and fellow data scientists to apply advanced statistical techniques, informing strategic decisions and guiding the development of roadmaps for enhancing vehicle performance based on data-driven insights.\nDevelop, optimize, and oversee autonomous vehicle data infrastructure, including the creation and management of software tools, data catalogs, and robust data pipelines that facilitate efficient data extraction, transformation, and delivery of high-quality data products for internal use and stakeholder presentation.\nSpearhead technical investigations to diagnose operational issues and analyze performance trends, providing leadership in the interpretation of data and formulation of solutions to improve system reliability and efficiency.\nDesign and implement analytics-driven customer-facing products that showcase system performance metrics, provide trend analysis, and enhance user understanding and experience with our autonomous vehicle platforms.\nREQUIRED QUALIFICATIONS\nA background in Mathematics, Statistics, Computer Science, Data Science, or a related technical field with a strong quantitative foundation.\nDemonstrated expertise in Python with a robust portfolio of projects showcasing the development, validation, and deployment of predictive models and data products. Proficiency with machine learning frameworks such as PyTorch, TensorFlow, and Scikit-Learn is essential.\nFamiliarity with Unix/Linux environments, including proficiency with the command line interface and the ability to efficiently manage and navigate distributed computing systems.\nExceptional data visualization skills, with proficiency in using visualization tools (e.g., Plotly, Matplotlib, Seaborn) and business intelligence platforms (e.g., Tableau, Power BI) to translate complex data insights into accessible visual formats for diverse audiences.\nA proven track record of effectively working with large and complex datasets, as well as the capacity to quickly understand and work within established codebases and complex system architectures.\nA strong commitment to applying data science to solve real-world problems, with the ability to translate technical findings into actionable recommendations that have a tangible impact.\nExcellent communication and collaboration skills, with the ability to engage effectively with multidisciplinary teams, including engineers, product managers, and non-technical stakeholders.\nMust be able to obtain and maintain a DoD Security Clearance.\nMust be open to 24/7 on-call work with customers.\nMust be open to 20% travel.\nPREFERRED QUALIFICATIONS\nExperience with cloud computing platforms (e.g., AWS, GCP, Azure) and familiarity with containerization (e.g., Docker, Kubernetes) is highly beneficial.\nKnowledge of best practices in data governance, ethics, and privacy, as well as experience with data security and compliance requirements relevant to sensitive and classified information.\nLeadership experience, with the ability to mentor junior data scientists and lead project teams in the execution of complex data science initiatives.\nExperience working with terabyte-scale data, robotics data formats (e.g. MCAP, HDF5), and dataframes (e.g. Pandas, PySpark).\nUS Salary Range\n$220,000 - $292,000 USD\nThe salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including:\nHealthcare Benefits\nUS Roles:  Comprehensive medical, dental, and vision plans at little to no cost to you.\nUK & AUS Roles:  We cover full cost of medical insurance premiums for you and your dependents.\nIE Roles:  We offer an annual contribution toward your private health insurance for you and your dependents.\nAdditional Benefits\nIncome Protection  : Anduril covers life and disability insurance for all employees.\nGenerous time off  : Highly competitive PTO plans with a holiday hiatus in December. Caregiver & Wellness Leave is available to care for family members, bond with a new baby, or address your own medical needs.\nFamily Planning & Parenting Support:  Coverage for fertility treatments (e.g., IVF, preservation), adoption, and gestational carriers, along with resources to support you and your partner from planning to parenting.\nMental Health Resources:  Access free mental health resources 24/7, including therapy and life coaching. Additional work-life services, such as legal and financial support, are also available.\nProfessional Development:  Annual reimbursement for professional development\nCommuter Benefits:  Company-funded commuter benefits based on your region.\nRelocation Assistance:  Available depending on role eligibility.\nRetirement Savings Plan\nUS Roles:  Traditional 401(k), Roth, and after-tax (mega backdoor Roth) options.\nUK & IE Roles:  Pension plan with employer match.\nAUS Roles:  Superannuation plan.\nThe recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.\nTo view Anduril's candidate data privacy policy, please visit https://anduril.com/applicant-privacy-notice/ .\nCreate a Job Alert\nInterested in building your career at Anduril Industries? Get future opportunities sent straight to your email.\nCreate alert"
        },
        {
            "company": "Anduril Industries",
            "role_name": "Software Engineer, Device Infrastructure",
            "score": 80.0,
            "fit_reason": "The candidate's experience as a Lead Full Stack Developer, including DevOps, CI/CD revision, Python/Java/JS expertise, and Agile methodologies, strongly matches the requirements for building, testing, and releasing product infrastructure tools using similar technologies (Python, CI/CD, Docker).",
            "missing_skills": [
                "Rust",
                "Go",
                "NixOS",
                "Linux kernel architecture"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8679698/software-engineer-device-infrastructure",
            "location": "Costa Mesa, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Anduril Industries is a defense technology company with a mission to transform U.S. and allied military capabilities with advanced technology. By bringing the expertise, technology, and business model of the 21st century's most innovative companies to the defense industry, Anduril is changing how military systems are designed, built and sold. Anduril's family of systems is powered by Lattice OS, an AI-powered operating system that turns thousands of data streams into a realtime, 3D command and control center. As the world enters an era of strategic competition, Anduril is committed to bringing cutting-edge autonomy, AI, computer vision, sensor fusion, and networking technology to the military in months, not years.\nABOUT THE TEAM\nAnduril's Tactical Recon & Strike (TRS) is a division with two missions: 1) build highly capable autonomous drones, and 2) build solid rocket motors at scale. We transform products like Ghost, Anvil, Bolt, and Altius from early concepts into fully operational capabilities by partnering closely with specialist engineering, operations, and production teams. Through our Anduril Rocket Motor Systems (RMS) team, we design and manufacture solid rocket motors using advanced materials, proprietary formulations, and high-volume production methods-delivering safe, reliable propulsion systems that support a wide range of mission requirements. TRS hires software engineers & hardware engineers, who are excited to build across a diverse and powerful portfolio-from autonomous aerial systems to high-performance solid rocket motors. Our teams contribute to highly capable autonomous robotics systems and propulsion products that operate reliably in the most demanding mission environment.\nABOUT THE JOB\nThis position is on the TRS Core Infrastructure team and will be focused on building the infrastructure to field TRS Products such as Altius, Ghost, Bolt and Anvil. Our charter is to provide the foundation for teams across Anduril to deploy cutting edge TRS autonomy and to tie it all together into an easy-to-use product. The solutions that you will create address the current needs of our customers and will have immediate impact towards the success of our products.\nWHAT YOU'LL DO\nDesign, build, test, and release the tools used during manufacturing and deployment of Anduril Products.\nHelp define foundational software architectures, configuration processes, and user experience workflows for our products, working directly with chief engineers, program managers, flight test engineers, and end-user customers to demonstrate capability and iterate on feedback.\nCreate solutions in Python/Rust/C++/Go that integrate into software product lifecycle technologies like NixOS/CircleCI/Docker.\nInterface with engineers developing every aspect of the system from low-level Linux drivers to cutting edge autonomy and streamlined user interfaces.\nTest and evaluate your software at multiple levels of rigor using simulations, benchtop hardware, and live flight assets.\nREQUIRED QUALIFICATIONS\nAt least 3+ years working with a variety of programming languages such as Python, Rust, C++, Go, etc.\nHave experience working with customers to deliver novel software capabilities.\nWant to work on building the tools that technicians, engineers, and operators will use to prepare Altius for real-world missions.\nAre passionate about user experience and always strive to provide the most streamlined product.\nHave an intuition for finding solutions to complex problems that involve multiple first and third party technologies (related to simulation, data management, compute infrastructure, networking, and more).\nEnjoy collaborating with team members and partners in the autonomy domain, and building technologies and processes which enable users to safely and rapidly develop and deploy autonomous systems at scale.\nEligible to obtain and maintain an active U.S. Secret security clearance.\nPREFERRED QUALIFICATIONS\nYou've built or invented something: an app, a website, game, startup.\nPrevious experience working in an engineering setting: a startup (or startup-like environment), engineering school, etc.\nProfessional software development lifecycle experience using tools such as version control, CI/CD systems, etc.\nA deep, demonstrated understanding of how computers and networks work, from a single desktop to a multi-cluster cloud node (UDP, TCP, gRPC, REST, etc.).\nUnderstanding of Linux kernel architecture: Familiarity with device trees, bootloaders, and other kernel components.\nExperience creating infrastructure for robots or other complex embedded devices.\nExperience building scalable backend software systems with various data storage and processing requirements.\nExperience with industry standard cloud platforms (AWS, Azure), CI/CD tools, and software infrastructure fundamentals (networking, security, distributed systems).\nAbility to quickly understand and navigate complex systems and established code bases.\nExperience with modern build and deployment tooling (e.g. CircleCI, Docker, NixOS, Terraform).\nExperience designing complex software systems, and iterating upon designs via a technical design review process.\nFamiliarity with industry standard monitoring, logging, and data management tools and best practices.\nA bias towards rapid delivery and iteration.\nUS Salary Range\n$166,000 - $220,000 USD\nThe salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including:\nHealthcare Benefits\nUS Roles:  Comprehensive medical, dental, and vision plans at little to no cost to you.\nUK & AUS Roles:  We cover full cost of medical insurance premiums for you and your dependents.\nIE Roles:  We offer an annual contribution toward your private health insurance for you and your dependents.\nAdditional Benefits\nIncome Protection  : Anduril covers life and disability insurance for all employees.\nGenerous time off  : Highly competitive PTO plans with a holiday hiatus in December. Caregiver & Wellness Leave is available to care for family members, bond with a new baby, or address your own medical needs.\nFamily Planning & Parenting Support:  Coverage for fertility treatments (e.g., IVF, preservation), adoption, and gestational carriers, along with resources to support you and your partner from planning to parenting.\nMental Health Resources:  Access free mental health resources 24/7, including therapy and life coaching. Additional work-life services, such as legal and financial support, are also available.\nProfessional Development:  Annual reimbursement for professional development\nCommuter Benefits:  Company-funded commuter benefits based on your region.\nRelocation Assistance:  Available depending on role eligibility.\nRetirement Savings Plan\nUS Roles:  Traditional 401(k), Roth, and after-tax (mega backdoor Roth) options.\nUK & IE Roles:  Pension plan with employer match.\nAUS Roles:  Superannuation plan.\nThe recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.\nTo view Anduril's candidate data privacy policy, please visit https://anduril.com/applicant-privacy-notice/ .\nCreate a Job Alert\nInterested in building your career at Anduril Industries? Get future opportunities sent straight to your email.\nCreate alert"
        },
        {
            "company": "Anduril Industries",
            "role_name": "Senior Software Engineer, Device Infrastructure",
            "score": 80.0,
            "fit_reason": "The candidate's full-stack development, DevOps, Python expertise, and experience with Agile/CI/CD pipelines directly align with the need to build and iterate on product infrastructure solutions.",
            "missing_skills": [
                "Rust",
                "Go",
                "NixOS",
                "Linux kernel architecture"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8679692/senior-software-engineer-device-infrastructure",
            "location": "Costa Mesa, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Anduril Industries is a defense technology company with a mission to transform U.S. and allied military capabilities with advanced technology. By bringing the expertise, technology, and business model of the 21st century's most innovative companies to the defense industry, Anduril is changing how military systems are designed, built and sold. Anduril's family of systems is powered by Lattice OS, an AI-powered operating system that turns thousands of data streams into a realtime, 3D command and control center. As the world enters an era of strategic competition, Anduril is committed to bringing cutting-edge autonomy, AI, computer vision, sensor fusion, and networking technology to the military in months, not years.\nABOUT THE TEAM\nAnduril's Tactical Recon & Strike (TRS) is a division with two missions: 1) build highly capable autonomous drones, and 2) build solid rocket motors at scale. We transform products like Ghost, Anvil, Bolt, and Altius from early concepts into fully operational capabilities by partnering closely with specialist engineering, operations, and production teams. Through our Anduril Rocket Motor Systems (RMS) team, we design and manufacture solid rocket motors using advanced materials, proprietary formulations, and high-volume production methods-delivering safe, reliable propulsion systems that support a wide range of mission requirements. TRS hires software engineers & hardware engineers, who are excited to build across a diverse and powerful portfolio-from autonomous aerial systems to high-performance solid rocket motors. Our teams contribute to highly capable autonomous robotics systems and propulsion products that operate reliably in the most demanding mission environment.\nABOUT THE JOB\nThis position is on the TRS Core Infrastructure team and will be focused on building the infrastructure to field TRS Products such as Altius, Ghost, Bolt and Anvil. Our charter is to provide the foundation for teams across Anduril to deploy cutting edge TRS autonomy and to tie it all together into an easy-to-use product. The solutions that you will create address the current needs of our customers and will have immediate impact towards the success of our products.\nWHAT YOU'LL DO\nDesign, build, test, and release the tools used during manufacturing and deployment of Anduril Products.\nHelp define foundational software architectures, configuration processes, and user experience workflows for our products, working directly with chief engineers, program managers, flight test engineers, and end-user customers to demonstrate capability and iterate on feedback.\nCreate solutions in Python/Rust/C++/Go that integrate into software product lifecycle technologies like NixOS/CircleCI/Docker.\nInterface with engineers developing every aspect of the system from low-level Linux drivers to cutting edge autonomy and streamlined user interfaces.\nTest and evaluate your software at multiple levels of rigor using simulations, benchtop hardware, and live flight assets.\nREQUIRED QUALIFICATIONS\nAt least 3+ years working with a variety of programming languages such as Python, Rust, C++, Go, etc.\nHave experience working with customers to deliver novel software capabilities.\nWant to work on building the tools that technicians, engineers, and operators will use to prepare Altius for real-world missions.\nAre passionate about user experience and always strive to provide the most streamlined product.\nHave an intuition for finding solutions to complex problems that involve multiple first and third party technologies (related to simulation, data management, compute infrastructure, networking, and more).\nEnjoy collaborating with team members and partners in the autonomy domain, and building technologies and processes which enable users to safely and rapidly develop and deploy autonomous systems at scale.\nEligible to obtain and maintain an active U.S. Secret security clearance.\nPREFERRED QUALIFICATIONS\nYou've built or invented something: an app, a website, game, startup.\nPrevious experience working in an engineering setting: a startup (or startup-like environment), engineering school, etc.\nProfessional software development lifecycle experience using tools such as version control, CI/CD systems, etc.\nA deep, demonstrated understanding of how computers and networks work, from a single desktop to a multi-cluster cloud node (UDP, TCP, gRPC, REST, etc.).\nUnderstanding of Linux kernel architecture: Familiarity with device trees, bootloaders, and other kernel components.\nExperience creating infrastructure for robots or other complex embedded devices.\nExperience building scalable backend software systems with various data storage and processing requirements.\nExperience with industry standard cloud platforms (AWS, Azure), CI/CD tools, and software infrastructure fundamentals (networking, security, distributed systems).\nAbility to quickly understand and navigate complex systems and established code bases.\nExperience with modern build and deployment tooling (e.g. CircleCI, Docker, NixOS, Terraform).\nExperience designing complex software systems, and iterating upon designs via a technical design review process.\nFamiliarity with industry standard monitoring, logging, and data management tools and best practices.\nA bias towards rapid delivery and iteration.\nUS Salary Range\n$191,000 - $253,000 USD\nThe salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including:\nHealthcare Benefits\nUS Roles:  Comprehensive medical, dental, and vision plans at little to no cost to you.\nUK & AUS Roles:  We cover full cost of medical insurance premiums for you and your dependents.\nIE Roles:  We offer an annual contribution toward your private health insurance for you and your dependents.\nAdditional Benefits\nIncome Protection  : Anduril covers life and disability insurance for all employees.\nGenerous time off  : Highly competitive PTO plans with a holiday hiatus in December. Caregiver & Wellness Leave is available to care for family members, bond with a new baby, or address your own medical needs.\nFamily Planning & Parenting Support:  Coverage for fertility treatments (e.g., IVF, preservation), adoption, and gestational carriers, along with resources to support you and your partner from planning to parenting.\nMental Health Resources:  Access free mental health resources 24/7, including therapy and life coaching. Additional work-life services, such as legal and financial support, are also available.\nProfessional Development:  Annual reimbursement for professional development\nCommuter Benefits:  Company-funded commuter benefits based on your region.\nRelocation Assistance:  Available depending on role eligibility.\nRetirement Savings Plan\nUS Roles:  Traditional 401(k), Roth, and after-tax (mega backdoor Roth) options.\nUK & IE Roles:  Pension plan with employer match.\nAUS Roles:  Superannuation plan.\nThe recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.\nTo view Anduril's candidate data privacy policy, please visit https://anduril.com/applicant-privacy-notice/ .\nCreate a Job Alert\nInterested in building your career at Anduril Industries? Get future opportunities sent straight to your email.\nCreate alert"
        }
    ],
    "Boeing": [],
    "Epsilon Systems Solutions, Inc.": [],
    "Omitron Inc.": [
        {
            "company": "Omitron Inc.",
            "role_name": "Information Systems Security Officer (ISSO)",
            "score": 85.0,
            "fit_reason": "The candidate's experience analyzing vulnerabilities, defining/implementing security controls (NIST), and managing risk aligns strongly with the ISSO role, especially given the focus on classified networks and RMF.",
            "missing_skills": [
                "Active TS/SCI clearance (required)",
                "DoD IAM LVL II/IAT Level III (CISSP Preferred)",
                "eMASS experience"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8726164/information-systems-security-officer-isso",
            "location": "Vandenberg Sfb, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Job Title:\nInformation Systems Security Officer (ISSO)\nJob Description:\nOmitron is seeking a full-time Information Systems Security Officer with experience in the NIST 800-53 Risk Management Framework IT systems and networks administration for large-scale mission critical programs supporting the Space Domain Awareness/Command and Control (SDA/C2) mission.\nResponsibilities include:\nLead and work as part of an integrated team to develop and maintain RMF body of evidence documentation (e.g., System Security Plan, Security Controls Traceability Matrix, Plan of Action and Milestones, etc.) using Enterprise Mission Assurance Support Service (eMASS)\nEnsuring implementation and maintenance of the System Security Plan (SSP) and compliance with Federal Information Processing Standards (FIPS) & NIST standards (NIST 800-53, NIST 800-37, etc.)\nResolve security findings and non-compliance through developing Plan of Actions & Milestones (POA&M) and creating Risk-Based Decisions (RBD)\nConduct Risk Assessments (RA) and provide vulnerability reports against new and existing infrastructure to minimize organizational and environmental risk\nSupport preparation, planning, and coordination for periodic Cyber Readiness Assessments (CRA) to facilitate renewal of system Authorization to Operate (ATO)\nCreate and maintain security documents and provide continuous monitoring efforts to ensure policies, regulations, and operating procedures are concurrent with the latest FIPS and NIST requirements\nWork in close coordination with system administrators and other cybersecurity team members to ensure systems are operated and maintained in accordance with applicable security policies and procedures and notify the ISSM when changes occur that might impact system authorization posture\nConduct vulnerability scans and provide remediation efforts and guidance to mitigate risks\nDefine security development and test efforts necessary to implement security controls for networking devices, databases, operating systems, and hardware/software components\nPerform analysis of cybersecurity collected data and test results\nConduct cybersecurity audits to ensure appropriate implementation and compliance of the security posture\nSkill Requirements:\nProficiency with Windows and Linux operating systems\nFamiliarity with virtualization and virtual networks (VMware, Cisco, or Red Hat)\nFamiliarity with network devices, firewalls, switches, and routers\nProficiency with DISA Security Technical Implementation Guides (STIGs), to include system compliance assessment and remediation of non-compliant issues\nFamiliarity with scripting and automation (languages vary - Python, MATLAB, BASH, etc)\nProficiency with Microsoft Office Product Suites: Excel, Word, PowerPoint, Visio\nWork independently as well as in a team environment\nDetail oriented, able to obtain results, and make technical recommendations to leadership or program management\nRequired Experience:\nMinimum four years of Cybersecurity related experience with multiple Operating Systems (Linux and Windows)\nDoD IAM LVL II/IAT Level III (CISSP Preferred)\nPreferred Experience:\nPrevious experience in Systems or Network Administration\nPrevious NIPR or SIPR Administrator Experience\nKnowledge of Space Domain Awareness/Command and Control (SDA/C2) mission\nRequired Degree:\nBS degree in a relevant field is preferred (Computer Science, Cybersecurity, or Engineering). 10+ years of cybersecurity related experience may be substituted in lieu of a degree\nSecurity Clearance Requirements:\nCandidate must possess an active TS/SCI clearance\nUS citizenship required\nJob Location:\nVandenberg SFB, CA\nOccasional travel may be necessary\nCompensation and Benefits:\nThe salary range for this role is $120,000 to $170,000, depending on education level, relevant experience, and other factors.\nBenefits include:\nHealth, Dental and Vision Insurance\nHSA or FSA accounts\nCompany paid ST/LT Disability and AD&D insurance\nPaid Federal Holidays\nPaid Vacation Leave and Sick Leave\n401k with company match\nSupplemental Insurance options like AFLAC\nEducation Assistance\nVoluntary Life Insurance\nCompany Overview\nWelcome to Omitron! A quick background on us before getting into the fun stuff. Omitron is an Aerospace Engineering and Information Technology small business with locations all over the US. Our headquarters is located in Beltsville, Maryland with a regional office in Colorado Springs, Colorado, and so many other locations we don't have the space to list them all. We've been around for over 35 years, since 1984 to be exact. Omitron has provided excellence in engineering services and product development to government and industry customers for both civilian and military programs and is recognized across the industry for that excellence.\nOur motto is Ensure Mission Success. We recognize that outstanding people are the key to our success, so we take our time in selecting highly qualified and motivated individuals. We make sure to provide them with an environment necessary to stimulate and nurture continued growth.\nTo provide that environment, Omitron offers its employees competitive salaries, a full benefits package (that our employees rave about), and excellent career growth opportunities. Omitron also strives to foster a fun and welcoming work culture.\nOmitron is an equal opportunity employer committed to creating an inclusive environment for all of our employees. We strongly encourage women, persons of color, persons with disabilities, and veterans to apply.\nEEO/AA. E-Verify Participation\n."
        }
    ],
    "Leidos": [
        {
            "company": "Leidos",
            "role_name": "Combat Coder - Senior Full Stack Developer",
            "score": 90.0,
            "fit_reason": "The candidate's experience as a Lead Full Stack Developer, proficient in Python, Agile, and managing secure deployments (DevOps), is highly relevant to this mission-focused, full-stack integration role.",
            "missing_skills": [
                "Apache NiFi or similar dataflow/integration tools",
                "Working in disconnected/air gapped conditions"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8694883/combat-coder-senior-full-stack-developer",
            "location": "Marysville, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "R-00173025\nDescription\nLeidos, a global technology leader, is seeking a\nCombat Coder\nfor our Sentinel program, supporting the United States Air Force in geographically distributed intelligence operations.\nCombat Coders\ndirectly support mission objectives by integrating data sources and interfaces quickly while being embedded with the user base.\nAs a\nCombat Coder\nyou will engage directly with our customers to build and modify all aspects of full-stack applications. Your contributions will move directly to production systems and get immediate feedback. You will be working with a small elite team of developers that focus on getting things done to support the mission.\nJoin Leidos in our mission to enhance global security and efficiency through technology and innovation. Be part of a team that champions Integrity, Inclusion, Innovation, Agility, Collaboration, and Commitment. If you're ready to drive critical software deliveries, apply now to join Leidos as a\nCombat Coder\nfor the Sentinel program!\nAbout the Role:\nWe’re seeking a\nCombat Coder\n— a highly skilled, adaptable full stack developer who thrives in challenging, disconnected, and resource constrained environments. You’ll be building and integrating mission critical systems using Python, Apache NiFi, and other modern tools, often without the luxury of constant connectivity. This is not a “sit behind a desk and push commits” role — it’s for someone who loves solving hard problems in the field, under pressure, and with creativity.\nWhy You’ll Love This Role:\nYou’ll work on high impact projects where your code directly supports critical missions.\nYou’ll be part of a tight knit, elite engineering team that values skill, creativity, and adaptability.\nYou’ll face real technical challenges that push your abilities far beyond the ordinary\nPrimary Responsibilities:\nIntegrate systems and data flows using Python, NiFi, and other integration frameworks.\nEngineer resilient solutions that can operate in austere, bandwidth limited, or air gapped conditions.\nCollaborate with cross functional teams to rapidly prototype and deliver mission critical capabilities.\nTroubleshoot and optimize code and workflows in real time, often with incomplete information.\nDocument and harden solutions for long term maintainability in the field.\nBasic Qualifications:\nBachelors Degree with 8+ years of experience or a Masters Degree with 6+ years of experience. Additional experience maybe considered in lieu of a degree.\nUS Citizen with at least an active TS/SCI clearance and the ability to maintain your clearance during your employment with Leidos.\nProven full stack development experience.\nStrong Python skills and experience with Apache NiFi or similar dataflow/integration tools.\nComfort working in disconnected or degraded network environments — you know how to make things work without cloud dependencies.\nSolid understanding of APIs, data pipelines, and system integration patterns.\nCreative problem solver who thrives on tackling complex, ambiguous challenges.\nSelf starter who can operate independently and deliver under tight deadlines.\nStrong interpersonal and communication skills.\nUnderstanding of source control such as Gitlab and others\nPreferred Qualifications:\nExperience using JEMA and ARC GIS\nExperience with DevOps in air gapped environments.\nBackground in secure coding practices and cyber resilient architectures.\nPrior work in mission critical, defense, or field operations.\nAt Leidos, we don’t want someone who \"fits the mold\"—we want someone who melts it down and builds something better. This is a role for the restless, the over-caffeinated, the ones who ask, “what’s next?” before the dust settles on “what’s now.”\nIf you’re already scheming step 20 while everyone else is still debating step 2… good. You’ll fit right in.\nOriginal Posting:\nJanuary 6, 2026\nFor U.S. Positions: While subject to change based on business needs, Leidos reasonably anticipates that this job requisition will remain open for at least 3 days with an anticipated close date of no earlier than 3 days after the original posting date as listed above.\nPay Range:\nPay Range $107,900.00 - $195,050.00\nThe Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.\nAbout Leidos\nLeidos is an industry and technology leader serving government and commercial customers with smarter, more efficient digital and mission innovations. Headquartered in Reston, Virginia, with 47,000 global employees, Leidos reported annual revenues of approximately $16.7 billion for the fiscal year ended January 3, 2025. For more information, visit www.Leidos.com .\nPay and Benefits\nPay and benefits are fundamental to any career decision. That's why we craft compensation packages that reflect the importance of the work we do for our customers. Employment benefits include competitive compensation, Health and Wellness programs, Income Protection, Paid Leave and Retirement. More details are available at www.leidos.com/careers/pay-benefits .\nSecuring Your Data\nBeware of fake employment opportunities using Leidos’ name. Leidos will never ask you to provide payment-related information during any part of the employment application process (i.e., ask you for money), nor will Leidos ever advance money as part of the hiring process (i.e., send you a check or money order before doing any work). Further, Leidos will only communicate with you through emails that are generated by the Leidos.com automated system – never from free commercial services (e.g., Gmail, Yahoo, Hotmail) or via WhatsApp, Telegram, etc. If you received an email purporting to be from Leidos that asks for payment-related information or any other personal information (e.g., about you or your previous employer), and you are concerned about its legitimacy, please make us aware immediately by emailing us at LeidosCareersFraud@leidos.com .\nIf you believe you are the victim of a scam, contact your local law enforcement and report the incident to the U.S. Federal Trade Commission .\nCommitment to Non-Discrimination\nAll qualified applicants will receive consideration for employment without regard to sex, race, ethnicity, age, national origin, citizenship, religion, physical or mental disability, medical condition, genetic information, pregnancy, family structure, marital status, ancestry, domestic partner status, sexual orientation, gender identity or expression, veteran or military status, or any other basis prohibited by law. Leidos will also consider for employment qualified applicants with criminal histories consistent with relevant laws.\n#Featuredjob"
        }
    ],
    "Smartronix, LLC": [],
    "Zachary Piper Solutions, LLC": [],
    "Lockheed Martin": [],
    "Tactical Engineering & Analysis Inc.": [
        {
            "company": "Tactical Engineering & Analysis Inc.",
            "role_name": "Software Developer",
            "score": 88.0,
            "fit_reason": "The candidate's lead developer role involved Agile, CI/CD, and system integration, which strongly matches the requirements for this C++ developer role supporting C2P modernization.",
            "missing_skills": [
                "Active clearance or ability to obtain (clearance status not specified but likely holds one)",
                "Tactical Data Link (TDL) experience preferred",
                "Linux Software Development preferred"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8707191/software-developer",
            "location": "San Diego, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "The Software Developer is responsible for providing software engineering support to the Command and Control Processor (C2P) Modernization project at Naval Information Warfare Center (NIWC) Pacific. They will play a supporting role in achieving the organization's goals by developing new features using C++ in the areas of system diagnostics, Link 16 Functional Input Message/Functional Output Message (FIM/FOM) interface, User Interface and more, as well as validating and correcting software defects. This position will directly impact Naval War Fighter through enhanced tactical communications and battlefield awareness.\nCORE FUNCTIONS / JOB DUITES\nAble to perform the following with supervision:\nDesigning, coding, and testing software applications.\nCollaborate with senior developers to understand project requirements and contribute to development efforts.\nWrite clean, efficient, and well-documented code.\nParticipate in code reviews and incorporate feedback to improve code quality.\nDebug and fix minor software issues.\nLearn and adapt to new technologies and programming languages as needed.\nContribute to the maintenance and improvement of existing software systems.\nParticipate in Agile methodologies such as sprint planning, daily stand-ups, retrospectives, and backlog grooming.\nAttend and actively participate in team meetings and training sessions.\nSKILLS & ABILITIES\nBasic knowledge of the following:\nProgramming language: C++ Required\nData structures and algorithms\nVersion control systems\nDatabase technologies\nSoftware development methodologies (e.g., Agile, Scrum)\nTesting procedures and debugging techniques\nSoftware security principle\nTactical Data Link (TDL) experience preferred\nLinux Software Development preferred\nEDUCATION & CERTIFICATIONS\nBS in STEM field Required\nRelevant Software Development Certification Required, in lieu of BS STEM Degree\nTYPICAL WORKING CONDITIONS\nGeneral office environment\nComputer/Equipment lab\nPHYSICAL REQUIREMENTS\nMay be expected to lift up to 25 lbs\nFrequent use of keyboard and typing\nFrequent sitting and standing\nWORK SCHEDULE\n9/80\nThe ability to work non-standard work hours and schedules in support of project requirements.\nPAY RANGE\n$100,000.00 to $125,000.00 annually, DOE\nU.S. Citizenship is Required\nSECURITY CLEARANCE\nCandidates must have an active clearance OR the ability to obtain a US Government security clearance and will be subject to a US security background investigation (i.e. favorable background investigation / credit score). Additional eligibility requirements for access to various levels of classified information may also be required. An active security clearance is highly desirable.\nTactical Engineering & Analysis, Inc. is an Equal Employment Opportunity/Minority/Female/Disability/Protected Veteran Employer"
        }
    ],
    "Contact Government Services, LLC": [
        {
            "company": "Contact Government Services, LLC",
            "role_name": "Data Engineer",
            "score": 95.0,
            "fit_reason": "The candidate's experience as a Data Science Engineer building high-throughput data pipelines, optimizing processing time, using Python, and engaging in Agile/CI/CD practices is an excellent match.",
            "missing_skills": [
                "Tableau or PowerBI (for visualization)",
                "Shell scripts on Linux (though Python scripting exists)"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8658451/data-engineer",
            "location": "Los Angeles, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Data Engineer\nEmployment Type: Full-Time, Mid-level\nDepartment: Business Intelligence\nCGS is seeking a passionate and driven Data Engineer to support a rapidly growing Data Analytics and Business Intelligence platform focused on providing solutions that empower our federal customers with the tools and capabilities needed to turn data into actionable insights. The ideal candidate is a critical thinker and perpetual learner; excited to gain exposure and build skillsets across a range of technologies while solving some of our clients' toughest challenges.\nCGS brings motivated, highly skilled, and creative people together to solve the government's most dynamic problems with cutting-edge technology. To carry out our mission, we are seeking candidates who are excited to contribute to government innovation, appreciate collaboration, and can anticipate the needs of others. Here at CGS, we offer an environment in which our employees feel supported, and we encourage professional growth through various learning opportunities.\nSkills and attributes for success:\n-Complete development efforts across data pipeline to store, manage, store, and provision to data consumers.\n-Being an active and collaborating member of an Agile/Scrum team and following all Agile/Scrum best practices.\n-Write code to ensure the performance and reliability of data extraction and processing.\n-Support continuous process automation for data ingest.\n-Achieve technical excellence by advocating for and adhering to lean-agile engineering principles and practices such as API-first design, simple design, continuous integration, version control, and automated testing.\n-Work with program management and engineers to implement and document complex and evolving requirements.\n-Help cultivate an environment that promotes customer service excellence, innovation, collaboration, and teamwork.\n-Collaborate with others as part of a cross-functional team that includes user experience researchers and designers, product managers, engineers, and other functional specialists.\nQualifications:\n-Must be a US Citizen.\n-Must be able to obtain a Public Trust Clearance.\n-7+ years of IT experience including experience in design, management, and solutioning of large, complex data sets and models.\n-Experience with developing data pipelines from many sources from structured and unstructured data sets in a variety of formats.\n-Proficiency in developing ETL processes, and performing test and validation steps.\n-Proficiency to manipulate data (Python, R, SQL, SAS).\n-Strong knowledge of big data analysis and storage tools and technologies.\n-Strong understanding of the agile principles and ability to apply them.\n-Strong understanding of the CI/CD pipelines and ability to apply them.\n-Experience with relational database, such as, PostgreSQL.\n-Work comfortably in version control systems, such as, Git Repositories.\nIdeally, you will also have:\n-Experience creating and consuming APIs.\n-Experience with DHS and knowledge of DHS standards a plus.\n-Candidates will be given special consideration for extensive experience with Python.\n-Ability to develop visualizations utilizing Tableau or PowerBI.\n-Experience in developing Shell scripts on Linux.\n-Demonstrated experience translating business and technical requirements into comprehensive data strategies and analytic solutions.\n-Demonstrated ability to communicate across all levels of the organization and communicate technical terms to non-technical audiences.\nOur Commitment:\nContact Government Services (CGS) strives to simplify and enhance government bureaucracy through the optimization of human, technical, and financial resources. We combine cutting-edge technology with world-class personnel to deliver customized solutions that fit our client's specific needs. We are committed to solving the most challenging and dynamic problems.\nFor the past seven years, we've been growing our government-contracting portfolio, and along the way, we've created valuable partnerships by demonstrating a commitment to honesty, professionalism, and quality work.\nHere at CGS we value honesty through hard work and self-awareness, professionalism in all we do, and to deliver the best quality to our consumers mending those relations for years to come.\nWe care about our employees. Therefore, we offer a comprehensive benefits package:\n-Health, Dental, and Vision\n-Life Insurance\n-401k\n-Flexible Spending Account (Health, Dependent Care, and Commuter)\n-Paid Time Off and Observance of State/Federal Holidays\nContact Government Services, LLC is an Equal Opportunity Employer. Applicants will be considered without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\nJoin our team and become part of government innovation!\nExplore additional job opportunities with CGS on our Job Board:\nhttps://cgsfederal.com/join-our-team/\nFor more information about CGS please visit: https://www.cgsfederal.com or contact:\nEmail: [email protected]\n#CJ\n$112,597.33 - $152,810.66 a year\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us."
        },
        {
            "company": "Contact Government Services, LLC",
            "role_name": "Full Stack Developer",
            "score": 90.0,
            "fit_reason": "The candidate's current role as Lead Full Stack Developer using JavaScript/HTML/CSS and experience with Git/CI/CD aligns very strongly with this position, particularly the emphasis on web applications and APIs.",
            "missing_skills": [
                "Angular, Node.js, TypeORM",
                "DHS clearance (ideal)",
                "Elasticsearch, Neo4j, Nest.js, Kibana, Marvel, Forever, Shibboleth/SAML, Stash, Grunt, Selenium"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8658507/full-stack-developer",
            "location": "Los Angeles, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Full Stack Developer\nEmployment Type: Full Time, Mid-level\nDepartment: Information Technology\nCGS is seeking an experienced, resourceful, and inventive Full Stack Web Developer to join our team. This role will perform software application development in support of an enterprise-wide data inventory effort. This role will work across multiple teams to develop an integrated solution.\nCGS brings motivated, highly skilled, and creative people together to solve the government's most dynamic problems with cutting-edge technology. To carry out our mission, we are seeking candidates who are excited to contribute to government innovation, appreciate collaboration, and can anticipate the needs of others. Here at CGS, we offer an environment in which our employees feel supported, and we encourage professional growth through various learning opportunities.\nSkills and attributes for success:\n- Perform software application development.\n- Develop software application tests and testing strategies.\n- Script solutions to automate manual processes.\n- Follow and instruct others on version control processes.\n- Develop solutions to strengthen the security in and around applications.\n- Leverage application metrics to inform technical and business decisions.\n- Analyze industry specific requirements/technologies and provide insight.\nQualifications:\n- 11 years' relevant experience.\n- A Bachelor's degree in a related field.\n- U.S. Citizenship is a requirement.\n- A passion for Developing content rich web applications, APIs, services and scripts.\n- Experience working with Agile methodology and phase-based delivery methods.\n- Experience with JavaScript libraries such as Angular, Node.js , TypeORM\nIdeally, you will also have:\n- Active DHS clearance is a plus.\n- Hands on experience with both compiled and interpreted languages\n- Knowledge of how to deploy an application.\n- Confidence following testing, security, and configuration management best practices.\n- Experience with front and backend software development.\n- Familiarity with Unix based command line.\n- An understanding of database structure and integration.\n- Experience with Continuous Integration / Continuous Deployment strategies.\n- High degree of communication skills both oral and written.\n- Familiarity with Elasticsearch, SQL, Neo4j, Nest.js , Kibana, Matomo, Marvel, Forever, Shibboleth/SAML, Stash, Git, BitBucket, Grunt, Selenium, Linux Admin.\nOur Commitment:\nContact Government Services (CGS) strives to simplify and enhance government bureaucracy through the optimization of human, technical, and financial resources. We combine cutting-edge technology with world-class personnel to deliver customized solutions that fit our client's specific needs. We are committed to solving the most challenging and dynamic problems.\nFor the past seven years, we've been growing our government-contracting portfolio, and along the way, we've created valuable partnerships by demonstrating a commitment to honesty, professionalism, and quality work.\nHere at CGS we value honesty through hard work and self-awareness, professionalism in all we do, and to deliver the best quality to our consumers mending those relations for years to come.\nWe care about our employees. Therefore, we offer a comprehensive benefits package.\n- Health, Dental, and Vision\n- Life Insurance\n- 401k\n- Flexible Spending Account (Health, Dependent Care, and Commuter)\n- Paid Time Off and Observance of State/Federal Holidays\nContact Government Services, LLC is an Equal Opportunity Employer. Applicants will be considered without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\nJoin our team and become part of government innovation!\nExplore additional job opportunities with CGS on our Job Board:\nhttps://cgsfederal.com/join-our-team/\nFor more information about CGS please visit: https://www.cgsfederal.com or contact:\nEmail: [email protected]\n#CJ\n$134,437.33 - $182,450.66 a year\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us."
        },
        {
            "company": "Contact Government Services, LLC",
            "role_name": "Senior APEX Developer (Top Secret Clearance Required)",
            "score": 88.0,
            "fit_reason": "The candidate has strong Lead Full Stack experience utilizing JavaScript, HTML, and CSS, and the description of the LAWS application aligns with the low-attribution OSINT solution developed by the candidate.",
            "missing_skills": [
                "Oracle APEX application design/coding/maintenance",
                "Oracle Database products",
                "LAWS application O&M"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8658000/senior-apex-developer-top-secret-clearance-required",
            "location": "Los Angeles, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Senior APEX Developer\nEmployment Type: Full-Time, High-Level\nDepartment: Legal\nCGS is seeking a dedicated Senior APEX Developer to join a fast-paced and hard-working team to assist with any legal accounts. As a Senior APEX Developer, you will play a key role in supporting various aspects of the company's portfolio.\nCGS brings motivated, highly skilled, and creative people together to solve the government's most dynamic problems with cutting-edge technology. To carry out our mission, we are seeking candidates who are excited to contribute to government innovation, appreciate collaboration, and can anticipate the needs of others. Here at CGS, we offer an environment in which our employees feel supported, and we encourage professional growth through various learning opportunities.\nSkills and attributes for success:\nThe Legal Analysis Workflow System (LAWS) is an Oracle Application Express (APEX) database with features that can be used to track OGC cases and projects. LitB uses Oracle APEX, as its application development tool. Personnel assigned to this task must have the ability to adjust to changing priorities and work well under pressure.\nThe Contractor shall provide the following services to include but not limited to:\n- Contractor shall participate in teleconferences or technical meetings to review, educate, and support program objectives;\n- Contractor shall design, debug, code, and maintain Oracle APEX applications;\n- Contractor shall design, debug, code, and maintain Cascading Style Sheets (CSS), HyperText Markup Language (HTML), JavaScript, Asynchronous JavaScript and XML (AJAX) code;\n- Contractor shall develop, design, and incorporate new capabilities into the LAWS application based on OGC requirements;\n- Contractor shall liaise with other divisions for coordination and complex problem resolution;\n- Contractor shall perform Operation and Maintenance (O&M) standard operating procedures of LAWS application and other APEX applications as needed;\n- Contractor shall provide direct end-user support for LAWS;\n- Contractor shall develop supporting documentation, training materials and provide end- user training support;\n- Contractor shall assist with ensuring requirements are documented and met.\nOur Commitment:\nContact Government Services (CGS) strives to simplify and enhance government bureaucracy through the optimization of human, technical, and financial resources. We combine cutting-edge technology with world-class personnel to deliver customized solutions that fit our client's specific needs. We are committed to solving the most challenging and dynamic problems.\nFor the past seven years, we've been growing our government-contracting portfolio, and along the way, we've created valuable partnerships by demonstrating a commitment to honesty, professionalism, and quality work.\nHere at CGS we value honesty through hard work and self-awareness, professionalism in all we do, and to deliver the best quality to our consumers mending those relations for years to come.\nWe care about our employees. Therefore, we offer a comprehensive benefits package.\n- Health, Dental, and Vision\n- Life Insurance\n- 401k\n- Flexible Spending Account (Health, Dependent Care, and Commuter)\n- Paid Time Off and Observance of State/Federal Holidays\nContact Government Services, LLC is an Equal Opportunity Employer. Applicants will be considered without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\nJoin our team and become part of government innovation!\nExplore additional job opportunities with CGS on our Job Board:\nhttps://cgsfederal.com/join-our-team/\nFor more information about CGS please visit: https://www.cgsfederal.com or contact:\nPhone: +1 (888) 680-5916Email: [email protected]\n#CJ\n$180,000 - $260,000 a year\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us."
        },
        {
            "company": "Contact Government Services, LLC",
            "role_name": "APEX Developer (Top Secret Clearance Required)",
            "score": 88.0,
            "fit_reason": "The candidate has strong Lead Full Stack experience utilizing JavaScript, HTML, and CSS, and the description of the LAWS application aligns with the low-attribution OSINT solution developed by the candidate.",
            "missing_skills": [
                "Oracle APEX application design/coding/maintenance",
                "Oracle Database products",
                "LAWS application O&M"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8657830/apex-developer-top-secret-clearance-required",
            "location": "Los Angeles, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "APEX Developer\nEmployment Type: Full-Time, High-Level\nDepartment: Legal\nCGS is seeking a dedicated APEX Developer to join a fast-paced and hard-working team to assist with any legal accounts. As an APEX Developer, you will play a key role in supporting various aspects of the company's portfolio.\nCGS brings motivated, highly skilled, and creative people together to solve the government's most dynamic problems with cutting-edge technology. To carry out our mission, we are seeking candidates who are excited to contribute to government innovation, appreciate collaboration, and can anticipate the needs of others. Here at CGS, we offer an environment in which our employees feel supported, and we encourage professional growth through various learning opportunities.\nSkills and attributes for success:\nThe Legal Analysis Workflow System (LAWS) is an Oracle Application Express (APEX) database with features that can be used to track OGC cases and projects. LitB uses Oracle APEX, as its application development tool. Personnel assigned to this task must have the ability to adjust to changing priorities and work well under pressure.\nThe Contractor shall provide the following services to include but not limited to:\n- Contractor shall participate in teleconferences or technical meetings to review, educate, and support program objectives;\n- Contractor shall design, debug, code, and maintain Oracle APEX applications;\n- Contractor shall design, debug, code, and maintain Cascading Style Sheets (CSS), HyperText Markup Language (HTML), JavaScript, Asynchronous JavaScript and XML (AJAX) code;\n- Contractor shall develop, design, and incorporate new capabilities into the LAWS application based on OGC requirements;\n- Contractor shall liaise with other divisions for coordination and complex problem resolution;\n- Contractor shall perform Operation and Maintenance (O&M) standard operating procedures of LAWS application and other APEX applications as needed;\n- Contractor shall provide direct end-user support for LAWS;\n- Contractor shall develop supporting documentation, training materials and provide end- user training support;\n- Contractor shall assist with ensuring requirements are documented and met.\nOur Commitment:\nContact Government Services (CGS) strives to simplify and enhance government bureaucracy through the optimization of human, technical, and financial resources. We combine cutting-edge technology with world-class personnel to deliver customized solutions that fit our client's specific needs. We are committed to solving the most challenging and dynamic problems.\nFor the past seven years, we've been growing our government-contracting portfolio, and along the way, we've created valuable partnerships by demonstrating a commitment to honesty, professionalism, and quality work.\nHere at CGS we value honesty through hard work and self-awareness, professionalism in all we do, and to deliver the best quality to our consumers mending those relations for years to come.\nWe care about our employees. Therefore, we offer a comprehensive benefits package.\n- Health, Dental, and Vision\n- Life Insurance\n- 401k\n- Flexible Spending Account (Health, Dependent Care, and Commuter)\n- Paid Time Off and Observance of State/Federal Holidays\nContact Government Services, LLC is an Equal Opportunity Employer. Applicants will be considered without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\nJoin our team and become part of government innovation!\nExplore additional job opportunities with CGS on our Job Board:\nhttps://cgsfederal.com/join-our-team/\nFor more information about CGS please visit: https://www.cgsfederal.com or contact:\nPhone: +1 (888) 680-5916Email: [email protected]\n#CJ\n$140,000 - $190,000 a year\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us."
        },
        {
            "company": "Contact Government Services, LLC",
            "role_name": "Senior Oracle APEX Developer II",
            "score": 85.0,
            "fit_reason": "The candidate's extensive full-stack and AWS experience aligns well with the development and integration tasks, though the job focuses heavily on Oracle APEX, which is not explicitly listed as a direct skill.",
            "missing_skills": [
                "Oracle APEX 4.0 and above",
                "Quest Toad",
                "Oracle SQL Developer",
                "Oracle Database products version 11 and above",
                "BI Publisher templates"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8658677/senior-oracle-apex-developer-ii",
            "location": "Los Angeles, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Senior Oracle APEX Developer II\nEmployment Type: Full-Time, Entry-Mid Level\nDepartment: Information Technology\nCGS is hiring a Senior Oracle APEX Developer to support a range of IT services, including software application support, enterprise infrastructure support, service desk, ITSM, deskside support, workstation engineering and maintenance, telecommunications and mobility engineering services, managed print services, Active Directory services, and video conferencing. The ideal candidate will be personable and articulate and will focus on making sure that the customer's needs are met quickly and effectively. The successful candidate will be a self-starter who can work with limited supervision. Excellent communication skills are required to effectively interface with customers to understand requirements and mission needs, and then be able to translate them into actions.\nCGS brings motivated, highly skilled, and creative people together to solve the government's most dynamic problems with cutting-edge technology. To carry out our mission, we are seeking candidates who are excited to contribute to government innovation, appreciate collaboration, and can anticipate the needs of others. Here at CGS, we offer an environment in which our employees feel supported, and we encourage professional growth through various learning opportunities.\nSkills and attributes for success\n- Work at the direction of the program manager to support the full lifecycle development of custom Oracle Applications, primarily using the Oracle APEX toolset.\n- Perform advanced use of Oracle APEX 4.0 and above.\n- Perform work with Oracle Integrated Development Environments such as Quest Toad and Oracle SQL Developer.\n- Design and manipulate web content dynamically using JQuery, Ajax, JavaScript, CSS, and HTML.\n- Create dynamic reports within the Oracle APEX environment. Provide support in the advanced use of Oracle Database products version 11 and above.\n- Provide support for Oracle database objects - tables, indexes, directories, sequences, triggers, etc.\n- Provide support with PL/SQL, Java, Windows PowerShell, and Unix shell scripting with familiarity with built-in PLSQL packages and procedures.\n- Provide support with storage, efficient retrieval, and manipulation of unstructured data (BLOBs, CLOBs, JSON, XMLType) in an Oracle environment.\n- Integrate and manage BI Publisher templates and web Services.\n- Successfully deliver enterprise-level workflow-centric applications.\n- Build logical functions and algorithms to automate business processes.\nQualifications\n- Bachelor's degree with 8+ years experience. A High School diploma with additional years of experience and/or relevant certifications may be considered in lieu of a degree.\n- U.S. Citizen.\n- Ability to obtain and maintain a public trust security clearance.\n- Experience with secure network programming in an Oracle environment; use of security certificates, HTTPS callouts, etc.\n- Experience with full lifecycle development of custom Oracle Applications, including the Oracle APEX toolset.\n- Experience with the use of Oracle Integrated Development Environments such as Quest Toad and Oracle SQL Developer.\n- Experience with JQuery, Ajax, JavaScript, CSS, and HTML.\n- Experience with PL/SQL, Java, Windows PowerShell, and Unix shell scripting with familiarity with built-in PLSQL packages and procedures.\n- Experience with storage, efficient retrieval, and manipulation of unstructured data (BLOBs, CLOBs, JSON, XMLType) in an Oracle environment.\n- Experience establishing goals and meeting project plan objectives.\n- Must be able to write and maintain system documentation on work products.\n- Excellent communication and teamwork skills.\n- Agile development experience.\n- Customer interface experience.\nIdeally, you will also have:\n- Experience with Oracle Database products version 11 and above.\n- Experience with Oracle Forms and Reports version 10G or higher.\n- Experience with Oracle APEX 4.0 and above.\n- Experience troubleshooting operational issues.\n- Government contracting experience, particularly with the DOJ.\n- Current DOJ Clearance.\nOur Commitment :\nContact Government Services (CGS) strives to simplify and enhance government bureaucracy through the optimization of human, technical, and financial resources. We combine cutting-edge technology with world-class personnel to deliver customized solutions that fit our client's specific needs. We are committed to solving the most challenging and dynamic problems.\nFor the past seven years, we've been growing our government contracting portfolio, and along the way, we've created valuable partnerships by demonstrating a commitment to honesty, professionalism, and quality work.\nHere at CGS we value honesty through hard work and self-awareness, professionalism in all we do, and to deliver the best quality to our consumers mending those relations for years to come.\nWe care about our employees. Therefore, we offer a comprehensive benefits package.\n- Health, Dental, and Vision\n- Life Insurance\n- 401k\n- Flexible Spending Account (Health, Dependent Care, and Commuter)\n- Paid Time Off and Observance of State/Federal Holidays\nContact Government Services, LLC is an Equal Opportunity Employer. Applicants will be considered without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\nJoin our team and become part of government innovation!\nExplore additional job opportunities with CGS on our Job Board:\nhttps://cgsfederal.com/join-our-team/\nFor more information about CGS please visit: https://www.cgsfederal.com or contact:\nEmail: [email protected]\n#CJ\n$149,760 - $216,320 a year\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us."
        },
        {
            "company": "Contact Government Services, LLC",
            "role_name": "Senior Oracle APEX Developer",
            "score": 85.0,
            "fit_reason": "The candidate's extensive full-stack and AWS experience aligns well with the development and integration tasks, though the job focuses heavily on Oracle APEX, which is not explicitly listed as a direct skill.",
            "missing_skills": [
                "Oracle APEX 4.0 and above",
                "Quest Toad",
                "Oracle SQL Developer",
                "Oracle Database products version 11 and above",
                "BI Publisher templates"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8658667/senior-oracle-apex-developer",
            "location": "Los Angeles, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Senior Oracle APEX Developer\nEmployment Type: Full-Time, Entry-Mid Level\nDepartment: Information Technology\nCGS is hiring a Senior Oracle APEX Developer to support a range of IT services, including software application support, enterprise infrastructure support, service desk, ITSM, deskside support, workstation engineering and maintenance, telecommunications and mobility engineering services, managed print services, Active Directory services, and video conferencing. The ideal candidate will be personable and articulate and will focus on making sure that the customer's needs are met quickly and effectively. The successful candidate will be a self-starter who can work with limited supervision. Excellent communication skills are required to effectively interface with customers to understand requirements and mission needs, and then be able to translate them into actions.\nCGS brings motivated, highly skilled, and creative people together to solve the government's most dynamic problems with cutting-edge technology. To carry out our mission, we are seeking candidates who are excited to contribute to government innovation, appreciate collaboration, and can anticipate the needs of others. Here at CGS, we offer an environment in which our employees feel supported, and we encourage professional growth through various learning opportunities.\nSkills and attributes for success\n- Work at the direction of the program manager to support the full lifecycle development of custom Oracle Applications, primarily using the Oracle APEX toolset.\n- Perform advanced use of Oracle APEX 4.0 and above.\n- Perform work with Oracle Integrated Development Environments such as Quest Toad and Oracle SQL Developer.\n- Design and manipulate web content dynamically using JQuery, Ajax, JavaScript, CSS, and HTML.\n- Create dynamic reports within the Oracle APEX environment. Provide support in the advanced use of Oracle Database products version 11 and above.\n- Provide support for Oracle database objects - tables, indexes, directories, sequences, triggers, etc.\n- Provide support with PL/SQL, Java, Windows PowerShell, and Unix shell scripting with familiarity with built-in PLSQL packages and procedures.\n- Provide support with storage, efficient retrieval, and manipulation of unstructured data (BLOBs, CLOBs, JSON, XMLType) in an Oracle environment.\n- Integrate and manage BI Publisher templates and web Services.\n- Successfully deliver enterprise-level workflow-centric applications.\n- Build logical functions and algorithms to automate business processes.\nQualifications\n- Bachelor's degree with 8+ years experience. A High School diploma with additional years of experience and/or relevant certifications may be considered in lieu of a degree.\n- U.S. Citizen.\n- Ability to obtain and maintain a public trust security clearance.\n- Experience with secure network programming in an Oracle environment; use of security certificates, HTTPS callouts, etc.\n- Experience with full lifecycle development of custom Oracle Applications, including the Oracle APEX toolset.\n- Experience with the use of Oracle Integrated Development Environments such as Quest Toad and Oracle SQL Developer.\n- Experience with JQuery, Ajax, JavaScript, CSS, and HTML.\n- Experience with PL/SQL, Java, Windows PowerShell, and Unix shell scripting with familiarity with built-in PLSQL packages and procedures.\n- Experience with storage, efficient retrieval, and manipulation of unstructured data (BLOBs, CLOBs, JSON, XMLType) in an Oracle environment.\n- Experience establishing goals and meeting project plan objectives.\n- Must be able to write and maintain system documentation on work products.\n- Excellent communication and teamwork skills.\n- Agile development experience.\n- Customer interface experience.\nIdeally, you will also have:\n- Experience with Oracle Database products version 11 and above.\n- Experience with Oracle Forms and Reports version 10G or higher.\n- Experience with Oracle APEX 4.0 and above.\n- Experience troubleshooting operational issues.\n- Government contracting experience, particularly with the DOJ.\n- Current DOJ Clearance.\nOur Commitment :\nContact Government Services (CGS) strives to simplify and enhance government bureaucracy through the optimization of human, technical, and financial resources. We combine cutting-edge technology with world-class personnel to deliver customized solutions that fit our client's specific needs. We are committed to solving the most challenging and dynamic problems.\nFor the past seven years, we've been growing our government contracting portfolio, and along the way, we've created valuable partnerships by demonstrating a commitment to honesty, professionalism, and quality work.\nHere at CGS we value honesty through hard work and self-awareness, professionalism in all we do, and to deliver the best quality to our consumers mending those relations for years to come.\nWe care about our employees. Therefore, we offer a comprehensive benefits package.\n- Health, Dental, and Vision\n- Life Insurance\n- 401k\n- Flexible Spending Account (Health, Dependent Care, and Commuter)\n- Paid Time Off and Observance of State/Federal Holidays\nContact Government Services, LLC is an Equal Opportunity Employer. Applicants will be considered without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\nJoin our team and become part of government innovation!\nExplore additional job opportunities with CGS on our Job Board:\nhttps://cgsfederal.com/join-our-team/\nFor more information about CGS please visit: https://www.cgsfederal.com or contact:\nEmail: [email protected]\n#CJ\n$116,480 - $149,760 a year\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us."
        }
    ],
    "Honu Services": [],
    "MITRE Corporation": [],
    "Parsons": [],
    "STR": [
        {
            "company": "STR",
            "role_name": "Senior Software Engineer",
            "score": 85.0,
            "fit_reason": "The candidate possesses substantial experience in full-stack development, Python/C++ (implied via reverse engineering and general tech stack), networking, Agile, and security, aligning well with the requirements for this communications-focused software engineering role.",
            "missing_skills": [
                "Top Secret (TS) clearance"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8625704/senior-software-engineer",
            "location": "Melbourne, FL",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "STR is hiring experienced Senior Software Engineers to join our multidisciplinary cyber/networking team committed to developing cutting-edge technologies that have an immediate and significant impact on our national security. Our team innovates communications technology across all networking layers, from the physical to the application layer. We value diverse skills, experiences, and perspectives, which are vital to delivering innovative solutions to our customers. If you have a strong track record of delivering impactful software solutions and meet the qualifications below, we encourage you to apply!\nJob Overview:\nA successful candidate will possess several years of practical experience in software engineering, integration and testing, and networking concepts and protocols. They will demonstrate a proven ability to take ownership of technical challenges and deliver results in collaborative, fast-paced environments. The ideal candidate will bring a deep understanding of computer science concepts, sound software engineering principles, and hands-on experience working on Linux systems. Experienced engineers at STR are expected to work independently while contributing meaningfully to team efforts and mentoring less experienced team members.\nThis is an exciting opportunity to work in a high-profile, fast paced yet structured development environment alongside a diverse and talented team. In this role, you will take a leadership role in designing, implementing, and testing software that enhances advanced real-time data communications and networking solutions using open systems principles. We aim for the highest standards of quality, maintainability, and reuse in our tools and techniques. Therefore, candidates should have a demonstrated ability to produce well-designed, scalable solutions and to establish and follow reliable testing methodologies.\nWhat you will do:\nCollaborate closely with a small, dedicated research team to develop innovative solutions to complex problems\nTake ownership of significant features or components of projects and deliver them with minimal supervision\nLead technical discussions, guide architectural decisions, and mentor junior engineers\nDevelop and test novel software solutions spanning research, development, and deployed production systems\nAnalyze and improve existing designs and processes to optimize performance\nDeliver high-quality software in a rapid-paced, research-focused team environment\nDevelop operational prototypes for experimentation and performance analysis\nCreate customer-facing operational systems, ensuring they meet high reliability and usability standards\nWho you are:\nThis position requires the ability to obtain a Top Secret (TS) security clearance, for which U.S. citizenship is required by the U.S. Government\n5+ years of experience in relevant software engineering roles\nProficient in Python, C, C++, or similar interpreted or low-level programming languages\nExperienced with designing and implementing open architectures and rapid prototyping methodologies\nStrong working knowledge of software testing, evaluation best practices, and industry-standard development lifecycles\nSignificant hands-on experience developing software with GNU/Linux toolchains using open-source software\nDeep understanding of networking principles, including the 5-layer OSI networking stack\nStrong team player with excellent communication skills, both verbal and written\nBachelor's (or higher) degree in Computer Science, Electrical & Computer Engineering, Applied Mathematics, or a related field, with at least 5 years of relevant experience or equivalent expertise gained through prior roles\nNice to Have:\nActive Top Secret (TS) Security Clearance\nAdvanced experience in Python, MATLAB, and/or other high-level programming languages\nProven ability to build, deploy, and maintain production-ready software systems\nExperience writing software in a multi-party, large-scale codebase\nDemonstrated success managing technical challenges in experimental/laboratory environments, including performing quantitative analysis\nFamiliarity with multi-threaded or multi-core real-time operating concepts\nKnowledge of high-level software architecture design and scalability principles\nDemonstrated leadership abilities, including mentoring junior staff and contributing to team efficiency\nPay Information\nFull-Time Salary Range: $134,000 - $184,000\nThe salary range listed is based on external market data. Final offers are based on factors, such as but not limited to, the candidate's experience, education, training, key skills/critical skills, security clearances, and prevailing market and business conditions.\nSTR is a growing technology company with locations near Boston, MA, Arlington, VA, near Dayton, OH, Melbourne, FL, and Carlsbad, CA. We specialize in advanced research and development for defense, intelligence, and national security in: cyber; next generation sensors, radar, sonar, communications, and electronic warfare; and artificial intelligence algorithms and analytics to make sense of the complexity that is exploding around us.\nSTR is committed to creating a collaborative learning environment that supports deep technical understanding and recognizes the contributions and achievements of all team members. Our work is challenging, and we go home at night knowing that we pushed the envelope of technology and made the world safer.\nSTR is not just any company. Our people, culture, and attitude along with their unique set of skills, experiences, and perspectives put us on a trajectory to change the world. We can't do it alone, though - we need fellow trailblazers. If you are one, join our team and help to keep our society safe! Visit us at www.str.us for more info.\nSTR is an equal opportunity employer. We are fully dedicated to hiring the most qualified candidate regardless of race, color, religion, sex (including gender identity, sexual orientation and pregnancy), marital status, national origin, age, veteran status, disability, genetic information or any other characteristic protected by federal, state or local laws.\nIf you need a reasonable accommodation for any portion of the employment process, email us at appassist@str.us and provide your contact info.\nPursuant to applicable federal law and regulations, positions at STR require employees to obtain national security clearances and satisfy the requirements for compliance with export control and other applicable laws.\nCreate a Job Alert\nInterested in building your career at STR? Get future opportunities sent straight to your email.\nCreate alert"
        }
    ],
    "Intel Federal": [],
    "CGI": [],
    "Raft": [],
    "Aerospace Corporation": [],
    "Voyager Technologies": [],
    "VALKYRIE ENTERPRISES, INC.": [],
    "Delta Solutions and Strategies, LLC": [],
    "Precise Systems": [
        {
            "company": "Precise Systems",
            "role_name": "Senior Data Engineer (Op AI)",
            "score": 85.0,
            "fit_reason": "The candidate has excellent experience in high-throughput data pipelines, streaming analysis (AWS Kinesis mentioned implicitly via AWS focus), Python, distributed computing (AWS Lambda/Spark mentioned implicitly), and working within secure DoD environments (low-attribution intelligence solution).",
            "missing_skills": [
                "10 years of experience (candidate has strong leadership/senior experience but total years may be less)",
                "Specific experience with Apache Kafka, AirByte, dbt, Iceberg, Snowflake",
                "Experience with GIS data (ArcGIS, PostGIS)",
                "TS/SCI security clearance"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8723138/senior-data-engineer-op-ai",
            "location": "San Diego, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "As a solutions-based company, Precise Systems is focused on innovation in support of the warfighters and aligning our expertise to deliver the highest quality of service. Powered by our highly skilled workforces, we provide expert consultation on network and weapons systems acquisition programs, maintenance/modernization programs, and sustainment programs with solutions in Digital Transformation, Advanced Engineering, Physical Sciences Research, Platform Lifecycle Support, and Technical Services. Since our establishment, we have demonstrated and perfected our ability to manage the customer's needs, no matter how complex - offering exceptional service and the Precise solution.\nWe are seeking a Senior Data Engineer to design, build, and operationalize advanced data pipelines and analytics supporting Naval and DoD mission challenges. This role requires deep experience across data engineering, distributed systems, event streaming, cloud data frameworks, and mission-focused analytics. The Senior Data Engineer will support complex data integration efforts, collaborate with cross-functional engineering teams, and lead data architecture improvements aligned with operational Navy needs.\nDuties:\nCollaborate with cross-functional teams to understand and address Navy operational challenges using data pipelines and analytics.\nDesign, develop, and implement data pipelines and analytics for naval applications.\nPerform exploratory data analysis, algorithm development, and testing.\nNormalize and structure data to common standards for interoperability.\nWork with multiple data formats, including CSV, JSON, XML, Parquet, and ORC.\nDevelop and deploy data pipelines and analytics in real-world operational environments.\nDeploy, monitor, and optimize data pipelines to ensure high performance and reliability.\nImplement event streaming pipelines using Apache Kafka, AWS Kinesis, RabbitMQ, or ZeroMQ.\nUtilize distributed computing platforms such as AWS Lambda, Dask, or Spark.\nLeverage cloud-native tools including AWS S3, RDS, EFS, SNS, and SQS.\nUtilize data pipeline frameworks such as AirByte, Apache Airflow, dbt, Apache Iceberg, and Snowflake.\nWork with GIS data using ArcGIS, PostGIS, and related tooling.\nImplement containerized environments using Docker or Kubernetes.\nApply cybersecurity principles in the context of secure DoD data applications.\nCommunicate findings and engineering solutions effectively with technical and mission stakeholders.\nRequired Experience:\nAt least 10 years of experience as a business analyst, data analyst, data scientist, data engineer, database administrator, geospatial analyst/engineer, machine learning engineer, or software engineer.\nStrong programming skills in Python.\nProgramming experience in Go or Rust.\nProven experience designing, developing, and deploying complex data pipelines.\nFamiliarity with data formats including CSV, JSON, XML, Parquet, ORC.\nFamiliarity with event streaming technologies: Kafka, AWS Kinesis, RabbitMQ, ZeroMQ.\nExperience deploying, monitoring, and optimizing operational data pipelines.\nExpertise in Elasticsearch, Redis, S3, PostgreSQL, or related datastores.\nExperience with AWS data services (EFS, RDS, S3, SNS, SQS).\nExperience with distributed computing: AWS Lambda, DASK, Spark.\nFamiliarity with AirByte, Airflow, dbt, Iceberg, Snowflake.\nExperience integrating and retrieving GIS data (ArcGIS, PostGIS).\nStrong analytical and problem-solving skills.\nExcellent communication skills in a collaborative team environment.\nPrevious experience supporting government agencies or military organizations.\nAbility to safely carry tools, equipment, and materials aboard ship, including ascending and descending shipboard ladders(stairwells) and navigating confined spaces while maintaining required points of contact. Tools and equipment will weigh no more than 50 lbs.\nAbility to perform required work aboard Navy vessels and in shipboard environments, including navigating narrow passageways, ascending, and descending ladders (stairwells), working on elevated platforms, and operating in variable sea conditions.\nAbility to perform activities on a reoccurring basis during shipboard operations or testing evolutions.\nAbility to comply with Navy safety requirements and wear required personal protective equipment (PPE).\nAbility to operate in a DDIL office environment\nRequired Education:\nMaster of Science in Computer Science, Data Science, Geography, Math, Machine Learning, or Statistics.\nDesired Qualifications:\nAdditional certifications in data engineering, cloud, geospatial, or cybersecurity are a plus if required by contract.\nExperience leading data engineering efforts in secure DoD environments.\nExperience working with NAVWAR, NIWC Pacific, or naval C2/ISR programs.\nExperience architecting data solutions across multi-domain or cross-domain systems.\nFamiliarity with MLOps pipelines or AI-enabled analytics workflows.\nExperience with cloud-native data architecture and API design.\nClearance Requirements:\nActive TS/SCI security clearance\nMust have current/active Top Secret security clearance. Due to the sensitivity of customer related requirements, U.S. Citizenship is required.\nPrecise Systems values employee contributions, promotes diverse opportunities for professional growth, and prioritizes overall well-being. Our comprehensive professional services benefits package includes health insurance, life and accidental death and dismemberment coverage, disability insurance, retirement plans, holiday pay, employee-managed leave, and professional growth opportunities.\nWe recognize exceptional performance and alignment with our core values through our STAR Award recognition program.\nCompensation at Precise Systems is determined by various factors, including education, experience, skills, competencies, and contract-specific requirements. The salary range for this position is $185,000.00-$195,000.00 (annualized USD). This range represents the standard pay for this role and is just one component of Precise Systems' total compensation package.\nPrecise Systems is committed to fair and equitable pay practices in alignment with applicable pay transparency laws and equal employment opportunity standards.\nPrecise Systems is dedicated to a shared vision and core values of Integrity, Respect, and Responsibility, which foster innovation and drive our continued success in the global marketplace. Precise Systems and its subsidiaries are Equal Opportunity /Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, protected veteran status, status as an individual with a disability, or any legally protected status under federal, state, or local law. Visit www.GoPrecise.com for a listing of current openings and our comprehensive, employee friendly benefits summary. Precise Systems participates in E-Verify."
        },
        {
            "company": "Precise Systems",
            "role_name": "Data Engineer",
            "score": 80.0,
            "fit_reason": "Strong alignment with building and optimizing data pipelines, expertise in Python, handling various data formats (JSON mentioned), using orchestration tools (implied by DevOps/CI/CD maturity), and experience with secure data transfer/cross-domain concepts.",
            "missing_skills": [
                "Specific tactical data format experience (CoT, JREAP-C, Link-16)",
                "Specific experience with Airflow, Iceberg, Elasticsearch, Snowflake",
                "TS/SCI security clearance"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8723139/data-engineer",
            "location": "San Diego, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "As a solutions-based company, Precise Systems is focused on innovation in support of the warfighters and aligning our expertise to deliver the highest quality of service. Powered by our highly skilled workforces, we provide expert consultation on network and weapons systems acquisition programs, maintenance/modernization programs, and sustainment programs with solutions in Digital Transformation, Advanced Engineering, Physical Sciences Research, Platform Lifecycle Support, and Technical Services. Since our establishment, we have demonstrated and perfected our ability to manage the customer's needs, no matter how complex - offering exceptional service and the Precise solution.\nPrecise Systems is seeking an experienced Data Engineer to support a transformational, Navy-led network-centric initiative that converges existing systems, automating the correlation of multiple ISR data streams, dramatically reducing the \"sensor-to-shooter\" timeline.\nDuties:\nBuild and optimize robust data pipelines: ingestion, transformation, storage, and governance.\nConvert between tactical data formats, e.g., XML, JSON, GEOJSON, Cursor-on-Target (CoT), JREAP-C, Link-16.\nImplement automation using CHRON/CRON jobs and data orchestration frameworks (Apache Airflow, Kafka, AWS Step Functions).\nArchitect and maintain scalable data stores (e.g., Apache Iceberg, Elasticsearch) with schema evolution and deduplication.\nEnable real-time data indexing and fast query performance.\nImplement MIL-STD-6016 (Link-16) and MIL-STD-3011 (JREAP) message handling.\nSupport integration or development of Cross-Domain Solutions (CDS) for secure, policy-based data transfers.\nPresent complex data flows and technical insights effectively to leadership and stakeholders using clear data models and visual aids.\nRequired Experience:\n5 - 10 years' experience working as a business analyst, data analyst, data scientist, data engineer, database administrator, geospatial analyst, geospatial engineer, machine learning engineer, or software engineer\nHands on Keyboard- Developer Skillsets\nFluency in Python, can code without Modern libraries.\nExperience in format conversions with some of the following: XML, JREAP-C, COT (cursor-on-target), JSON, GEO JSON, UMF/UHR, text link-16, Tapil-J, and other Tactical Data Links.\nExperience in natural language parsing (NLP) and using regular expressions, RegEx\nExperience implementing CHRON/CRON jobs\nExperience in data pipeline orchestration, ETL, orchestration tools (e.g., Kafka, Apache Airflow, AWS Step Functions)\nFocused experience implementing and monitoring data stores i.e. (Apache Iceberg, elastic search, data lake management)\nExperience with schema evolution, dataflow and governance\nExperience with real-time search and analytics engines for indexing and querying semi-structured data\nFocused experience optimizing data store queries for speed and deduplication\nDirect experience implementing MIL-STD-6016 and MIL-STD-3011\nCan translate data between source and destination schemas\nData modeling and PowerPoint presentations for leadership and stakeholder presentations\nExperience working with or developing Cross Domain Solutions (CDS) systems.\nRequired Education:\nBachelor's degree in Data Science, Computer Science, Engineering, or related STEM field.\nDesired Qualifications:\nFamiliarity with DoD data architecture principles (e.g. DoDAF, CADM).\nExperience with DataOps or similar mission-critical pipeline automation (e.g., deduplication, schema normalization).\nAny experience leveraging universal data distribution architectures within DOD operations.\nClearance Requirements:\nActive TS/SCI security clearance\nMust have current/active Top Secret security clearance. Due to the sensitivity of customer related requirements, U.S. Citizenship is required.\nPrecise Systems values employee contributions, promotes diverse opportunities for professional growth, and prioritizes overall well-being. Our comprehensive professional services benefits package includes health insurance, life and accidental death and dismemberment coverage, disability insurance, retirement plans, holiday pay, employee-managed leave, and professional growth opportunities.\nWe recognize exceptional performance and alignment with our core values through our STAR Award recognition program.\nCompensation at Precise Systems is determined by various factors, including education, experience, skills, competencies, and contract-specific requirements. The salary range for this position is $175,000.00-$225,000.00 (annualized USD). This range represents the standard pay for this role and is just one component of Precise Systems' total compensation package.\nPrecise Systems is committed to fair and equitable pay practices in alignment with applicable pay transparency laws and equal employment opportunity standards.\nPrecise Systems is dedicated to a shared vision and core values of Integrity, Respect, and Responsibility, which foster innovation and drive our continued success in the global marketplace. Precise Systems and its subsidiaries are Equal Opportunity /Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, protected veteran status, status as an individual with a disability, or any legally protected status under federal, state, or local law. Visit www.GoPrecise.com for a listing of current openings and our comprehensive, employee friendly benefits summary. Precise Systems participates in E-Verify."
        }
    ],
    "GovCIO": [],
    "G2 Ops, Inc": [],
    "BTAS, Inc.": [],
    "Arete": [
        {
            "company": "Arete",
            "role_name": "Front-End UI/UX Software Engineer",
            "score": 88.0,
            "fit_reason": "The candidate has demonstrated full-stack experience, including front-end skills (HTML, CSS, JavaScript/JSON) and Python, which closely matches the required technologies for this UI/UX role.",
            "missing_skills": [
                "React proficiency",
                "Qt and/or PyQt experience",
                "Creating wireframes and interactive prototypes"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8713797/front-end-uiux-software-engineer",
            "location": "Northridge, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "At Areté, we are on the forefront of developing innovative solutions, with great minds from all backgrounds, to help solve the nation's most complex security challenges. We strive for an inclusive, collaborative team environment that approaches differences as opportunities for innovation and excellence. As an employee-owned company, we foster an atmosphere that propels diverse career opportunities and professional growth.\nDiscover your future with us\nWe are seeking a User Interface and User Experience (UI/UX) Software Engineer to help develop and maintain intuitive and interactive GUI applications with a focus on mission management, data analysis, and data visualization. The ideal candidate will combine strong UI/UX design skills with technical front-end development capabilities to create responsive and accessible applications. This position offers an exciting opportunity to shape user experiences while simultaneously satisfying a critical mission need. The ideal candidate has a multidisciplinary background in physics, mathematics, and software engineering. This role requires a passion for solving challenging technical problems in a collaborative environment. This position is based in our Northridge, CA office. This position is classified as an exempt, non-supervisory, full-time role.\nWe have an impressive range of benefits, programs, and perks that we offer:\nHealth & Wellness:\nMedical, Dental & Vision Insurance\nLife and Long-Term Disability (LTD)\nVision Reimbursement\nFitness Reimbursement\nFinancial:\nCompany-funded 5% contribution to your 401(k) retirement plan\nCompany-funded 5% contribution to your Employee Stock Ownership Plan\nContinuing Education Assistance\nWork-Life Balance:\nFlexible Scheduling\nPaid Time Off (PTO)\nPaid Parental and Bereavement Leave\nWhat We Value:\nCreativity and innovation in solving challenges\nIntegrity and responsibility in all actions\nCollaboration across teams and specialties\nResponsiveness in fast-paced environments\nPassion for national security and excellence\nExperiences and Background We Look For:\nDemonstrated exposure to college level physics, math, and/or software engineering\nExperience with User Interface / User Experience front-end GUI development\nStrong programming skills in Python\nExperience programming in Qt and/or PyQt\nProficiency in React, modern JavaScript (ES6+), HTML, and CSS\nAbility to create wireframes and interactive prototypes\nKnowledge of version control using Git\nExcellent written and verbal communication skills - with an attention to detail\nIntellectual curiosity and a desire for continuous learning\nAbility to work with minimal supervision and collaborate with small teams in an Agile-like environment\nWillingness to work onsite in the office 100%\nMust be able to obtain and maintain a TS/SCI security clearance and program access\nNice to Have:\nWeb application configuration and deployment\nExperience working with relational databases\nStrong programming skills in C, C++, or similar languages\nData analysis and visualization skills\nExperience working in both Windows and Linux environments\nExperience with computer graphics using libraries such as OpenGL\nRemote sensing experience\nClassical signal/image processing experience\nComputer vision, image and data fusion, image classification or automated target recognition\nActive Top-Secret Clearance\nThe salary range for this role depends on the candidate's level of experience:\nEngineer 1: $95,000 - $120,000 [required BS degree or higher]\nEngineer 2: $110,000 - $135,000 [experience of BS+2 years, OR MS+0 years]\nStaff Engineer: $125,000 - $165,000 [experience of BS+5 years, MS+3 years, or PhD+0 years]\nHowever, Arete considers several factors when extending an offer of employment, including but not limited to: the position and associated responsibilities, a candidate's work experience, education/training, and key skills\nOther Considerations\nAreté is committed to the principles of equal employment opportunity and nondiscrimination, and we believe every person has the right to be treated with fairness, dignity, and equal consideration.\nAreté is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, marital status, national origin, age, veteran status, disability, or any other characteristic protected by applicable federal, state, or local law.\nU.S. citizenship is required to meet position eligibility.\nSuccessful passage of a criminal background screen is required to meet position eligibility.\nSelected applicants will be subject to a government security investigation and must meet eligibility requirements for access to classified information.\nAreté will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring.\nSuccessful passage of a Department of Transportation (DOT) drug test is required to meet position eligibility.\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our website because of your disability. To request an accommodation, please contact Areté Human Resources at 818-885-2200 for assistance."
        },
        {
            "company": "Arete",
            "role_name": "HPC Software Engineer",
            "score": 80.0,
            "fit_reason": "The candidate has strong experience in high-throughput data processing, simulation/modeling (Python/Pandas), and optimizing logic, directly aligning with transforming algorithms into robust operational software.",
            "missing_skills": [
                "MPI and OpenMP parallel programming models",
                "CUDA programming and GPU architecture optimization",
                "Physics-based modeling/simulation"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8713796/hpc-software-engineer",
            "location": "Northridge, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "At Areté, we are on the forefront of developing innovative solutions, with great minds from all backgrounds, to help solve the nation's most complex security challenges. We strive for an inclusive, collaborative team environment that approaches differences as opportunities for innovation and excellence. As an employee-owned company, we foster an atmosphere that propels diverse career opportunities and professional growth.\nDiscover your future with us\nWe are seeking a senior level candidate with a background in High Performance Computing Software Engineering. The ideal person would have a degree in Physics, Math, or Engineering coupled with a strong software development skillset. The successful candidate will work with scientists and engineers to transform advanced signal and image processing algorithms from higher level languages (e.g., Python) into robust and efficient software suitable for operational use. Other duties include practicing sound software processing methods to design, develop, analyze, and test software applications from prototype to operations, using modern software development languages and practices. Ability to assess algorithm performance on real-world data and document results via written reports and/or well-commented code is a must. This role requires a passion for solving challenging technical problems in a collaborative environment. This position is based in our Northridge, CA office. This position is classified as an exempt, non-supervisory, full-time role.\nWe have an impressive range of benefits, programs, and perks that we offer:\nHealth & Wellness:\nMedical, Dental & Vision Insurance\nLife and Long-Term Disability (LTD)\nVision Reimbursement\nFitness Reimbursement\nFinancial:\nCompany-funded 5% contribution to your 401(k) retirement plan\nCompany-funded 5% contribution to your Employee Stock Ownership Plan\nContinuing Education Assistance\nWork-Life Balance:\nFlexible Scheduling\nPaid Time Off (PTO)\nPaid Parental and Bereavement Leave\nWhat We Value:\nCreativity and innovation in solving challenges\nIntegrity and responsibility in all actions\nCollaboration across teams and specialties\nResponsiveness in fast-paced environments\nPassion for national security and excellence\nExperiences and Background We Look For:\nQualified candidates will have a college degree in a STEM field with a focus on scientific computing\nDemonstrated exposure to college level physics, math, and/or signal and image processing techniques\nStrong programming skills in Python, including scientific Python libraries such as numpy, scipy, pandas\nStrong programming skills in C, C++, or similar languages\nDemonstrated knowledge of MPI and OpenMP parallel programming models\nDemonstrated experience with CUDA programming and GPU architecture optimization\nExcellent written and verbal communication skills\nIntellectual curiosity and a desire for continuous learning\nAbility to work with minimal supervision and collaborate with small teams\nWillingness to work onsite in the office 100%\nMust be able to obtain and maintain a TS/SCI security clearance and program access\nNice to Have:\nData analysis and visualization skills\nExperience working in a Linux environment\nDemonstrated ability to optimize scientific computing applications\nExperience with User Interface / User Experience front-end GUI development\nPhysics-based modeling and simulation experience\nRemote sensing experience utilizing Electro-Optics or Synthetic Aperture RADAR\nClassical signal/image processing experience (detection, estimation, and tracking)\nComputer vision, image and data fusion, image classification or automated target recognition\nActive Top-Secret Clearance\nThe salary range for this role depends on the candidate's level of experience:\nEngineer 1: $95,000 - $120,000 [required BS degree or higher]\nEngineer 2: $115,000 - $140,000 [experience of BS+2 years, OR MS+0 years]\nStaff Engineer: $135,000 - $165,000 [experience of BS+5 years, MS+3 years, or PhD+0 years]\nHowever, Arete considers several factors when extending an offer of employment, including but not limited to: the position and associated responsibilities, a candidate's work experience, education/training, and key skills\nOther Considerations\nAreté is committed to the principles of equal employment opportunity and nondiscrimination, and we believe every person has the right to be treated with fairness, dignity, and equal consideration.\nAreté is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, marital status, national origin, age, veteran status, disability, or any other characteristic protected by applicable federal, state, or local law.\nU.S. citizenship is required to meet position eligibility.\nSuccessful passage of a criminal background screen is required to meet position eligibility.\nSelected applicants will be subject to a government security investigation and must meet eligibility requirements for access to classified information.\nAreté will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring.\nSuccessful passage of a Department of Transportation (DOT) drug test is required to meet position eligibility.\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our website because of your disability. To request an accommodation, please contact Areté Human Resources at 818-885-2200 for assistance."
        }
    ],
    "American Systems Corporation": [
        {
            "company": "American Systems Corporation",
            "role_name": "NAVAIR Software Engineer/Developer, Lead",
            "score": 85.0,
            "fit_reason": "The candidate has strong lead developer experience, expertise in AWS, Python, Java, and DevOps, which aligns well with the software engineer lead role, despite the job's preference for C/C++ and avionics experience.",
            "missing_skills": [
                "C/C++ programming (strong skillsets)",
                "Avionics and aircraft networks",
                "DO-178B/C DAL or higher experience",
                "Active TOP SECRET Clearance"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8713157/navair-software-engineerdeveloper-lead",
            "location": "Melbourne, FL",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "AMERICAN SYSTEMS is an employee-owned federal government contractor supporting national priority programs through our strategic solutions in Information Technology, Test & Evaluation, Program Mission Support, Engineering & Analysis, and Training.\nResponsibilities\nDevelop and document software development plans for mission critical aircraft systems\nSupport implementation of software development plans and practices\nDefine robust software test plans and methods\nSupport the definition and implementation of software architectures for new products\nAnalyze and assess software architectures for potential technical refresh improvements\nCoordinate with systems engineering in the development of software requirements\nObserve development team members in developing features and stories for software product development\nAnalyze and assess advanced technologies, toolsets, and frameworks for implementation in emerging software products\nObserve that development of mission critical software follows modern software practices\nPerform code reviews in support of system engineering technical reviews (SETRs)\nProvide input to contract data requirements list (CDRL) deliverables\nActive or have the ability to obtain Top Secret Clearance - U.S. Citizenship Required for the purposes of obtaining/holding a U.S. security clearance\nQualifications\nBachelor's degree and 8-10 years of related work experience\nAt least 5+ years of experience.\nMUST have an active TOP SECRET Clearance to start.\nDemonstrated experience in all phases of the software engineering lifecycle\nStrong skillsets in programming in C/C++\nExperience developing safety and mission critical software, preferable under DO-178B/C DAL or higher\nExperience developing software for real time systems\nStrong understanding of avionics and aircraft networks and network architectures\nExperience with modern software practices (DevOps) and configuration management tools\nDemonstrated ability to identify complex problems, evaluate trade space opportunities, and develop solutions\nDemonstrated experience with model based systems engineering and toolsets (Cameo)\nDemonstrated experience with modern software development processes such as Agile.\nDemonstrated experience with Modular Open Systems Approach (MOSA) and Open Mission Systems (OMS)\nUnderstanding of zero trust architecture and cross domain solution\nWill provide on-site support to the government at a contractor facility in Melbourne, FL\nPay Transparency Statement\nAMERICAN SYSTEMS is committed to pay transparency for our applicants and employee-owners. The salary range for this position is USD $94,400.00/Yr. - USD $157,600.00/Yr. Actual compensation will be determined based on several factors permitted by law. AMERICAN SYSTEMS provides for the welfare of its employees and their dependents through a comprehensive benefits program by offering healthcare benefits, paid leave, retirement plans, insurance programs, and education and training assistance.\nEEO Statement\nEEO Race/Sex/Disability Status/Veteran Status"
        }
    ],
    "LaunchCode": [],
    "PeopleTec": [],
    "Amentum": [
        {
            "company": "Amentum",
            "role_name": "Cyber Security Analyst - Senior II",
            "score": 80.0,
            "fit_reason": "The candidate has direct experience in cybersecurity policy/risk evaluation, alignment with NIST/SANS frameworks, and experience designing secure architectures (Zero Trust), making them a strong fit for RMF and A&A coordination.",
            "missing_skills": [
                "DoD 8570.01- M, IAT- Level III or IAM Level III certification (CISSP, CASP+, etc.)",
                "Experience with ACAS, Nessus, SCAP tools",
                "eMASS/Xacta systems"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8706237/cyber-security-analyst-senior-ii",
            "location": "Tampa, FL",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Amentum is seeking a\nCybersecurity Analyst\nposition in Tampa, FL.\nDescription - External\nPerforms assessment and authorization coordination. Advises and assists the customer with Risk Management Framework (RMF) and develops a Plan of Action and Milestones for resolving network deficiencies in accordance with DODI 8510.01 and ICD 503.\nThe duties of this task include assessing network compliance against controls listed in NIST 800-53 and creating A&A packages. Performs assessment, compliance, and validation of IT systems to support the Cybersecurity program at USSOCOM, its Component Commands, TSOCs, and deployed forces.\nThe Contractor shall execute a comprehensive assessment, compliance and validation of customer networks to ensure compliance with regulations and security and standards.\nThe end goal is to ensure the integrity of customer systems by identifying and mitigating potential shortcomings and vulnerabilities.\nAdvise USSOCOM, its Component Commands, TSOCs, and deployed forces on network and system risks, risk mitigation courses of action, and operational.\nAdditionally, the Cybersecurity Systems Analyst should be able to perform security evaluations and vulnerability assessments using the DOD Assured Compliance Assessment Solution (ACAS), Nessus vulnerability scanning tool and Security Content Automation Protocol tool.\nIdentify applicable STIGs and perform assessments using the Security Content Automation Protocol tool. The Cybersecurity Systems Analyst will liaison with network and system administrators to correct identified deficiencies.\nThe Cybersecurity Systems Analyst will also scan (or review scans) for new systems and applications being introduced into the SOF environment, identify issues, and draft certification letters for the government. The contractor will liaison with the Site Integration Facility (SIF) to ensure systems and application meet the standards in the DISA Security Technical Implementation Guides (STIG).\nThe Cybersecurity Systems analyst should be knowledgeable of cyber network defense tools such as end point security, SIEM, comply to connect, etc.\nTypical duties include\n:\n•    Tracks A&A status of SIE governed ISs. Ensures these artifacts and documentation are available in the USSOCOM-chosen automated tool for cybersecurity\nProvide DoD & IC RMF subject matter expertise to USSOCOM, its Component Commands, TSOCs, deployed forces and their delegates, including other Contractors, and assist with the development and execution of the RMF program at USSOCOM, its Component Commands, TSOCs, and deployed forces.\nMaintain, track, and validate DISN, cloud and DIA connection approval packages, including those from USSOCOM, its Component Commands, TSOCs, and other subordinate organizations.\nDevelop and maintain supporting documentation for new and existing networks, cloud environments, information systems and technologies as they are introduced into the SIE\nDevelop and review the A&A of SIE networks, cloud environments, systems, services, telecommunication circuits, mobile devices, portable electronic devices, hardware, and software using the DoD & IC RMF to obtain an Authority to Operate (ATO), Interim Authority to Test (IATT), or Authority to Connect (ATC).\nPerform risk and vulnerability assessments of IT and IS for authorization; prepare risk assessment reports for submission to the SCA and Authorizing Official/Designated Authorizing Official/Designated Accrediting Authority (AO/DAO/DAA) in accordance with DoD, DIA, USCYBERCOM, USSOCOM, Component Command, TSOC, and deployed forces' policies, procedures, and regulations.\nAssist USSOCOM, its Component Commands, TSOCs and deployed forces with the enforcement of A&A, as well as DoD, DIA, USSOCOM, Component Command, TSOC, and deployed forces' connection standards for networks and systems.\nTrack and maintain A&A databases, web sites and tools to ensure that networks, systems and devices are properly documented and managed from a cybersecurity perspective.\nTrack and report to higher headquarters organizations (e.g. USCYBERCOM, DIA) compliance with applicable Cybersecurity regulations and directives.\nEnsure timely notifications are made to responsible individuals and organizations in order to prevent lapses in accreditations (e.g., 30, 60, and 90 day notices).\nDevelop and maintain an Information Security Continuous Monitoring (ISCM) Plan. This plan shall address ongoing awareness of information security, vulnerabilities, security controls, and threats to support organizational risk management decisions.\n•    Identify, assess, and advise on cybersecurity control compliance and associated risks.\nCoordinate with USCYBERCOM, DoD, DIA, NSA, DISA, and subordinate organizations to support the resolution of issues with security, A&A, connection approvals, and waiver requests.\nPerform network, cloud, information systems, hardware, software and device security authorization and assessments, as well as the application and execution of policy, including project management support services.\nValidate the patching of systems, perform validation scanning, develop Plans of Action & Milestone (POA&Ms), and report as directed by applicable policies, procedures, and regulations.\n•    Provide subject matter expertise for COA development and the implementation of Cybersecurity mitigation strategies.\nDevelop and implement required processes, procedures, and capabilities to mitigate vulnerabilities and weaknesses for software and hardware deployment.   Identify, implement and validate continued effectiveness of key performance parameters and applied security measures\n•    Perform analytics on cybersecurity posture and provide reports to the AO/DAO and applicable stakeholders as required per ISCM and AO/DAO direction.\nQualifications - External\nKnowledge, Skills and Abilities:\nExperience with the US Combatant Commands (USCENTCOM/USSOCOM) is desired\nTechnical background with system administration experience, architecture and engineering preferred\nTechnical background in networking, identity management, Microsoft and Linux operating systems, database, and mobility\nWorking knowledge of the RMF.\nKnowledge of the Telos Xacta or Enterprise Mission Assurance Support Services (eMASS) system is desired.\nMust have excellent communications skill (written and oral) and interpersonal skills.\nKnowledge and experience with DoD IA processes and policies (e.g., DODI 8510.01, NIST, CNSS and other cybersecurity policies, Chairman of the Joint Chiefs of Staff Manual (CJCSM) 65101.01, Incident Response and other IA policies).\nActive TS/SCI clearance required.\nExperience, Education, & Certification Requirements\n:\nYears of Experience Required: 8+ yrs\nEducation Required: BA/BS\nCertification Required: Current DoD 8570.01- M, IAT- Level III or IAM Level III.\nExample Certs: CISSP (or Associate), CASP+CE, CISA, CISM, CCISO, GCED, GCIH, CCSP, or GSLC\nPhysical Requirements: May include lifting of weight up to forty (20) pounds as necessary\nWork Environment: Can involve inside or outside work depending on the task. An inside environment may be a cubicle\n(considerations: close quarters, low to moderate noise, bright or dim lighting). Outside work may include various\nenvironmental conditions including warm and cold climates. Needs to be able to work well with co-workers and all levels\nof management. No hazards on job or unusual environmental conditions.\nEquipment and Machines: Ability to operate office equipment such as a personal computer, printer, copy machine,\ntelephone, fax machine and other equipment including desk supplies and other work-related tools as required. Possess\nheavy and light equipment licenses, or the ability to obtain the necessary licenses.\nAttendance: Normal hours are Monday - Friday between 6:00am to 4:00pm.  With the exception of STD/LTD/FMLA & approved\ntime off, attendance is considered essential.\nOther Essential Functions:\nMust demonstrate professional behavior at all times when dealing with customers, management, and co-workers. Must have clear, concise and accurate communications skills in English, both verbal and written.\nGrooming and dress must be appropriate for the position and must not impose a safety risk to employees or others.\nMust maintain a positive work atmosphere by behaving and communicating in a professional manner.\nIndependent personal transportation to office or work site is required. Travel (up to 10%) to and from customer locations and test locations (government and vendor) may be required to support projects. This may involve airline travel. In some cases, accommodations can possibly be made for POV, if necessary.\nWhen operating any vehicle for work purposes, must wear seat belt and in addition, no cellular devices are to be used when vehicle is in motion\nCompensation Details:\n$105,000\nThe compensation range or hourly rate listed for this position is provided as a good-faith estimate of what the company intends to offer for this role at the time this posting was issued. Actual compensation may vary based on factors such as job responsibilities, education, experience, skills, internal equity, market data, applicable collective bargaining agreements, and relevant laws.\nBenefits Overview:\nOur health and welfare benefits are designed to support you and your priorities. Offerings include:\nHealth, dental, and vision insurance\nPaid time off and holidays\nRetirement benefits (including 401(k) matching)\nEducational reimbursement\nParental leave\nEmployee stock purchase plan\nTax-saving options\nDisability and life insurance\nPet insurance\nNote: Benefits may vary based on employment type, location, and applicable agreements. Positions governed by a Collective Bargaining Agreement (CBA), the McNamara-O'Hara Service Contract Act (SCA), or other employment contracts may include different provisions/benefits.\nOriginal Posting:\n01/14/2026 - Until Filled\nAmentum anticipates this job requisition will remain open for at least three days, with a closing date no earlier than three days after the original posting. This timeline may change based on business needs.\nAmentum is proud to be an Equal Opportunity Employer. Our hiring practices provide equal opportunity for employment without regard to race, sex, sexual orientation, pregnancy (including pregnancy, childbirth, breastfeeding, or medical conditions related to pregnancy, childbirth, or breastfeeding), age, ancestry, United States military or veteran status, color, religion, creed,  marital or domestic partner status, medical condition, genetic information, national origin, citizenship status, low-income status, or mental or physical disability so long as the essential functions of the job can be performed with or without reasonable accommodation, or any other protected category under federal, state, or local law. Learn more about your rights under Federal laws and supplemental language at  Labor Laws Posters ."
        }
    ],
    "Booz Allen Hamilton": [
        {
            "company": "Booz Allen Hamilton",
            "role_name": "Cybersecurity Risk Analyst",
            "score": 85.0,
            "fit_reason": "The candidate has direct experience in Cybersecurity Policy & Risk analysis, aligning perfectly with gap analysis, NIST/SANS framework evaluation, and vulnerability assessments.",
            "missing_skills": [
                "Secret clearance",
                "7+ years supporting Navy RMF/A&A activities",
                "Experience with eMASS",
                "DoD 8140 Certification"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8686375/cybersecurity-risk-analyst",
            "location": "San Diego, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Job Number: R0231256\nCybersecurity Risk Analyst\nThe Opportunity:\nAre you looking for an opportunity to advance your experience in information assurance and cybersecurity policy to safeguard our nation? As a systems security and network security engineer, you can identify the tools, applications, and systems needed to assess vulnerabilities and recommend the best solution and security strategy. We need your experience to develop and implement security solutions that will protect our military.\nOn our team, you'll troubleshoot and analyze complex challenges for customers using your knowledge of cybersecurity policy and risk management. You'll use your curiosity for technology and market trends to further research and develop security solutions. Using your experience in vulnerability scanning, virtualization, and cyber hardening, you'll assess security threats and implement infrastructure controls.\nIn this role, you'll closely impact Navy missions by championing cybersecurity, discovering cyber risks, and providing support to critical mission areas. With mentoring, challenging hands-on problem-solving, and opportunities to learn new tools and skills, we focus on growing as a team to make the best solutions for our customers.\nWork with us as we secure and protect our military's cybersecurity posture for the better.\nWhat You'll Work On:\nDevelop relationships quickly and easily with other teams, communicating the complexities of security with a wide variety of audiences, including senior management.\nImplement infrastructure and cybersecurity controls, including enhanced detection and vulnerability capabilities and improved event correlation in large enterprises.\nPerform risk and vulnerability assessments in network, system, and application areas.\nLeverage big data analytics and traditional security event types to identify advanced threats or indicators of compromise.\nJoin us. The world can't wait.\nYou Have:\n7+ years of experience supporting Navy Risk Management Framework ( RMF ) , including Assessment and Authorization ( A & A ) activities, development of RMF artifacts, and deliverables across all steps\n4+ years of experience performing cybersecurity compliance testing using industry standard tools, including Assured Compliance Assessment Solution ( ACAS ) , DoD Security Technical Implementation Guides ( STIGs ) , and Evaluate-STIG\nExperience with eMASS, including security plan development and hands-on processing of packages through workflows, analyzing security policies , evaluating assessment documentation, and developing written security risks, mitigations, and recommendations\nExperience performing vulnerability analysis of networks, systems, and communications protocols, communicating risks, findings, and status updates proactively to client leadership in a clear and actionable way, and with operating systems, platforms, and technologies, including Windows, Linux, cloud, or virtualization\nAbility to investigate and resolve issues that span multiple applications or technologies and require involvement from technical personnel across multiple organizations\nAbility to lead security authorization activities and coordinate with stakeholders such as system owners, engineers, and validators\nAbility to devise and execute client deliverables, work independently, identify problems, devise analysis and solutions, communicate results, and lead the accomplishments of client tasks from inception to completion\nSecret clearance\nBachelor's degree in CS, Computer Engineering, Systems Management, or IT\nDoD 8140 Certification\nNice If You Have:\nExperience leading meetings and developing presentations and briefings for use by senior leaders\nExperience analyzing technical and policy documentation for DoD organizations and implementing DoD directives\nExperience deploying, implementing, maintaining, and integrating cybersecurity tools and applications\nExperience with network engineering functions, including Windows, Linux, and virtual operating systems, security tools, platforms, and technologies, including network and web application firewalls, web proxy, int rus ion prevention systems, vulnerability scanners, and penetration tools\nKnowledge of DoD enterprise and tactical networks, including command and control and battlespace management systems, systems engineering and information technology, cloud architecture, and virtualization\nAbility to meet cyber schedule, performance, and quality met rics within the systems development lifecycle and acquisition lifecycle, and articulate industry best practice cybersecurity and threat-based cybersecurity frameworks and trends\nTop Secret clearance\nMaster's degree in CS, Computer Engineering, Systems Management, or IT\nOS Certification\nCEH, CISA, or CISSP Certification\nClearance:\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information ; Secret clearance is required.\nCompensation\nAt Booz Allen, we celebrate your contributions, provide you with opportunities and choices, and support your total well-being. Our offerings include health, life, disability, financial, and retirement benefits, as well as paid leave, professional development, tuition assistance, work-life programs, and dependent care. Our recognition awards program acknowledges employees for exceptional performance and superior demonstration of our values. Full-time and part-time employees working at least 20 hours a week on a regular basis are eligible to participate in Booz Allen's benefit programs. Individuals that do not meet the threshold are only eligible for select offerings, not inclusive of health benefits. We encourage you to learn more about our total benefits by visiting the Resource page on our Careers site and reviewing Our Employee Benefits page.\nSalary at Booz Allen is determined by various factors, including but not limited to location, the individual's particular combination of education, knowledge, skills, competencies, and experience, as well as contract-specific affordability and organizational requirements. The projected compensation range for this position is $99,000.00 to $225,000.00 (annualized USD). The estimate displayed represents the typical salary range for this position and is just one component of Booz Allen's total compensation package for employees. This posting will close within 90 days from the Posting Date.\nIdentity Statement\nAs part of the application process, you are expected to be on camera during interviews and assessments. We reserve the right to take your picture to verify your identity and prevent fraud.\nWork Model\nOur people-first culture prioritizes the benefits of flexibility and collaboration, whether that happens in person or remotely.\nIf this position is listed as remote or hybrid, you'll periodically work from a Booz Allen or client site facility.\nIf this position is listed as onsite, you'll work with colleagues and clients in person, as needed for the specific role.\nCommitment to Non-Discrimination\nAll qualified applicants will receive consideration for employment without regard to disability, status as a protected veteran or any other status protected by applicable federal, state, local, or international law."
        }
    ],
    "Aurex": [
        {
            "company": "Aurex",
            "role_name": "Software Architect",
            "score": 85.0,
            "fit_reason": "The candidate has direct experience designing system/software architectures, working with cloud-native architectures, microservices, containers (Docker), CI/CD, and operating in Agile environments, with relevant languages like Python and Java.",
            "missing_skills": [
                "Active DoD TS/SCI clearance",
                "SysML/UML/DoDAF experience",
                "Specific experience with SATCOM/C2 software environments",
                "Security+ CE or CISSP certification"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8705024/software-architect",
            "location": "El Segundo, CA",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Software Architect - ESS – Ground\nEl Segundo, CA\nWho We Are\nAurex is a mission-focused aerospace and defense company building the next frontier of deterrence. From hypersonics and missile defense to hardened networks and orbital systems, we design, test, and deliver the platforms that turn unproven ideas into battlefield-ready capability.\nBorn in Huntsville and built for speed, Aurex brings together aerospace veterans, combat-tested operators, and forward-leaning technologists to solve problems that matter—fast. We move from whiteboard to warfighter with precision, clarity, and zero tolerance for fluff.\nBasic Qualifications\n• 7+ years of experience in software architecture, enterprise software design, or digital engineering\n• 5+ years of experience with SATCOM, space systems, ground systems, or C2 software environments\n• Experience developing system or software architectures using UML, SysML, DoDAF, UPDM, or UAF\n• Experience developing Interface Control Documents (ICDs), service decompositions, and API definitions\n• Experience designing cloud-native architectures, microservices, containers, and CI/CD pipelines\n• Experience aligning architecture with cybersecurity frameworks and working in Agile environments or SAFe\n• Knowledge of secure coding and Zero Trust-aligned design principles\n• Active DoD TS/SCI clearance\n• Bachelor’s degree in a Science, Technology, Engineering, or Mathematics field\nPreferred Qualifications\n• Experience supporting MILSATCOM programs, Protected Tactical SATCOM (PTS), or similar DoD systems\n• Experience with MBSE tools such as Cameo, MagicDraw, Rhapsody, or Sparx EA\n• Experience designing solutions for hybrid cloud environments\n• Experience integrating AI, ML, or automation into enterprise software systems\n• Knowledge of modern waveform processing, signal routing, or SATCOM network architectures\n• Knowledge of acquisition processes, technical baselines, configuration control, and systems integration\n• Ability to communicate complex technical concepts to varied audiences\n• AWS Solutions Architect Associate or Professional, Azure Solutions Architect Expert, TOGAF, INCOSE ASEP, CSEP, ESEP, CISSP or CSSLP, or Certified Kubernetes Administrator (CKA) Certification\n• Ability to obtain a Security+ CE or CISSP Certification within 6 months of start date\nHow You Will Be Rewarded\nWe offer a comprehensive total rewards approach to compensation, providing incentives and benefits that extend far beyond the base salary. Compensation is determined by the candidate’s work experience, education, training, and relevant skills. We offer a competitive benefits package designed to support our employees' health, well-being, and professional growth.\nLocation: El Segundo, CA\n_________________\nThe salary range for this role is $175,000 - $225,000 annually. Aurex is an Equal Opportunity Employer. It prohibits discrimination, retaliation, or any type of harassment on the basis of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, citizenship, immigration status, or any other legally protected status in employment, including in hiring, firing, and recruiting decisions. All applicants must be authorized to work lawfully in the United States for positions at Aurex. There may be limited circumstances in which a law, regulation, executive order, or government contract would require certain citizenship; only in those limited circumstances would Aurex require certain citizenship status to comply with the relevant law, regulation, executive order, or government contract applicable to that position. For all other positions, Aurex does not consider an applicant’s citizenship but only requires that the applicant be authorized to work lawfully in the United States. If a position is one that falls under export control laws and regulations requiring authorization from the U.S. government to access export-controlled items, any hiring is contingent on the applicant passing the export compliance assessment, which is separate from the I-9 process, for that specific position. A background check will be required prior to any hire.\nElevate your career by joining the Aurex Platform, a leader in aerospace innovation!"
        }
    ],
    "Federal Bureau of Investigation (FBI)": [],
    "ASEC": [],
    "Toyon Research Corporation": [],
    "Northern Technologies Group, Inc.": [],
    "Brandes Associates Inc.": [],
    "Scientific Research Corporation": [],
    "CACI": [
        {
            "company": "CACI",
            "role_name": "Senior Data Protection Engineer",
            "score": 80.0,
            "fit_reason": "The candidate's experience engineering secure transfer pipelines, utilizing multi-step security protocols, and working on cross-domain solutions (implied by NGIC work) strongly aligns with implementing data protection (Purview, DRM) for Zero Trust.",
            "missing_skills": [
                "Active Top Secret clearance and SCI eligible",
                "10+ years of experience implementing and enforcing data protection in DoD organizations",
                "Significant hands-on experience configuring Microsoft Information Protection (MIP), Sensitivity Labels, and DLP policies",
                "DoD 8570 IAT II certification"
            ],
            "matching_skills": null,
            "link": "https://www.clearancejobs.com/jobs/8685057/senior-data-protection-engineer",
            "location": "Tampa, FL",
            "date_posted": "Unknown",
            "clearance": "Not Specified",
            "polygraph": "Not Specified",
            "full_description": "Job Title: Senior Data Protection Engineer\nJob Category: Security\nTime Type: Full time\nMinimum Clearance Required to Start: TS/SCI\nEmployee Type: Regular\nPercentage of Travel Required: Up to 10%\nType of Travel: Continental US\n* * *\nThe Opportunity:\nCACI is looking for an experienced\nData Protection Engineer\nto join the Network Execution Team to work on Zero Trust (ZT) implementation efforts in support of U.S. Special Operations Command (USSOCOM), in Tampa, FL.  This is a Senior-level engineering position on the\nEnterprise Development, Application and Training\n(EDAT)\ncontract. The position may include partial telework, but work will primarily take place at the customer site.\nThis role is essential for the tactical implementation of data-centric security controls across the Command's hybrid environment, ranging from commercial cloud capabilities on NIPR to the rigid, disconnected constraints of the SIPR and Top-Secret networks.\nAs a\nData Protection Engineer,\nyou will be the primary \"hands-on-keyboard\" implementer responsible for configuring, deploying, and tuning the encryption and labeling technologies that protect the Command's most sensitive data. You will translate the high-level architecture defined by the Chief Architect into concrete, enforceable policies within Microsoft Purview (for NIPR) and enterprise DRM platforms like Virtru or Kiteworks (for SIPR/Top Secret). You will move the Command from a passive \"audit\" posture to an active \"block\" posture, ensuring that data is encrypted, and persistent protection travels with the file regardless of where it is stored or transferred.\nResponsibilities:\nMicrosoft Purview Implementation (NIPR):\nConfigure and deploy Sensitivity Labels, Auto-labeling policies, and Data Loss Prevention (DLP) rules within the Microsoft 365 E5 suite to classify and protect CUI and PII in SharePoint, OneDrive, and Exchange.\nDRM & Encryption Configuration (SIPR/Top Secret):\nImplement and manage enterprise Digital Rights Management (DRM) solutions (specifically Virtru or Kiteworks) to enforce encryption-at-rest and attribute-based access control on classified networks.\nPolicy Tuning & Enforcement:\nOversee the phased transition of security policies from \"Monitoring\" mode to \"Blocking\" mode, analyzing false positives and tuning classifiers (Regex, Keyword Dictionaries, Trainable Classifiers) to minimize mission disruption.\nEndpoint Protection:\nCollaborate with the Trellix engineering team to ensure that data tags applied by Purview/DRM tools are correctly recognized and enforced by endpoint DLP agents on workstations.\nCross-Domain Support:\nAssist in the manual \"sneaker-net\" transfer of policy updates and classification patterns to the air-gapped Top Secret environment, ensuring configuration consistency across all networks.\nQualifications:\nRequired:\nMust\nhold a current Top Secret clearance and be SCI eligible.\nEducation:\nMA/MS Degree. A Senior labor category typically works on high-visibility or mission critical aspects of a given program and performs all functional duties independently. A Senior labor category may oversee the efforts of less senior staff and/or be responsible for the efforts of all staff assigned to a specific job. Bachelor's degree in computer science, Information Systems, Cybersecurity, or related field acceptable with additional experience (Master's preferred).\n10+ years of experience implementing and enforcing data protection in DoD organizations. Additional years of experience may be used in place of Education requirement.\nMicrosoft Purview Expertise: Significant (3+ years) hands-on experience configuring Microsoft Information Protection (MIP), Sensitivity Labels, and DLP policies in a large enterprise or DoD environment.\nDRM/Encryption Experience: Proven experience implementing and managing enterprise encryption and Rights Management tools such as Virtru, Kiteworks, or Seclore, particularly in on-premise or hybrid configurations.\nData Classification: Strong understanding of data classification methodologies, including the creation of custom sensitive info types (SITs) using Regex and Exact Data Match (EDM).\nTechnical Troubleshooting: Ability to diagnose and resolve complex issues related to encryption key management, policy propagation, and agent conflicts.\nDoD 8140 Compliance.\nDoDM 8570 IAT II certification (e.g. CompTIA Security+) or higher.\nDesired:\nDoD 8570 Compliance: Meet IAT Level III and IASAE II requirements\nMicrosoft Information Protection Administrator (SC-400) certification.\nVirtru Certified Professional or Kiteworks Administrator Certification.\nExperience with Trellix DLP (formerly McAfee) endpoint products.\nKnowledge of NetApp BlueXP or BigID for data discovery.\nPrior experience supporting USSOCOM or working on SIPRNet/JWICS systems.\nFamiliarity with DoD Data Strategy and CUI handling requirements.\nStrong communication skills with ability to brief senior leadership and interface with stakeholders.\nAbility to lead teams in complex, multi-vendor environments.\n-\n_________________________________________________________________________\nWhat You Can Expect:\nA culture of integrity.\nAt CACI, we place character and innovation at the center of everything we do. As a valued team member, you'll be part of a high-performing group dedicated to our customer's missions and driven by a higher purpose - to ensure the safety of our nation.\nAn environment of trust.\nCACI values the unique contributions that every employee brings to our company and our customers - every day. You'll have the autonomy to take the time you need through a unique flexible time off benefit and have access to robust learning resources to make your ambitions a reality.\nA focus on continuous growth.\nTogether, we will advance our nation's most critical missions, build on our lengthy track record of business success, and find opportunities to break new ground - in your career and in our legacy.\nYour potential is limitless.\nSo is ours.\n_________________________________________________________________________\nPay Range\n: There are a host of factors that can influence final salary including, but not limited to, geographic location, Federal Government contract labor categories and contract wage rates, relevant prior work experience, specific skills and competencies, education, and certifications. Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives. We offer competitive compensation, benefits and learning and development opportunities. Our broad and competitive mix of benefits options is designed to support and protect employees and their families. At CACI, you will receive comprehensive benefits such as; healthcare, wellness, financial, retirement, family support, continuing education, and time off benefits.\nThe proposed salary range for this position is:\n$99,800 - $219,600\nCACI is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, age, national origin, disability, status as a protected veteran, or any other protected characteristic."
        }
    ],
    "Akima": [],
    "ENSCO, Inc.": []
}